/*
 * Copyright (c) 2012 - 2019, Nordic Semiconductor ASA
 * All rights reserved.
 *
 * Redistribution and use in source and binary forms, with or without modification,
 * are permitted provided that the following conditions are met:
 *
 * 1. Redistributions of source code must retain the above copyright notice, this
 *    list of conditions and the following disclaimer.
 *
 * 2. Redistributions in binary form, except as embedded into a Nordic
 *    Semiconductor ASA integrated circuit in a product or a software update for
 *    such product, must reproduce the above copyright notice, this list of
 *    conditions and the following disclaimer in the documentation and/or other
 *    materials provided with the distribution.
 *
 * 3. Neither the name of Nordic Semiconductor ASA nor the names of its
 *    contributors may be used to endorse or promote products derived from this
 *    software without specific prior written permission.
 *
 * 4. This software, with or without modification, must only be used with a
 *    Nordic Semiconductor ASA integrated circuit.
 *
 * 5. Any software provided in binary form under this license must not be reverse
 *    engineered, decompiled, modified and/or disassembled.
 *
 * THIS SOFTWARE IS PROVIDED BY NORDIC SEMICONDUCTOR ASA "AS IS" AND ANY EXPRESS
 * OR IMPLIED WARRANTIES, INCLUDING, BUT NOT LIMITED TO, THE IMPLIED WARRANTIES
 * OF MERCHANTABILITY, NONINFRINGEMENT, AND FITNESS FOR A PARTICULAR PURPOSE ARE

pub const NRF_RADIO_EARLIEST_TIMEOUT_MAX_US: u32 = 127999999;
pub const NRF_RADIO_START_JITTER_US: u32 = 2;
pub const SD_TIMERS_USED: u32 = 1;
pub const SD_SWI_USED: u32 = 54;
pub const MBR_SVC_BASE: u32 = 24;
pub const MBR_PAGE_SIZE_IN_WORDS: u32 = 1024;
pub const MBR_SIZE: u32 = 4096;
pub const MBR_BOOTLOADER_ADDR: u32 = 4088;
pub const MBR_PARAM_PAGE_ADDR: u32 = 4092;
pub const NRF_ERROR_SDM_LFCLK_SOURCE_UNKNOWN: u32 = 4096;
pub const NRF_ERROR_SDM_INCORRECT_INTERRUPT_CONFIGURATION: u32 = 4097;
pub const NRF_ERROR_SDM_INCORRECT_CLENR0: u32 = 4098;
pub const SD_MAJOR_VERSION: u32 = 7;
pub const SD_MINOR_VERSION: u32 = 0;
pub const SD_BUGFIX_VERSION: u32 = 1;
pub const SD_VARIANT_ID: u32 = 140;
pub const SD_VERSION: u32 = 7000001;
pub const SDM_SVC_BASE: u32 = 16;
pub const SD_UNIQUE_STR_SIZE: u32 = 20;
pub const SDM_INFO_FIELD_INVALID: u32 = 0;
pub const SOFTDEVICE_INFO_STRUCT_OFFSET: u32 = 8192;
pub const SOFTDEVICE_INFO_STRUCT_ADDRESS: u32 = 12288;
pub const SD_INFO_STRUCT_SIZE_OFFSET: u32 = 8192;
pub const SD_SIZE_OFFSET: u32 = 8200;
pub const SD_FWID_OFFSET: u32 = 8204;
pub const SD_ID_OFFSET: u32 = 8208;
pub const SD_VERSION_OFFSET: u32 = 8212;
pub const SD_UNIQUE_STR_OFFSET: u32 = 8216;
pub const SD_FLASH_SIZE: u32 = 155648;
pub const NRF_FAULT_ID_SD_RANGE_START: u32 = 0;
pub const NRF_FAULT_ID_APP_RANGE_START: u32 = 4096;
pub const NRF_FAULT_ID_SD_ASSERT: u32 = 1;
pub const NRF_FAULT_ID_APP_MEMACC: u32 = 4097;
pub const NRF_CLOCK_LF_ACCURACY_250_PPM: u32 = 0;
pub const NRF_CLOCK_LF_ACCURACY_500_PPM: u32 = 1;
pub const NRF_CLOCK_LF_ACCURACY_150_PPM: u32 = 2;
pub const NRF_CLOCK_LF_ACCURACY_100_PPM: u32 = 3;
pub const NRF_CLOCK_LF_ACCURACY_75_PPM: u32 = 4;
pub const NRF_CLOCK_LF_ACCURACY_50_PPM: u32 = 5;
pub const NRF_CLOCK_LF_ACCURACY_30_PPM: u32 = 6;
pub const NRF_CLOCK_LF_ACCURACY_20_PPM: u32 = 7;
pub const NRF_CLOCK_LF_ACCURACY_10_PPM: u32 = 8;
pub const NRF_CLOCK_LF_ACCURACY_5_PPM: u32 = 9;
pub const NRF_CLOCK_LF_ACCURACY_2_PPM: u32 = 10;
pub const NRF_CLOCK_LF_ACCURACY_1_PPM: u32 = 11;
pub const NRF_CLOCK_LF_SRC_RC: u32 = 0;
pub const NRF_CLOCK_LF_SRC_XTAL: u32 = 1;
pub const NRF_CLOCK_LF_SRC_SYNTH: u32 = 2;
pub type int_least64_t = i64;
pub type uint_least64_t = u64;
pub type int_fast64_t = i64;
pub type uint_fast64_t = u64;
pub type int_least32_t = i32;
pub type uint_least32_t = u32;
pub type int_fast32_t = i32;
pub type uint_fast32_t = u32;
pub type int_least16_t = i16;
pub type uint_least16_t = u16;
pub type int_fast16_t = i16;
pub type uint_fast16_t = u16;
pub type int_least8_t = i8;
pub type uint_least8_t = u8;
pub type int_fast8_t = i8;
pub type uint_fast8_t = u8;
pub type intmax_t = self::c_longlong;
pub type uintmax_t = self::c_ulonglong;
#[doc = " @brief 128 bit UUID values."]
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct ble_uuid128_t {
    #[doc = "< Little-Endian UUID bytes."]
    pub uuid128: [u8; 16usize],
}
#[test]
fn bindgen_test_layout_ble_uuid128_t() {
    assert_eq!(
        ::core::mem::size_of::<ble_uuid128_t>(),
        16usize,
        concat!("Size of: ", stringify!(ble_uuid128_t))
    );
    assert_eq!(
        ::core::mem::align_of::<ble_uuid128_t>(),
        1usize,
        concat!("Alignment of ", stringify!(ble_uuid128_t))
    );
    assert_eq!(
        unsafe { &(*(::core::ptr::null::<ble_uuid128_t>())).uuid128 as *const _ as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(ble_uuid128_t),
            "::",
            stringify!(uuid128)
        )
    );
}
#[doc = " @brief  Bluetooth Low Energy UUID type, encapsulates both 16-bit and 128-bit UUIDs."]
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct ble_uuid_t {
    #[doc = "< 16-bit UUID value or octets 12-13 of 128-bit UUID."]
    pub uuid: u16,
    #[doc = "< UUID type, see @ref BLE_UUID_TYPES. If type is @ref BLE_UUID_TYPE_UNKNOWN, the value of uuid is undefined."]
    pub type_: u8,
}
#[test]
fn bindgen_test_layout_ble_uuid_t() {
    assert_eq!(
        ::core::mem::size_of::<ble_uuid_t>(),
        4usize,
        concat!("Size of: ", stringify!(ble_uuid_t))
    );
    assert_eq!(
        ::core::mem::align_of::<ble_uuid_t>(),
        2usize,
        concat!("Alignment of ", stringify!(ble_uuid_t))
    );
    assert_eq!(
        unsafe { &(*(::core::ptr::null::<ble_uuid_t>())).uuid as *const _ as usize },
        0usize,
        concat!("Offset of field: ", stringify!(ble_uuid_t), "::", stringify!(uuid))
    );
    assert_eq!(
        unsafe { &(*(::core::ptr::null::<ble_uuid_t>())).type_ as *const _ as usize },
        2usize,
        concat!("Offset of field: ", stringify!(ble_uuid_t), "::", stringify!(type_))
    );
}
#[doc = "@brief Data structure."]
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct ble_data_t {
    #[doc = "< Pointer to the data buffer provided to/from the application."]
    pub p_data: *mut u8,
    #[doc = "< Length of the data buffer, in bytes."]
    pub len: u16,
}
#[test]
fn bindgen_test_layout_ble_data_t() {
    assert_eq!(
        ::core::mem::size_of::<ble_data_t>(),
        8usize,
        concat!("Size of: ", stringify!(ble_data_t))
    );
    assert_eq!(
        ::core::mem::align_of::<ble_data_t>(),
        4usize,
        concat!("Alignment of ", stringify!(ble_data_t))
    );
    assert_eq!(
        unsafe { &(*(::core::ptr::null::<ble_data_t>())).p_data as *const _ as usize },
        0usize,
        concat!("Offset of field: ", stringify!(ble_data_t), "::", stringify!(p_data))
    );
    assert_eq!(
        unsafe { &(*(::core::ptr::null::<ble_data_t>())).len as *const _ as usize },
        4usize,
        concat!("Offset of field: ", stringify!(ble_data_t), "::", stringify!(len))
    );
}
#[doc = "< Set own Bluetooth Address."]
pub const BLE_GAP_SVCS_SD_BLE_GAP_ADDR_SET: BLE_GAP_SVCS = 108;
#[doc = "< Get own Bluetooth Address."]
pub const BLE_GAP_SVCS_SD_BLE_GAP_ADDR_GET: BLE_GAP_SVCS = 109;
#[doc = "< Set active whitelist."]
pub const BLE_GAP_SVCS_SD_BLE_GAP_WHITELIST_SET: BLE_GAP_SVCS = 110;
#[doc = "< Set device identity list."]
pub const BLE_GAP_SVCS_SD_BLE_GAP_DEVICE_IDENTITIES_SET: BLE_GAP_SVCS = 111;
#[doc = "< Set Privacy settings"]
pub const BLE_GAP_SVCS_SD_BLE_GAP_PRIVACY_SET: BLE_GAP_SVCS = 112;
#[doc = "< Get Privacy settings"]
pub const BLE_GAP_SVCS_SD_BLE_GAP_PRIVACY_GET: BLE_GAP_SVCS = 113;
#[doc = "< Configure an advertising set."]
pub const BLE_GAP_SVCS_SD_BLE_GAP_ADV_SET_CONFIGURE: BLE_GAP_SVCS = 114;
#[doc = "< Start Advertising."]
pub const BLE_GAP_SVCS_SD_BLE_GAP_ADV_START: BLE_GAP_SVCS = 115;
#[doc = "< Stop Advertising."]
pub const BLE_GAP_SVCS_SD_BLE_GAP_ADV_STOP: BLE_GAP_SVCS = 116;
#[doc = "< Connection Parameter Update."]
pub const BLE_GAP_SVCS_SD_BLE_GAP_CONN_PARAM_UPDATE: BLE_GAP_SVCS = 117;
#[doc = "< Disconnect."]
pub const BLE_GAP_SVCS_SD_BLE_GAP_DISCONNECT: BLE_GAP_SVCS = 118;
#[doc = "< Set TX Power."]
pub const BLE_GAP_SVCS_SD_BLE_GAP_TX_POWER_SET: BLE_GAP_SVCS = 119;
#[doc = "< Set Appearance."]
pub const BLE_GAP_SVCS_SD_BLE_GAP_APPEARANCE_SET: BLE_GAP_SVCS = 120;
#[doc = "< Get Appearance."]
pub const BLE_GAP_SVCS_SD_BLE_GAP_APPEARANCE_GET: BLE_GAP_SVCS = 121;
#[doc = "< Set PPCP."]
pub const BLE_GAP_SVCS_SD_BLE_GAP_PPCP_SET: BLE_GAP_SVCS = 122;
#[doc = "< Get PPCP."]
pub const BLE_GAP_SVCS_SD_BLE_GAP_PPCP_GET: BLE_GAP_SVCS = 123;
#[doc = "< Set Device Name."]
pub const BLE_GAP_SVCS_SD_BLE_GAP_DEVICE_NAME_SET: BLE_GAP_SVCS = 124;
#[doc = "< Get Device Name."]
pub const BLE_GAP_SVCS_SD_BLE_GAP_DEVICE_NAME_GET: BLE_GAP_SVCS = 125;
#[doc = "< Initiate Pairing/Bonding."]
pub const BLE_GAP_SVCS_SD_BLE_GAP_AUTHENTICATE: BLE_GAP_SVCS = 126;
#[doc = "< Reply with Security Parameters."]
pub const BLE_GAP_SVCS_SD_BLE_GAP_SEC_PARAMS_REPLY: BLE_GAP_SVCS = 127;
#[doc = "< Reply with an authentication key."]
pub const BLE_GAP_SVCS_SD_BLE_GAP_AUTH_KEY_REPLY: BLE_GAP_SVCS = 128;
#[doc = "< Reply with an LE Secure Connections DHKey."]
pub const BLE_GAP_SVCS_SD_BLE_GAP_LESC_DHKEY_REPLY: BLE_GAP_SVCS = 129;
#[doc = "< Notify of a keypress during an authentication procedure."]
pub const BLE_GAP_SVCS_SD_BLE_GAP_KEYPRESS_NOTIFY: BLE_GAP_SVCS = 130;
#[doc = "< Get the local LE Secure Connections OOB data."]
pub const BLE_GAP_SVCS_SD_BLE_GAP_LESC_OOB_DATA_GET: BLE_GAP_SVCS = 131;
#[doc = "< Set the remote LE Secure Connections OOB data."]
pub const BLE_GAP_SVCS_SD_BLE_GAP_LESC_OOB_DATA_SET: BLE_GAP_SVCS = 132;
#[doc = "< Initiate encryption procedure."]
pub const BLE_GAP_SVCS_SD_BLE_GAP_ENCRYPT: BLE_GAP_SVCS = 133;
#[doc = "< Reply with Security Information."]
pub const BLE_GAP_SVCS_SD_BLE_GAP_SEC_INFO_REPLY: BLE_GAP_SVCS = 134;
#[doc = "< Obtain connection security level."]
pub const BLE_GAP_SVCS_SD_BLE_GAP_CONN_SEC_GET: BLE_GAP_SVCS = 135;
#[doc = "< Start reporting of changes in RSSI."]
pub const BLE_GAP_SVCS_SD_BLE_GAP_RSSI_START: BLE_GAP_SVCS = 136;
#[doc = "< Stop reporting of changes in RSSI."]
pub const BLE_GAP_SVCS_SD_BLE_GAP_RSSI_STOP: BLE_GAP_SVCS = 137;
#[doc = "< Start Scanning."]
pub const BLE_GAP_SVCS_SD_BLE_GAP_SCAN_START: BLE_GAP_SVCS = 138;
#[doc = "< Stop Scanning."]
pub const BLE_GAP_SVCS_SD_BLE_GAP_SCAN_STOP: BLE_GAP_SVCS = 139;
#[doc = "< Connect."]
pub const BLE_GAP_SVCS_SD_BLE_GAP_CONNECT: BLE_GAP_SVCS = 140;
#[doc = "< Cancel ongoing connection procedure."]
pub const BLE_GAP_SVCS_SD_BLE_GAP_CONNECT_CANCEL: BLE_GAP_SVCS = 141;
#[doc = "< Get the last RSSI sample."]
pub const BLE_GAP_SVCS_SD_BLE_GAP_RSSI_GET: BLE_GAP_SVCS = 142;
#[doc = "< Initiate or respond to a PHY Update Procedure."]
pub const BLE_GAP_SVCS_SD_BLE_GAP_PHY_UPDATE: BLE_GAP_SVCS = 143;
#[doc = "< Initiate or respond to a Data Length Update Procedure."]
pub const BLE_GAP_SVCS_SD_BLE_GAP_DATA_LENGTH_UPDATE: BLE_GAP_SVCS = 144;
#[doc = "< Start Quality of Service (QoS) channel survey module."]
pub const BLE_GAP_SVCS_SD_BLE_GAP_QOS_CHANNEL_SURVEY_START: BLE_GAP_SVCS = 145;
#[doc = "< Stop Quality of Service (QoS) channel survey module."]
pub const BLE_GAP_SVCS_SD_BLE_GAP_QOS_CHANNEL_SURVEY_STOP: BLE_GAP_SVCS = 146;
#[doc = "< Get the Address used on air while Advertising."]
pub const BLE_GAP_SVCS_SD_BLE_GAP_ADV_ADDR_GET: BLE_GAP_SVCS = 147;
#[doc = "< Get the next connection event counter."]
pub const BLE_GAP_SVCS_SD_BLE_GAP_NEXT_CONN_EVT_COUNTER_GET: BLE_GAP_SVCS = 148;
pub const BLE_GAP_SVCS_SD_BLE_GAP_CONN_EVT_TRIGGER_START: BLE_GAP_SVCS = 149;
#[doc = " Start triggering a given task on connection event start."]
pub const BLE_GAP_SVCS_SD_BLE_GAP_CONN_EVT_TRIGGER_STOP: BLE_GAP_SVCS = 150;
#[doc = "@brief GAP API SVC numbers."]
pub type BLE_GAP_SVCS = self::c_uint;
#[doc = "< Connected to peer.                              \\n See @ref ble_gap_evt_connected_t"]
pub const BLE_GAP_EVTS_BLE_GAP_EVT_CONNECTED: BLE_GAP_EVTS = 16;
#[doc = "< Disconnected from peer.                         \\n See @ref ble_gap_evt_disconnected_t."]
pub const BLE_GAP_EVTS_BLE_GAP_EVT_DISCONNECTED: BLE_GAP_EVTS = 17;
#[doc = "< Connection Parameters updated.                  \\n See @ref ble_gap_evt_conn_param_update_t."]
pub const BLE_GAP_EVTS_BLE_GAP_EVT_CONN_PARAM_UPDATE: BLE_GAP_EVTS = 18;
#[doc = "< Request to provide security parameters.         \\n Reply with @ref sd_ble_gap_sec_params_reply.  \\n See @ref ble_gap_evt_sec_params_request_t."]
pub const BLE_GAP_EVTS_BLE_GAP_EVT_SEC_PARAMS_REQUEST: BLE_GAP_EVTS = 19;
#[doc = "< Request to provide security information.        \\n Reply with @ref sd_ble_gap_sec_info_reply.    \\n See @ref ble_gap_evt_sec_info_request_t."]
pub const BLE_GAP_EVTS_BLE_GAP_EVT_SEC_INFO_REQUEST: BLE_GAP_EVTS = 20;
#[doc = "< Request to display a passkey to the user.       \\n In LESC Numeric Comparison, reply with @ref sd_ble_gap_auth_key_reply. \\n See @ref ble_gap_evt_passkey_display_t."]
pub const BLE_GAP_EVTS_BLE_GAP_EVT_PASSKEY_DISPLAY: BLE_GAP_EVTS = 21;
#[doc = "< Notification of a keypress on the remote device.\\n See @ref ble_gap_evt_key_pressed_t"]
pub const BLE_GAP_EVTS_BLE_GAP_EVT_KEY_PRESSED: BLE_GAP_EVTS = 22;
#[doc = "< Request to provide an authentication key.       \\n Reply with @ref sd_ble_gap_auth_key_reply.    \\n See @ref ble_gap_evt_auth_key_request_t."]
pub const BLE_GAP_EVTS_BLE_GAP_EVT_AUTH_KEY_REQUEST: BLE_GAP_EVTS = 23;
#[doc = "< Request to calculate an LE Secure Connections DHKey. \\n Reply with @ref sd_ble_gap_lesc_dhkey_reply.  \\n See @ref ble_gap_evt_lesc_dhkey_request_t"]
pub const BLE_GAP_EVTS_BLE_GAP_EVT_LESC_DHKEY_REQUEST: BLE_GAP_EVTS = 24;
#[doc = "< Authentication procedure completed with status. \\n See @ref ble_gap_evt_auth_status_t."]
pub const BLE_GAP_EVTS_BLE_GAP_EVT_AUTH_STATUS: BLE_GAP_EVTS = 25;
#[doc = "< Connection security updated.                    \\n See @ref ble_gap_evt_conn_sec_update_t."]
pub const BLE_GAP_EVTS_BLE_GAP_EVT_CONN_SEC_UPDATE: BLE_GAP_EVTS = 26;
#[doc = "< Timeout expired.                                \\n See @ref ble_gap_evt_timeout_t."]
pub const BLE_GAP_EVTS_BLE_GAP_EVT_TIMEOUT: BLE_GAP_EVTS = 27;
#[doc = "< RSSI report.                                    \\n See @ref ble_gap_evt_rssi_changed_t."]
pub const BLE_GAP_EVTS_BLE_GAP_EVT_RSSI_CHANGED: BLE_GAP_EVTS = 28;
#[doc = "< Advertising report.                             \\n See @ref ble_gap_evt_adv_report_t."]
pub const BLE_GAP_EVTS_BLE_GAP_EVT_ADV_REPORT: BLE_GAP_EVTS = 29;
#[doc = "< Security Request.                               \\n See @ref ble_gap_evt_sec_request_t."]
pub const BLE_GAP_EVTS_BLE_GAP_EVT_SEC_REQUEST: BLE_GAP_EVTS = 30;
#[doc = "< Connection Parameter Update Request.            \\n Reply with @ref sd_ble_gap_conn_param_update. \\n See @ref ble_gap_evt_conn_param_update_request_t."]
pub const BLE_GAP_EVTS_BLE_GAP_EVT_CONN_PARAM_UPDATE_REQUEST: BLE_GAP_EVTS = 31;
#[doc = "< Scan request report.                            \\n See @ref ble_gap_evt_scan_req_report_t."]
pub const BLE_GAP_EVTS_BLE_GAP_EVT_SCAN_REQ_REPORT: BLE_GAP_EVTS = 32;
#[doc = "< PHY Update Request.                             \\n Reply with @ref sd_ble_gap_phy_update. \\n See @ref ble_gap_evt_phy_update_request_t."]
pub const BLE_GAP_EVTS_BLE_GAP_EVT_PHY_UPDATE_REQUEST: BLE_GAP_EVTS = 33;
#[doc = "< PHY Update Procedure is complete.               \\n See @ref ble_gap_evt_phy_update_t."]
pub const BLE_GAP_EVTS_BLE_GAP_EVT_PHY_UPDATE: BLE_GAP_EVTS = 34;
#[doc = "< Data Length Update Request.                     \\n Reply with @ref sd_ble_gap_data_length_update. \\n See @ref ble_gap_evt_data_length_update_request_t."]
pub const BLE_GAP_EVTS_BLE_GAP_EVT_DATA_LENGTH_UPDATE_REQUEST: BLE_GAP_EVTS = 35;
#[doc = "< LL Data Channel PDU payload length updated.     \\n See @ref ble_gap_evt_data_length_update_t."]
pub const BLE_GAP_EVTS_BLE_GAP_EVT_DATA_LENGTH_UPDATE: BLE_GAP_EVTS = 36;
#[doc = "< Channel survey report.                          \\n See @ref ble_gap_evt_qos_channel_survey_report_t."]
pub const BLE_GAP_EVTS_BLE_GAP_EVT_QOS_CHANNEL_SURVEY_REPORT: BLE_GAP_EVTS = 37;
#[doc = "< Advertising set terminated.                     \\n See @ref ble_gap_evt_adv_set_terminated_t."]
pub const BLE_GAP_EVTS_BLE_GAP_EVT_ADV_SET_TERMINATED: BLE_GAP_EVTS = 38;
#[doc = "@brief GAP Event IDs."]
#[doc = " IDs that uniquely identify an event coming from the stack to the application."]
pub type BLE_GAP_EVTS = self::c_uint;
#[doc = "< Channel Map. @ref ble_gap_opt_ch_map_t"]
pub const BLE_GAP_OPTS_BLE_GAP_OPT_CH_MAP: BLE_GAP_OPTS = 32;
#[doc = "< Local connection latency. @ref ble_gap_opt_local_conn_latency_t"]
pub const BLE_GAP_OPTS_BLE_GAP_OPT_LOCAL_CONN_LATENCY: BLE_GAP_OPTS = 33;
#[doc = "< Set passkey. @ref ble_gap_opt_passkey_t"]
pub const BLE_GAP_OPTS_BLE_GAP_OPT_PASSKEY: BLE_GAP_OPTS = 34;
#[doc = "< Compatibility mode. @ref ble_gap_opt_compat_mode_1_t"]
pub const BLE_GAP_OPTS_BLE_GAP_OPT_COMPAT_MODE_1: BLE_GAP_OPTS = 35;
#[doc = "< Set Authenticated payload timeout. @ref ble_gap_opt_auth_payload_timeout_t"]
pub const BLE_GAP_OPTS_BLE_GAP_OPT_AUTH_PAYLOAD_TIMEOUT: BLE_GAP_OPTS = 36;
#[doc = "< Disable slave latency. @ref ble_gap_opt_slave_latency_disable_t"]
pub const BLE_GAP_OPTS_BLE_GAP_OPT_SLAVE_LATENCY_DISABLE: BLE_GAP_OPTS = 37;
#[doc = "@brief GAP Option IDs."]
#[doc = " IDs that uniquely identify a GAP option."]
pub type BLE_GAP_OPTS = self::c_uint;
#[doc = "< Role count configuration."]
pub const BLE_GAP_CFGS_BLE_GAP_CFG_ROLE_COUNT: BLE_GAP_CFGS = 64;
#[doc = "< Device name configuration."]
pub const BLE_GAP_CFGS_BLE_GAP_CFG_DEVICE_NAME: BLE_GAP_CFGS = 65;
#[doc = "< Peripheral Preferred Connection Parameters characteristic"]
#[doc = "inclusion configuration."]
pub const BLE_GAP_CFGS_BLE_GAP_CFG_PPCP_INCL_CONFIG: BLE_GAP_CFGS = 66;
#[doc = "< Central Address Resolution characteristic"]
#[doc = "inclusion configuration."]
pub const BLE_GAP_CFGS_BLE_GAP_CFG_CAR_INCL_CONFIG: BLE_GAP_CFGS = 67;
#[doc = "@brief GAP Configuration IDs."]
#[doc = ""]
#[doc = " IDs that uniquely identify a GAP configuration."]
pub type BLE_GAP_CFGS = self::c_uint;
#[doc = "< Advertiser role."]
pub const BLE_GAP_TX_POWER_ROLES_BLE_GAP_TX_POWER_ROLE_ADV: BLE_GAP_TX_POWER_ROLES = 1;
#[doc = "< Scanner and initiator role."]
pub const BLE_GAP_TX_POWER_ROLES_BLE_GAP_TX_POWER_ROLE_SCAN_INIT: BLE_GAP_TX_POWER_ROLES = 2;
#[doc = "< Connection role."]
pub const BLE_GAP_TX_POWER_ROLES_BLE_GAP_TX_POWER_ROLE_CONN: BLE_GAP_TX_POWER_ROLES = 3;
#[doc = "@brief GAP TX Power roles."]
pub type BLE_GAP_TX_POWER_ROLES = self::c_uint;
#[doc = "@brief Advertising event properties."]
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct ble_gap_adv_properties_t {
    #[doc = "< Advertising type. See @ref BLE_GAP_ADV_TYPES."]
    pub type_: u8,
    pub _bitfield_1: __BindgenBitfieldUnit<[u8; 1usize], u8>,
}
#[test]
fn bindgen_test_layout_ble_gap_adv_properties_t() {
    assert_eq!(
        ::core::mem::size_of::<ble_gap_adv_properties_t>(),
        2usize,
        concat!("Size of: ", stringify!(ble_gap_adv_properties_t))
    );
    assert_eq!(
        ::core::mem::align_of::<ble_gap_adv_properties_t>(),
        1usize,
        concat!("Alignment of ", stringify!(ble_gap_adv_properties_t))
    );
    assert_eq!(
        unsafe { &(*(::core::ptr::null::<ble_gap_adv_properties_t>())).type_ as *const _ as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(ble_gap_adv_properties_t),
            "::",
            stringify!(type_)
        )
    );
}
impl ble_gap_adv_properties_t {
    #[inline]
    pub fn anonymous(&self) -> u8 {
        unsafe { ::core::mem::transmute(self._bitfield_1.get(0usize, 1u8) as u8) }
    }
    #[inline]
    pub fn set_anonymous(&mut self, val: u8) {
        unsafe {
            let val: u8 = ::core::mem::transmute(val);
            self._bitfield_1.set(0usize, 1u8, val as u64)
        }
    }
    #[inline]
    pub fn include_tx_power(&self) -> u8 {
        unsafe { ::core::mem::transmute(self._bitfield_1.get(1usize, 1u8) as u8) }
    }
    #[inline]
    pub fn set_include_tx_power(&mut self, val: u8) {
        unsafe {
            let val: u8 = ::core::mem::transmute(val);
            self._bitfield_1.set(1usize, 1u8, val as u64)
        }
    }
    #[inline]
    pub fn new_bitfield_1(anonymous: u8, include_tx_power: u8) -> __BindgenBitfieldUnit<[u8; 1usize], u8> {
        let mut __bindgen_bitfield_unit: __BindgenBitfieldUnit<[u8; 1usize], u8> = Default::default();
        __bindgen_bitfield_unit.set(0usize, 1u8, {
            let anonymous: u8 = unsafe { ::core::mem::transmute(anonymous) };
            anonymous as u64
        });
        __bindgen_bitfield_unit.set(1usize, 1u8, {
            let include_tx_power: u8 = unsafe { ::core::mem::transmute(include_tx_power) };
            include_tx_power as u64
        });
        __bindgen_bitfield_unit
    }
}
#[doc = "@brief Advertising report type."]
#[repr(C)]
#[repr(align(2))]
#[derive(Debug, Copy, Clone)]
pub struct ble_gap_adv_report_type_t {
    pub _bitfield_1: __BindgenBitfieldUnit<[u8; 2usize], u16>,
}
#[test]
fn bindgen_test_layout_ble_gap_adv_report_type_t() {
    assert_eq!(
        ::core::mem::size_of::<ble_gap_adv_report_type_t>(),
        2usize,
        concat!("Size of: ", stringify!(ble_gap_adv_report_type_t))
    );
    assert_eq!(
        ::core::mem::align_of::<ble_gap_adv_report_type_t>(),
        2usize,
        concat!("Alignment of ", stringify!(ble_gap_adv_report_type_t))
    );
}
impl ble_gap_adv_report_type_t {
    #[inline]
    pub fn connectable(&self) -> u16 {
        unsafe { ::core::mem::transmute(self._bitfield_1.get(0usize, 1u8) as u16) }
    }
    #[inline]
    pub fn set_connectable(&mut self, val: u16) {
        unsafe {
            let val: u16 = ::core::mem::transmute(val);
            self._bitfield_1.set(0usize, 1u8, val as u64)
        }
    }
    #[inline]
    pub fn scannable(&self) -> u16 {
        unsafe { ::core::mem::transmute(self._bitfield_1.get(1usize, 1u8) as u16) }
    }
    #[inline]
    pub fn set_scannable(&mut self, val: u16) {
        unsafe {
            let val: u16 = ::core::mem::transmute(val);
            self._bitfield_1.set(1usize, 1u8, val as u64)
        }
    }
    #[inline]
    pub fn directed(&self) -> u16 {
        unsafe { ::core::mem::transmute(self._bitfield_1.get(2usize, 1u8) as u16) }
    }
    #[inline]
    pub fn set_directed(&mut self, val: u16) {
        unsafe {
            let val: u16 = ::core::mem::transmute(val);
            self._bitfield_1.set(2usize, 1u8, val as u64)
        }
    }
    #[inline]
    pub fn scan_response(&self) -> u16 {
        unsafe { ::core::mem::transmute(self._bitfield_1.get(3usize, 1u8) as u16) }
    }
    #[inline]
    pub fn set_scan_response(&mut self, val: u16) {
        unsafe {
            let val: u16 = ::core::mem::transmute(val);
            self._bitfield_1.set(3usize, 1u8, val as u64)
        }
    }
    #[inline]
    pub fn extended_pdu(&self) -> u16 {
        unsafe { ::core::mem::transmute(self._bitfield_1.get(4usize, 1u8) as u16) }
    }
    #[inline]
    pub fn set_extended_pdu(&mut self, val: u16) {
        unsafe {
            let val: u16 = ::core::mem::transmute(val);
            self._bitfield_1.set(4usize, 1u8, val as u64)
        }
    }
    #[inline]
    pub fn status(&self) -> u16 {
        unsafe { ::core::mem::transmute(self._bitfield_1.get(5usize, 2u8) as u16) }
    }
    #[inline]
    pub fn set_status(&mut self, val: u16) {
        unsafe {
            let val: u16 = ::core::mem::transmute(val);
            self._bitfield_1.set(5usize, 2u8, val as u64)
        }
    }
    #[inline]
    pub fn reserved(&self) -> u16 {
        unsafe { ::core::mem::transmute(self._bitfield_1.get(7usize, 9u8) as u16) }
    }
    #[inline]
    pub fn set_reserved(&mut self, val: u16) {
        unsafe {
            let val: u16 = ::core::mem::transmute(val);
            self._bitfield_1.set(7usize, 9u8, val as u64)
        }
    }
    #[inline]
    pub fn new_bitfield_1(
        connectable: u16,
        scannable: u16,
        directed: u16,
        scan_response: u16,
        extended_pdu: u16,
        status: u16,
        reserved: u16,
    ) -> __BindgenBitfieldUnit<[u8; 2usize], u16> {
        let mut __bindgen_bitfield_unit: __BindgenBitfieldUnit<[u8; 2usize], u16> = Default::default();
        __bindgen_bitfield_unit.set(0usize, 1u8, {
            let connectable: u16 = unsafe { ::core::mem::transmute(connectable) };
            connectable as u64
        });
        __bindgen_bitfield_unit.set(1usize, 1u8, {
            let scannable: u16 = unsafe { ::core::mem::transmute(scannable) };
            scannable as u64
        });
        __bindgen_bitfield_unit.set(2usize, 1u8, {
            let directed: u16 = unsafe { ::core::mem::transmute(directed) };
            directed as u64
        });
        __bindgen_bitfield_unit.set(3usize, 1u8, {
            let scan_response: u16 = unsafe { ::core::mem::transmute(scan_response) };
            scan_response as u64
        });
        __bindgen_bitfield_unit.set(4usize, 1u8, {
            let extended_pdu: u16 = unsafe { ::core::mem::transmute(extended_pdu) };
            extended_pdu as u64
        });
        __bindgen_bitfield_unit.set(5usize, 2u8, {
            let status: u16 = unsafe { ::core::mem::transmute(status) };
            status as u64
        });
        __bindgen_bitfield_unit.set(7usize, 9u8, {
            let reserved: u16 = unsafe { ::core::mem::transmute(reserved) };
            reserved as u64
        });
        __bindgen_bitfield_unit
    }
}
#[doc = "@brief Advertising Auxiliary Pointer."]
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct ble_gap_aux_pointer_t {
    #[doc = "< Time offset from the beginning of advertising packet to the auxiliary packet in 100 us units."]
    pub aux_offset: u16,
    #[doc = "< Indicates the PHY on which the auxiliary advertising packet is sent. See @ref BLE_GAP_PHYS."]
    pub aux_phy: u8,
}
#[test]
fn bindgen_test_layout_ble_gap_aux_pointer_t() {
    assert_eq!(
        ::core::mem::size_of::<ble_gap_aux_pointer_t>(),
        4usize,
        concat!("Size of: ", stringify!(ble_gap_aux_pointer_t))
    );
    assert_eq!(
        ::core::mem::align_of::<ble_gap_aux_pointer_t>(),
        2usize,
        concat!("Alignment of ", stringify!(ble_gap_aux_pointer_t))
    );
    assert_eq!(
        unsafe { &(*(::core::ptr::null::<ble_gap_aux_pointer_t>())).aux_offset as *const _ as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(ble_gap_aux_pointer_t),
            "::",
            stringify!(aux_offset)
        )
    );
    assert_eq!(
        unsafe { &(*(::core::ptr::null::<ble_gap_aux_pointer_t>())).aux_phy as *const _ as usize },
        2usize,
        concat!(
            "Offset of field: ",
            stringify!(ble_gap_aux_pointer_t),
            "::",
            stringify!(aux_phy)
        )
    );
}
#[doc = "@brief Bluetooth Low Energy address."]
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct ble_gap_addr_t {
    pub _bitfield_1: __BindgenBitfieldUnit<[u8; 1usize], u8>,
    #[doc = "< 48-bit address, LSB format."]
    #[doc = "@ref addr is not used if @ref addr_type is @ref BLE_GAP_ADDR_TYPE_ANONYMOUS."]
    pub addr: [u8; 6usize],
}
#[test]
fn bindgen_test_layout_ble_gap_addr_t() {
    assert_eq!(
        ::core::mem::size_of::<ble_gap_addr_t>(),
        7usize,
        concat!("Size of: ", stringify!(ble_gap_addr_t))
    );
    assert_eq!(
        ::core::mem::align_of::<ble_gap_addr_t>(),
        1usize,
        concat!("Alignment of ", stringify!(ble_gap_addr_t))
    );
    assert_eq!(
        unsafe { &(*(::core::ptr::null::<ble_gap_addr_t>())).addr as *const _ as usize },
        1usize,
        concat!("Offset of field: ", stringify!(ble_gap_addr_t), "::", stringify!(addr))
    );
}
impl ble_gap_addr_t {
    #[inline]
    pub fn addr_id_peer(&self) -> u8 {
        unsafe { ::core::mem::transmute(self._bitfield_1.get(0usize, 1u8) as u8) }
    }
    #[inline]
    pub fn set_addr_id_peer(&mut self, val: u8) {
        unsafe {
            let val: u8 = ::core::mem::transmute(val);
            self._bitfield_1.set(0usize, 1u8, val as u64)
        }
    }
    #[inline]
    pub fn addr_type(&self) -> u8 {
        unsafe { ::core::mem::transmute(self._bitfield_1.get(1usize, 7u8) as u8) }
    }
    #[inline]
    pub fn set_addr_type(&mut self, val: u8) {
        unsafe {
            let val: u8 = ::core::mem::transmute(val);
            self._bitfield_1.set(1usize, 7u8, val as u64)
        }
    }
    #[inline]
    pub fn new_bitfield_1(addr_id_peer: u8, addr_type: u8) -> __BindgenBitfieldUnit<[u8; 1usize], u8> {
        let mut __bindgen_bitfield_unit: __BindgenBitfieldUnit<[u8; 1usize], u8> = Default::default();
        __bindgen_bitfield_unit.set(0usize, 1u8, {
            let addr_id_peer: u8 = unsafe { ::core::mem::transmute(addr_id_peer) };
            addr_id_peer as u64
        });
        __bindgen_bitfield_unit.set(1usize, 7u8, {
            let addr_type: u8 = unsafe { ::core::mem::transmute(addr_type) };
            addr_type as u64
        });
        __bindgen_bitfield_unit
    }
}
#[doc = "@brief GAP connection parameters."]
#[doc = ""]
#[doc = " @note  When ble_conn_params_t is received in an event, both min_conn_interval and"]
#[doc = "        max_conn_interval will be equal to the connection interval set by the central."]
#[doc = ""]
#[doc = " @note  If both conn_sup_timeout and max_conn_interval are specified, then the following constraint applies:"]
#[doc = "        conn_sup_timeout * 4 > (1 + slave_latency) * max_conn_interval"]
#[doc = "        that corresponds to the following Bluetooth Spec requirement:"]
#[doc = "        The Supervision_Timeout in milliseconds shall be larger than"]
#[doc = "        (1 + Conn_Latency) * Conn_Interval_Max * 2, where Conn_Interval_Max is given in milliseconds."]
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct ble_gap_conn_params_t {
    #[doc = "< Minimum Connection Interval in 1.25 ms units, see @ref BLE_GAP_CP_LIMITS."]
    pub min_conn_interval: u16,
    #[doc = "< Maximum Connection Interval in 1.25 ms units, see @ref BLE_GAP_CP_LIMITS."]
    pub max_conn_interval: u16,
    #[doc = "< Slave Latency in number of connection events, see @ref BLE_GAP_CP_LIMITS."]
    pub slave_latency: u16,
    #[doc = "< Connection Supervision Timeout in 10 ms units, see @ref BLE_GAP_CP_LIMITS."]
    pub conn_sup_timeout: u16,
}
#[test]
fn bindgen_test_layout_ble_gap_conn_params_t() {
    assert_eq!(
        ::core::mem::size_of::<ble_gap_conn_params_t>(),
        8usize,
        concat!("Size of: ", stringify!(ble_gap_conn_params_t))
    );
    assert_eq!(
        ::core::mem::align_of::<ble_gap_conn_params_t>(),
        2usize,
        concat!("Alignment of ", stringify!(ble_gap_conn_params_t))
    );
    assert_eq!(
        unsafe { &(*(::core::ptr::null::<ble_gap_conn_params_t>())).min_conn_interval as *const _ as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(ble_gap_conn_params_t),
            "::",
            stringify!(min_conn_interval)
        )
    );
    assert_eq!(
        unsafe { &(*(::core::ptr::null::<ble_gap_conn_params_t>())).max_conn_interval as *const _ as usize },
        2usize,
        concat!(
            "Offset of field: ",
            stringify!(ble_gap_conn_params_t),
            "::",
            stringify!(max_conn_interval)
        )
    );
    assert_eq!(
        unsafe { &(*(::core::ptr::null::<ble_gap_conn_params_t>())).slave_latency as *const _ as usize },
        4usize,
        concat!(
            "Offset of field: ",
            stringify!(ble_gap_conn_params_t),
            "::",
            stringify!(slave_latency)
        )
    );
    assert_eq!(
        unsafe { &(*(::core::ptr::null::<ble_gap_conn_params_t>())).conn_sup_timeout as *const _ as usize },
        6usize,
        concat!(
            "Offset of field: ",
            stringify!(ble_gap_conn_params_t),
            "::",
            stringify!(conn_sup_timeout)
        )
    );
}
#[doc = "@brief GAP connection security modes."]
#[doc = ""]
#[doc = " Security Mode 0 Level 0: No access permissions at all (this level is not defined by the Bluetooth Core specification).\\n"]
#[doc = " Security Mode 1 Level 1: No security is needed (aka open link).\\n"]
#[doc = " Security Mode 1 Level 2: Encrypted link required, MITM protection not necessary.\\n"]
#[doc = " Security Mode 1 Level 3: MITM protected encrypted link required.\\n"]
#[doc = " Security Mode 1 Level 4: LESC MITM protected encrypted link using a 128-bit strength encryption key required.\\n"]
#[doc = " Security Mode 2 Level 1: Signing or encryption required, MITM protection not necessary.\\n"]
#[doc = " Security Mode 2 Level 2: MITM protected signing required, unless link is MITM protected encrypted.\\n"]
#[repr(C, packed)]
#[derive(Debug, Copy, Clone)]
pub struct ble_gap_conn_sec_mode_t {
    pub _bitfield_1: __BindgenBitfieldUnit<[u8; 1usize], u8>,
}
#[test]
fn bindgen_test_layout_ble_gap_conn_sec_mode_t() {
    assert_eq!(
        ::core::mem::size_of::<ble_gap_conn_sec_mode_t>(),
        1usize,
        concat!("Size of: ", stringify!(ble_gap_conn_sec_mode_t))
    );
    assert_eq!(
        ::core::mem::align_of::<ble_gap_conn_sec_mode_t>(),
        1usize,
        concat!("Alignment of ", stringify!(ble_gap_conn_sec_mode_t))
    );
}
impl ble_gap_conn_sec_mode_t {
    #[inline]
    pub fn sm(&self) -> u8 {
        unsafe { ::core::mem::transmute(self._bitfield_1.get(0usize, 4u8) as u8) }
    }
    #[inline]
    pub fn set_sm(&mut self, val: u8) {
        unsafe {
            let val: u8 = ::core::mem::transmute(val);
            self._bitfield_1.set(0usize, 4u8, val as u64)
        }
    }
    #[inline]
    pub fn lv(&self) -> u8 {
        unsafe { ::core::mem::transmute(self._bitfield_1.get(4usize, 4u8) as u8) }
    }
    #[inline]
    pub fn set_lv(&mut self, val: u8) {
        unsafe {
            let val: u8 = ::core::mem::transmute(val);
            self._bitfield_1.set(4usize, 4u8, val as u64)
        }
    }
    #[inline]
    pub fn new_bitfield_1(sm: u8, lv: u8) -> __BindgenBitfieldUnit<[u8; 1usize], u8> {
        let mut __bindgen_bitfield_unit: __BindgenBitfieldUnit<[u8; 1usize], u8> = Default::default();
        __bindgen_bitfield_unit.set(0usize, 4u8, {
            let sm: u8 = unsafe { ::core::mem::transmute(sm) };
            sm as u64
        });
        __bindgen_bitfield_unit.set(4usize, 4u8, {
            let lv: u8 = unsafe { ::core::mem::transmute(lv) };
            lv as u64
        });
        __bindgen_bitfield_unit
    }
}
#[doc = "@brief GAP connection security status."]
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct ble_gap_conn_sec_t {
    #[doc = "< Currently active security mode for this connection."]
    pub sec_mode: ble_gap_conn_sec_mode_t,
    #[doc = "< Length of currently active encryption key, 7 to 16 octets (only applicable for bonding procedures)."]
    pub encr_key_size: u8,
}
#[test]
fn bindgen_test_layout_ble_gap_conn_sec_t() {
    assert_eq!(
        ::core::mem::size_of::<ble_gap_conn_sec_t>(),
        2usize,
        concat!("Size of: ", stringify!(ble_gap_conn_sec_t))
    );
    assert_eq!(
        ::core::mem::align_of::<ble_gap_conn_sec_t>(),
        1usize,
        concat!("Alignment of ", stringify!(ble_gap_conn_sec_t))
    );
    assert_eq!(
        unsafe { &(*(::core::ptr::null::<ble_gap_conn_sec_t>())).sec_mode as *const _ as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(ble_gap_conn_sec_t),
            "::",
            stringify!(sec_mode)
        )
    );
    assert_eq!(
        unsafe { &(*(::core::ptr::null::<ble_gap_conn_sec_t>())).encr_key_size as *const _ as usize },
        1usize,
        concat!(
            "Offset of field: ",
            stringify!(ble_gap_conn_sec_t),
            "::",
            stringify!(encr_key_size)
        )
    );
}
#[doc = "@brief Identity Resolving Key."]
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct ble_gap_irk_t {
    #[doc = "< Array containing IRK."]
    pub irk: [u8; 16usize],
}
#[test]
fn bindgen_test_layout_ble_gap_irk_t() {
    assert_eq!(
        ::core::mem::size_of::<ble_gap_irk_t>(),
        16usize,
        concat!("Size of: ", stringify!(ble_gap_irk_t))
    );
    assert_eq!(
        ::core::mem::align_of::<ble_gap_irk_t>(),
        1usize,
        concat!("Alignment of ", stringify!(ble_gap_irk_t))
    );
    assert_eq!(
        unsafe { &(*(::core::ptr::null::<ble_gap_irk_t>())).irk as *const _ as usize },
        0usize,
        concat!("Offset of field: ", stringify!(ble_gap_irk_t), "::", stringify!(irk))
    );
}
#[doc = "@brief Channel mask (40 bits)."]
#[doc = " Every channel is represented with a bit positioned as per channel index defined in Bluetooth Core Specification v5.0,"]
#[doc = " Vol 6, Part B, Section 1.4.1. The LSB contained in array element 0 represents channel index 0, and bit 39 represents"]
#[doc = " channel index 39. If a bit is set to 1, the channel is not used."]
pub type ble_gap_ch_mask_t = [u8; 5usize];
#[doc = "@brief GAP advertising parameters."]
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct ble_gap_adv_params_t {
    #[doc = "< The properties of the advertising events."]
    pub properties: ble_gap_adv_properties_t,
    #[doc = "< Address of a known peer."]
    #[doc = "@note ble_gap_addr_t::addr_type cannot be"]
    #[doc = "@ref BLE_GAP_ADDR_TYPE_ANONYMOUS."]
    #[doc = "- When privacy is enabled and the local device uses"]
    #[doc = "@ref BLE_GAP_ADDR_TYPE_RANDOM_PRIVATE_RESOLVABLE addresses,"]
    #[doc = "the device identity list is searched for a matching entry. If"]
    #[doc = "the local IRK for that device identity is set, the local IRK"]
    #[doc = "for that device will be used to generate the advertiser address"]
    #[doc = "field in the advertising packet."]
    #[doc = "- If @ref ble_gap_adv_properties_t::type is directed, this must be"]
    #[doc = "set to the targeted scanner or initiator. If the peer address is"]
    #[doc = "in the device identity list, the peer IRK for that device will be"]
    #[doc = "used to generate @ref BLE_GAP_ADDR_TYPE_RANDOM_PRIVATE_RESOLVABLE"]
    #[doc = "target addresses used in the advertising event PDUs."]
    pub p_peer_addr: *const ble_gap_addr_t,
    #[doc = "< Advertising interval in 625 us units. @sa BLE_GAP_ADV_INTERVALS."]
    #[doc = "@note If @ref ble_gap_adv_properties_t::type is set to"]
    #[doc = "@ref BLE_GAP_ADV_TYPE_CONNECTABLE_NONSCANNABLE_DIRECTED_HIGH_DUTY_CYCLE"]
    #[doc = "advertising, this parameter is ignored."]
    pub interval: u32,
    #[doc = "< Advertising duration in 10 ms units. When timeout is reached,"]
    #[doc = "an event of type @ref BLE_GAP_EVT_ADV_SET_TERMINATED is raised."]
    #[doc = "@sa BLE_GAP_ADV_TIMEOUT_VALUES."]
    #[doc = "@note The SoftDevice will always complete at least one advertising"]
    #[doc = "event even if the duration is set too low."]
    pub duration: u16,
    #[doc = "< Maximum advertising events that shall be sent prior to disabling"]
    #[doc = "advertising. Setting the value to 0 disables the limitation. When"]
    #[doc = "the count of advertising events specified by this parameter"]
    #[doc = "(if not 0) is reached, advertising will be automatically stopped"]
    #[doc = "and an event of type @ref BLE_GAP_EVT_ADV_SET_TERMINATED is raised"]
    #[doc = "@note If @ref ble_gap_adv_properties_t::type is set to"]
    #[doc = "@ref BLE_GAP_ADV_TYPE_CONNECTABLE_NONSCANNABLE_DIRECTED_HIGH_DUTY_CYCLE,"]
    #[doc = "this parameter is ignored."]
    pub max_adv_evts: u8,
    #[doc = "< Channel mask for primary and secondary advertising channels."]
    #[doc = "At least one of the primary channels, that is channel index 37-39, must be used."]
    #[doc = "Masking away secondary advertising channels is not supported."]
    pub channel_mask: ble_gap_ch_mask_t,
    #[doc = "< Filter Policy. @sa BLE_GAP_ADV_FILTER_POLICIES."]
    pub filter_policy: u8,
    #[doc = "< Indicates the PHY on which the primary advertising channel packets"]
    #[doc = "are transmitted. If set to @ref BLE_GAP_PHY_AUTO, @ref BLE_GAP_PHY_1MBPS"]
    #[doc = "will be used."]
    #[doc = "Valid values are @ref BLE_GAP_PHY_1MBPS and @ref BLE_GAP_PHY_CODED."]
    #[doc = "@note The primary_phy shall indicate @ref BLE_GAP_PHY_1MBPS if"]
    #[doc = "@ref ble_gap_adv_properties_t::type is not an extended advertising type."]
    pub primary_phy: u8,
    #[doc = "< Indicates the PHY on which the secondary advertising channel packets"]
    #[doc = "are transmitted."]
    #[doc = "If set to @ref BLE_GAP_PHY_AUTO, @ref BLE_GAP_PHY_1MBPS will be used."]
    #[doc = "Valid values are"]
    #[doc = "@ref BLE_GAP_PHY_1MBPS, @ref BLE_GAP_PHY_2MBPS, and @ref BLE_GAP_PHY_CODED."]
    #[doc = "If @ref ble_gap_adv_properties_t::type is an extended advertising type"]
    #[doc = "and connectable, this is the PHY that will be used to establish a"]
    #[doc = "connection and send AUX_ADV_IND packets on."]
    #[doc = "@note This parameter will be ignored when"]
    #[doc = "@ref ble_gap_adv_properties_t::type is not an extended advertising type."]
    pub secondary_phy: u8,
    pub _bitfield_1: __BindgenBitfieldUnit<[u8; 1usize], u8>,
}
#[test]
fn bindgen_test_layout_ble_gap_adv_params_t() {
    assert_eq!(
        ::core::mem::size_of::<ble_gap_adv_params_t>(),
        24usize,
        concat!("Size of: ", stringify!(ble_gap_adv_params_t))
    );
    assert_eq!(
        ::core::mem::align_of::<ble_gap_adv_params_t>(),
        4usize,
        concat!("Alignment of ", stringify!(ble_gap_adv_params_t))
    );
    assert_eq!(
        unsafe { &(*(::core::ptr::null::<ble_gap_adv_params_t>())).properties as *const _ as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(ble_gap_adv_params_t),
            "::",
            stringify!(properties)
        )
    );
    assert_eq!(
        unsafe { &(*(::core::ptr::null::<ble_gap_adv_params_t>())).p_peer_addr as *const _ as usize },
        4usize,
        concat!(
            "Offset of field: ",
            stringify!(ble_gap_adv_params_t),
            "::",
            stringify!(p_peer_addr)
        )
    );
    assert_eq!(
        unsafe { &(*(::core::ptr::null::<ble_gap_adv_params_t>())).interval as *const _ as usize },
        8usize,
        concat!(
            "Offset of field: ",
            stringify!(ble_gap_adv_params_t),
            "::",
            stringify!(interval)
        )
    );
    assert_eq!(
        unsafe { &(*(::core::ptr::null::<ble_gap_adv_params_t>())).duration as *const _ as usize },
        12usize,
        concat!(
            "Offset of field: ",
            stringify!(ble_gap_adv_params_t),
            "::",
            stringify!(duration)
        )
    );
    assert_eq!(
        unsafe { &(*(::core::ptr::null::<ble_gap_adv_params_t>())).max_adv_evts as *const _ as usize },
        14usize,
        concat!(
            "Offset of field: ",
            stringify!(ble_gap_adv_params_t),
            "::",
            stringify!(max_adv_evts)
        )
    );
    assert_eq!(
        unsafe { &(*(::core::ptr::null::<ble_gap_adv_params_t>())).channel_mask as *const _ as usize },
        15usize,
        concat!(
            "Offset of field: ",
            stringify!(ble_gap_adv_params_t),
            "::",
            stringify!(channel_mask)
        )
    );
    assert_eq!(
        unsafe { &(*(::core::ptr::null::<ble_gap_adv_params_t>())).filter_policy as *const _ as usize },
        20usize,
        concat!(
            "Offset of field: ",
            stringify!(ble_gap_adv_params_t),
            "::",
            stringify!(filter_policy)
        )
    );
    assert_eq!(
        unsafe { &(*(::core::ptr::null::<ble_gap_adv_params_t>())).primary_phy as *const _ as usize },
        21usize,
        concat!(
            "Offset of field: ",
            stringify!(ble_gap_adv_params_t),
            "::",
            stringify!(primary_phy)
        )
    );
    assert_eq!(
        unsafe { &(*(::core::ptr::null::<ble_gap_adv_params_t>())).secondary_phy as *const _ as usize },
        22usize,
        concat!(
            "Offset of field: ",
            stringify!(ble_gap_adv_params_t),
            "::",
            stringify!(secondary_phy)
        )
    );
}
impl ble_gap_adv_params_t {
    #[inline]
    pub fn set_id(&self) -> u8 {
        unsafe { ::core::mem::transmute(self._bitfield_1.get(0usize, 4u8) as u8) }
    }
    #[inline]
    pub fn set_set_id(&mut self, val: u8) {
        unsafe {
            let val: u8 = ::core::mem::transmute(val);
            self._bitfield_1.set(0usize, 4u8, val as u64)
        }
    }
    #[inline]
    pub fn scan_req_notification(&self) -> u8 {
        unsafe { ::core::mem::transmute(self._bitfield_1.get(4usize, 1u8) as u8) }
    }
    #[inline]
    pub fn set_scan_req_notification(&mut self, val: u8) {
        unsafe {
            let val: u8 = ::core::mem::transmute(val);
            self._bitfield_1.set(4usize, 1u8, val as u64)
        }
    }
    #[inline]
    pub fn new_bitfield_1(set_id: u8, scan_req_notification: u8) -> __BindgenBitfieldUnit<[u8; 1usize], u8> {
        let mut __bindgen_bitfield_unit: __BindgenBitfieldUnit<[u8; 1usize], u8> = Default::default();
        __bindgen_bitfield_unit.set(0usize, 4u8, {
            let set_id: u8 = unsafe { ::core::mem::transmute(set_id) };
            set_id as u64
        });
        __bindgen_bitfield_unit.set(4usize, 1u8, {
            let scan_req_notification: u8 = unsafe { ::core::mem::transmute(scan_req_notification) };
            scan_req_notification as u64
        });
        __bindgen_bitfield_unit
    }
}
#[doc = "@brief GAP advertising data buffers."]
#[doc = ""]
#[doc = " The application must provide the buffers for advertisement. The memory shall reside in application RAM, and"]
#[doc = " shall never be modified while advertising. The data shall be kept alive until either:"]
#[doc = "  - @ref BLE_GAP_EVT_ADV_SET_TERMINATED is raised."]
#[doc = "  - @ref BLE_GAP_EVT_CONNECTED is raised with @ref ble_gap_evt_connected_t::adv_handle set to the corresponding"]
#[doc = "    advertising handle."]
#[doc = "  - Advertising is stopped."]
#[doc = "  - Advertising data is changed."]
#[doc = " To update advertising data while advertising, provide new buffers to @ref sd_ble_gap_adv_set_configure."]
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct ble_gap_adv_data_t {
    #[doc = "< Advertising data."]
    #[doc = "@note"]
    #[doc = "Advertising data can only be specified for a @ref ble_gap_adv_properties_t::type"]
    #[doc = "that is allowed to contain advertising data."]
    pub adv_data: ble_data_t,
    #[doc = "< Scan response data."]
    #[doc = "@note"]
    #[doc = "Scan response data can only be specified for a @ref ble_gap_adv_properties_t::type"]
    #[doc = "that is scannable."]
    pub scan_rsp_data: ble_data_t,
}
#[test]
fn bindgen_test_layout_ble_gap_adv_data_t() {
    assert_eq!(
        ::core::mem::size_of::<ble_gap_adv_data_t>(),
        16usize,
        concat!("Size of: ", stringify!(ble_gap_adv_data_t))
    );
    assert_eq!(
        ::core::mem::align_of::<ble_gap_adv_data_t>(),
        4usize,
        concat!("Alignment of ", stringify!(ble_gap_adv_data_t))
    );
    assert_eq!(
        unsafe { &(*(::core::ptr::null::<ble_gap_adv_data_t>())).adv_data as *const _ as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(ble_gap_adv_data_t),
            "::",
            stringify!(adv_data)
        )
    );
    assert_eq!(
        unsafe { &(*(::core::ptr::null::<ble_gap_adv_data_t>())).scan_rsp_data as *const _ as usize },
        8usize,
        concat!(
            "Offset of field: ",
            stringify!(ble_gap_adv_data_t),
            "::",
            stringify!(scan_rsp_data)
        )
    );
}
#[doc = "@brief GAP scanning parameters."]
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct ble_gap_scan_params_t {
    pub _bitfield_1: __BindgenBitfieldUnit<[u8; 1usize], u8>,
    #[doc = "< Bitfield of PHYs to scan on. If set to @ref BLE_GAP_PHY_AUTO,"]
    #[doc = "scan_phys will default to @ref BLE_GAP_PHY_1MBPS."]
    #[doc = "- If @ref ble_gap_scan_params_t::extended is set to 0, the only"]
    #[doc = "supported PHY is @ref BLE_GAP_PHY_1MBPS."]
    #[doc = "- When used with @ref sd_ble_gap_scan_start,"]
    #[doc = "the bitfield indicates the PHYs the scanner will use for scanning"]
    #[doc = "on primary advertising channels. The scanner will accept"]
    #[doc = "@ref BLE_GAP_PHYS_SUPPORTED as secondary advertising channel PHYs."]
    #[doc = "- When used with @ref sd_ble_gap_connect, the bitfield indicates"]
    #[doc = "the PHYs the initiator will use for scanning on primary advertising"]
    #[doc = "channels. The initiator will accept connections initiated on either"]
    #[doc = "of the @ref BLE_GAP_PHYS_SUPPORTED PHYs."]
    #[doc = "If scan_phys contains @ref BLE_GAP_PHY_1MBPS and/or @ref BLE_GAP_PHY_2MBPS,"]
    #[doc = "the primary scan PHY is @ref BLE_GAP_PHY_1MBPS."]
    #[doc = "If scan_phys also contains @ref BLE_GAP_PHY_CODED, the primary scan"]
    #[doc = "PHY will also contain @ref BLE_GAP_PHY_CODED. If the only scan PHY is"]
    #[doc = "@ref BLE_GAP_PHY_CODED, the primary scan PHY is"]
    #[doc = "@ref BLE_GAP_PHY_CODED only."]
    pub scan_phys: u8,
    #[doc = "< Scan interval in 625 us units. @sa BLE_GAP_SCAN_INTERVALS."]
    pub interval: u16,
    #[doc = "< Scan window in 625 us units. @sa BLE_GAP_SCAN_WINDOW."]
    #[doc = "If scan_phys contains both @ref BLE_GAP_PHY_1MBPS and"]
    #[doc = "@ref BLE_GAP_PHY_CODED interval shall be larger than or"]
    #[doc = "equal to twice the scan window."]
    pub window: u16,
    #[doc = "< Scan timeout in 10 ms units. @sa BLE_GAP_SCAN_TIMEOUT."]
    pub timeout: u16,
    #[doc = "< Channel mask for primary and secondary advertising channels."]
    #[doc = "At least one of the primary channels, that is channel index 37-39, must be"]
    #[doc = "set to 0."]
    #[doc = "Masking away secondary channels is not supported."]
    pub channel_mask: ble_gap_ch_mask_t,
}
#[test]
fn bindgen_test_layout_ble_gap_scan_params_t() {
    assert_eq!(
        ::core::mem::size_of::<ble_gap_scan_params_t>(),
        14usize,
        concat!("Size of: ", stringify!(ble_gap_scan_params_t))
    );
    assert_eq!(
        ::core::mem::align_of::<ble_gap_scan_params_t>(),
        2usize,
        concat!("Alignment of ", stringify!(ble_gap_scan_params_t))
    );
    assert_eq!(
        unsafe { &(*(::core::ptr::null::<ble_gap_scan_params_t>())).scan_phys as *const _ as usize },
        1usize,
        concat!(
            "Offset of field: ",
            stringify!(ble_gap_scan_params_t),
            "::",
            stringify!(scan_phys)
        )
    );
    assert_eq!(
        unsafe { &(*(::core::ptr::null::<ble_gap_scan_params_t>())).interval as *const _ as usize },
        2usize,
        concat!(
            "Offset of field: ",
            stringify!(ble_gap_scan_params_t),
            "::",
            stringify!(interval)
        )
    );
    assert_eq!(
        unsafe { &(*(::core::ptr::null::<ble_gap_scan_params_t>())).window as *const _ as usize },
        4usize,
        concat!(
            "Offset of field: ",
            stringify!(ble_gap_scan_params_t),
            "::",
            stringify!(window)
        )
    );
    assert_eq!(
        unsafe { &(*(::core::ptr::null::<ble_gap_scan_params_t>())).timeout as *const _ as usize },
        6usize,
        concat!(
            "Offset of field: ",
            stringify!(ble_gap_scan_params_t),
            "::",
            stringify!(timeout)
        )
    );
    assert_eq!(
        unsafe { &(*(::core::ptr::null::<ble_gap_scan_params_t>())).channel_mask as *const _ as usize },
        8usize,
        concat!(
            "Offset of field: ",
            stringify!(ble_gap_scan_params_t),
            "::",
            stringify!(channel_mask)
        )
    );
}
impl ble_gap_scan_params_t {
    #[inline]
    pub fn extended(&self) -> u8 {
        unsafe { ::core::mem::transmute(self._bitfield_1.get(0usize, 1u8) as u8) }
    }
    #[inline]
    pub fn set_extended(&mut self, val: u8) {
        unsafe {
            let val: u8 = ::core::mem::transmute(val);
            self._bitfield_1.set(0usize, 1u8, val as u64)
        }
    }
    #[inline]
    pub fn report_incomplete_evts(&self) -> u8 {
        unsafe { ::core::mem::transmute(self._bitfield_1.get(1usize, 1u8) as u8) }
    }
    #[inline]
    pub fn set_report_incomplete_evts(&mut self, val: u8) {
        unsafe {
            let val: u8 = ::core::mem::transmute(val);
            self._bitfield_1.set(1usize, 1u8, val as u64)
        }
    }
    #[inline]
    pub fn active(&self) -> u8 {
        unsafe { ::core::mem::transmute(self._bitfield_1.get(2usize, 1u8) as u8) }
    }
    #[inline]
    pub fn set_active(&mut self, val: u8) {
        unsafe {
            let val: u8 = ::core::mem::transmute(val);
            self._bitfield_1.set(2usize, 1u8, val as u64)
        }
    }
    #[inline]
    pub fn filter_policy(&self) -> u8 {
        unsafe { ::core::mem::transmute(self._bitfield_1.get(3usize, 2u8) as u8) }
    }
    #[inline]
    pub fn set_filter_policy(&mut self, val: u8) {
        unsafe {
            let val: u8 = ::core::mem::transmute(val);
            self._bitfield_1.set(3usize, 2u8, val as u64)
        }
    }
    #[inline]
    pub fn new_bitfield_1(
        extended: u8,
        report_incomplete_evts: u8,
        active: u8,
        filter_policy: u8,
    ) -> __BindgenBitfieldUnit<[u8; 1usize], u8> {
        let mut __bindgen_bitfield_unit: __BindgenBitfieldUnit<[u8; 1usize], u8> = Default::default();
        __bindgen_bitfield_unit.set(0usize, 1u8, {
            let extended: u8 = unsafe { ::core::mem::transmute(extended) };
            extended as u64
        });
        __bindgen_bitfield_unit.set(1usize, 1u8, {
            let report_incomplete_evts: u8 = unsafe { ::core::mem::transmute(report_incomplete_evts) };
            report_incomplete_evts as u64
        });
        __bindgen_bitfield_unit.set(2usize, 1u8, {
            let active: u8 = unsafe { ::core::mem::transmute(active) };
            active as u64
        });
        __bindgen_bitfield_unit.set(3usize, 2u8, {
            let filter_policy: u8 = unsafe { ::core::mem::transmute(filter_policy) };
            filter_policy as u64
        });
        __bindgen_bitfield_unit
    }
}
#[doc = "@brief Privacy."]
#[doc = ""]
#[doc = "        The privacy feature provides a way for the device to avoid being tracked over a period of time."]
#[doc = "        The privacy feature, when enabled, hides the local device identity and replaces it with a private address"]
#[doc = "        that is automatically refreshed at a specified interval."]
#[doc = ""]
#[doc = "        If a device still wants to be recognized by other peers, it needs to share it's Identity Resolving Key (IRK)."]
#[doc = "        With this key, a device can generate a random private address that can only be recognized by peers in possession of that key,"]
#[doc = "        and devices can establish connections without revealing their real identities."]
#[doc = ""]
#[doc = "        Both network privacy (@ref BLE_GAP_PRIVACY_MODE_NETWORK_PRIVACY) and device privacy (@ref BLE_GAP_PRIVACY_MODE_DEVICE_PRIVACY)"]
#[doc = "        are supported."]
#[doc = ""]
#[doc = " @note  If the device IRK is updated, the new IRK becomes the one to be distributed in all"]
#[doc = "        bonding procedures performed after @ref sd_ble_gap_privacy_set returns."]
#[doc = "        The IRK distributed during bonding procedure is the device IRK that is active when @ref sd_ble_gap_sec_params_reply is called."]
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct ble_gap_privacy_params_t {
    #[doc = "< Privacy mode, see @ref BLE_GAP_PRIVACY_MODES. Default is @ref BLE_GAP_PRIVACY_MODE_OFF."]
    pub privacy_mode: u8,
    #[doc = "< The private address type must be either @ref BLE_GAP_ADDR_TYPE_RANDOM_PRIVATE_RESOLVABLE or @ref BLE_GAP_ADDR_TYPE_RANDOM_PRIVATE_NON_RESOLVABLE."]
    pub private_addr_type: u8,
    #[doc = "< Private address cycle interval in seconds. Providing an address cycle value of 0 will use the default value defined by @ref BLE_GAP_DEFAULT_PRIVATE_ADDR_CYCLE_INTERVAL_S."]
    pub private_addr_cycle_s: u16,
    #[doc = "< When used as input, pointer to IRK structure that will be used as the default IRK. If NULL, the device default IRK will be used."]
    #[doc = "When used as output, pointer to IRK structure where the current default IRK will be written to. If NULL, this argument is ignored."]
    #[doc = "By default, the default IRK is used to generate random private resolvable addresses for the local device unless instructed otherwise."]
    pub p_device_irk: *mut ble_gap_irk_t,
}
#[test]
fn bindgen_test_layout_ble_gap_privacy_params_t() {
    assert_eq!(
        ::core::mem::size_of::<ble_gap_privacy_params_t>(),
        8usize,
        concat!("Size of: ", stringify!(ble_gap_privacy_params_t))
    );
    assert_eq!(
        ::core::mem::align_of::<ble_gap_privacy_params_t>(),
        4usize,
        concat!("Alignment of ", stringify!(ble_gap_privacy_params_t))
    );
    assert_eq!(
        unsafe { &(*(::core::ptr::null::<ble_gap_privacy_params_t>())).privacy_mode as *const _ as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(ble_gap_privacy_params_t),
            "::",
            stringify!(privacy_mode)
        )
    );
    assert_eq!(
        unsafe { &(*(::core::ptr::null::<ble_gap_privacy_params_t>())).private_addr_type as *const _ as usize },
        1usize,
        concat!(
            "Offset of field: ",
            stringify!(ble_gap_privacy_params_t),
            "::",
            stringify!(private_addr_type)
        )
    );
    assert_eq!(
        unsafe { &(*(::core::ptr::null::<ble_gap_privacy_params_t>())).private_addr_cycle_s as *const _ as usize },
        2usize,
        concat!(
            "Offset of field: ",
            stringify!(ble_gap_privacy_params_t),
            "::",
            stringify!(private_addr_cycle_s)
        )
    );
    assert_eq!(
        unsafe { &(*(::core::ptr::null::<ble_gap_privacy_params_t>())).p_device_irk as *const _ as usize },
        4usize,
        concat!(
            "Offset of field: ",
            stringify!(ble_gap_privacy_params_t),
            "::",
            stringify!(p_device_irk)
        )
    );
}
#[doc = "@brief PHY preferences for TX and RX"]
#[doc = " @note  tx_phys and rx_phys are bit fields. Multiple bits can be set in them to indicate multiple preferred PHYs for each direction."]
#[doc = " @code"]
#[doc = " p_gap_phys->tx_phys = BLE_GAP_PHY_1MBPS | BLE_GAP_PHY_2MBPS;"]
#[doc = " p_gap_phys->rx_phys = BLE_GAP_PHY_1MBPS | BLE_GAP_PHY_2MBPS;"]
#[doc = " @endcode"]
#[doc = ""]
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct ble_gap_phys_t {
    #[doc = "< Preferred transmit PHYs, see @ref BLE_GAP_PHYS."]
    pub tx_phys: u8,
    #[doc = "< Preferred receive PHYs, see @ref BLE_GAP_PHYS."]
    pub rx_phys: u8,
}
#[test]
fn bindgen_test_layout_ble_gap_phys_t() {
    assert_eq!(
        ::core::mem::size_of::<ble_gap_phys_t>(),
        2usize,
        concat!("Size of: ", stringify!(ble_gap_phys_t))
    );
    assert_eq!(
        ::core::mem::align_of::<ble_gap_phys_t>(),
        1usize,
        concat!("Alignment of ", stringify!(ble_gap_phys_t))
    );
    assert_eq!(
        unsafe { &(*(::core::ptr::null::<ble_gap_phys_t>())).tx_phys as *const _ as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(ble_gap_phys_t),
            "::",
            stringify!(tx_phys)
        )
    );
    assert_eq!(
        unsafe { &(*(::core::ptr::null::<ble_gap_phys_t>())).rx_phys as *const _ as usize },
        1usize,
        concat!(
            "Offset of field: ",
            stringify!(ble_gap_phys_t),
            "::",
            stringify!(rx_phys)
        )
    );
}
#[doc = " @brief Keys that can be exchanged during a bonding procedure."]
#[repr(C, packed)]
#[derive(Debug, Copy, Clone)]
pub struct ble_gap_sec_kdist_t {
    pub _bitfield_1: __BindgenBitfieldUnit<[u8; 1usize], u8>,
}
#[test]
fn bindgen_test_layout_ble_gap_sec_kdist_t() {
    assert_eq!(
        ::core::mem::size_of::<ble_gap_sec_kdist_t>(),
        1usize,
        concat!("Size of: ", stringify!(ble_gap_sec_kdist_t))
    );
    assert_eq!(
        ::core::mem::align_of::<ble_gap_sec_kdist_t>(),
        1usize,
        concat!("Alignment of ", stringify!(ble_gap_sec_kdist_t))
    );
}
impl ble_gap_sec_kdist_t {
    #[inline]
    pub fn enc(&self) -> u8 {
        unsafe { ::core::mem::transmute(self._bitfield_1.get(0usize, 1u8) as u8) }
    }
    #[inline]
    pub fn set_enc(&mut self, val: u8) {
        unsafe {
            let val: u8 = ::core::mem::transmute(val);
            self._bitfield_1.set(0usize, 1u8, val as u64)
        }
    }
    #[inline]
    pub fn id(&self) -> u8 {
        unsafe { ::core::mem::transmute(self._bitfield_1.get(1usize, 1u8) as u8) }
    }
    #[inline]
    pub fn set_id(&mut self, val: u8) {
        unsafe {
            let val: u8 = ::core::mem::transmute(val);
            self._bitfield_1.set(1usize, 1u8, val as u64)
        }
    }
    #[inline]
    pub fn sign(&self) -> u8 {
        unsafe { ::core::mem::transmute(self._bitfield_1.get(2usize, 1u8) as u8) }
    }
    #[inline]
    pub fn set_sign(&mut self, val: u8) {
        unsafe {
            let val: u8 = ::core::mem::transmute(val);
            self._bitfield_1.set(2usize, 1u8, val as u64)
        }
    }
    #[inline]
    pub fn link(&self) -> u8 {
        unsafe { ::core::mem::transmute(self._bitfield_1.get(3usize, 1u8) as u8) }
    }
    #[inline]
    pub fn set_link(&mut self, val: u8) {
        unsafe {
            let val: u8 = ::core::mem::transmute(val);
            self._bitfield_1.set(3usize, 1u8, val as u64)
        }
    }
    #[inline]
    pub fn new_bitfield_1(enc: u8, id: u8, sign: u8, link: u8) -> __BindgenBitfieldUnit<[u8; 1usize], u8> {
        let mut __bindgen_bitfield_unit: __BindgenBitfieldUnit<[u8; 1usize], u8> = Default::default();
        __bindgen_bitfield_unit.set(0usize, 1u8, {
            let enc: u8 = unsafe { ::core::mem::transmute(enc) };
            enc as u64
        });
        __bindgen_bitfield_unit.set(1usize, 1u8, {
            let id: u8 = unsafe { ::core::mem::transmute(id) };
            id as u64
        });
        __bindgen_bitfield_unit.set(2usize, 1u8, {
            let sign: u8 = unsafe { ::core::mem::transmute(sign) };
            sign as u64
        });
        __bindgen_bitfield_unit.set(3usize, 1u8, {
            let link: u8 = unsafe { ::core::mem::transmute(link) };
            link as u64
        });
        __bindgen_bitfield_unit
    }
}
#[doc = "@brief GAP security parameters."]
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct ble_gap_sec_params_t {
    pub _bitfield_1: __BindgenBitfieldUnit<[u8; 1usize], u8>,
    #[doc = "< Minimum encryption key size in octets between 7 and 16. If 0 then not applicable in this instance."]
    pub min_key_size: u8,
    #[doc = "< Maximum encryption key size in octets between min_key_size and 16."]
    pub max_key_size: u8,
    #[doc = "< Key distribution bitmap: keys that the local device will distribute."]
    pub kdist_own: ble_gap_sec_kdist_t,
    #[doc = "< Key distribution bitmap: keys that the remote device will distribute."]
    pub kdist_peer: ble_gap_sec_kdist_t,
}
#[test]
fn bindgen_test_layout_ble_gap_sec_params_t() {
    assert_eq!(
        ::core::mem::size_of::<ble_gap_sec_params_t>(),
        5usize,
        concat!("Size of: ", stringify!(ble_gap_sec_params_t))
    );
    assert_eq!(
        ::core::mem::align_of::<ble_gap_sec_params_t>(),
        1usize,
        concat!("Alignment of ", stringify!(ble_gap_sec_params_t))
    );
    assert_eq!(
        unsafe { &(*(::core::ptr::null::<ble_gap_sec_params_t>())).min_key_size as *const _ as usize },
        1usize,
        concat!(
            "Offset of field: ",
            stringify!(ble_gap_sec_params_t),
            "::",
            stringify!(min_key_size)
        )
    );
    assert_eq!(
        unsafe { &(*(::core::ptr::null::<ble_gap_sec_params_t>())).max_key_size as *const _ as usize },
        2usize,
        concat!(
            "Offset of field: ",
            stringify!(ble_gap_sec_params_t),
            "::",
            stringify!(max_key_size)
        )
    );
    assert_eq!(
        unsafe { &(*(::core::ptr::null::<ble_gap_sec_params_t>())).kdist_own as *const _ as usize },
        3usize,
        concat!(
            "Offset of field: ",
            stringify!(ble_gap_sec_params_t),
            "::",
            stringify!(kdist_own)
        )
    );
    assert_eq!(
        unsafe { &(*(::core::ptr::null::<ble_gap_sec_params_t>())).kdist_peer as *const _ as usize },
        4usize,
        concat!(
            "Offset of field: ",
            stringify!(ble_gap_sec_params_t),
            "::",
            stringify!(kdist_peer)
        )
    );
}
impl ble_gap_sec_params_t {
    #[inline]
    pub fn bond(&self) -> u8 {
        unsafe { ::core::mem::transmute(self._bitfield_1.get(0usize, 1u8) as u8) }
    }
    #[inline]
    pub fn set_bond(&mut self, val: u8) {
        unsafe {
            let val: u8 = ::core::mem::transmute(val);
            self._bitfield_1.set(0usize, 1u8, val as u64)
        }
    }
    #[inline]
    pub fn mitm(&self) -> u8 {
        unsafe { ::core::mem::transmute(self._bitfield_1.get(1usize, 1u8) as u8) }
    }
    #[inline]
    pub fn set_mitm(&mut self, val: u8) {
        unsafe {
            let val: u8 = ::core::mem::transmute(val);
            self._bitfield_1.set(1usize, 1u8, val as u64)
        }
    }
    #[inline]
    pub fn lesc(&self) -> u8 {
        unsafe { ::core::mem::transmute(self._bitfield_1.get(2usize, 1u8) as u8) }
    }
    #[inline]
    pub fn set_lesc(&mut self, val: u8) {
        unsafe {
            let val: u8 = ::core::mem::transmute(val);
            self._bitfield_1.set(2usize, 1u8, val as u64)
        }
    }
    #[inline]
    pub fn keypress(&self) -> u8 {
        unsafe { ::core::mem::transmute(self._bitfield_1.get(3usize, 1u8) as u8) }
    }
    #[inline]
    pub fn set_keypress(&mut self, val: u8) {
        unsafe {
            let val: u8 = ::core::mem::transmute(val);
            self._bitfield_1.set(3usize, 1u8, val as u64)
        }
    }
    #[inline]
    pub fn io_caps(&self) -> u8 {
        unsafe { ::core::mem::transmute(self._bitfield_1.get(4usize, 3u8) as u8) }
    }
    #[inline]
    pub fn set_io_caps(&mut self, val: u8) {
        unsafe {
            let val: u8 = ::core::mem::transmute(val);
            self._bitfield_1.set(4usize, 3u8, val as u64)
        }
    }
    #[inline]
    pub fn oob(&self) -> u8 {
        unsafe { ::core::mem::transmute(self._bitfield_1.get(7usize, 1u8) as u8) }
    }
    #[inline]
    pub fn set_oob(&mut self, val: u8) {
        unsafe {
            let val: u8 = ::core::mem::transmute(val);
            self._bitfield_1.set(7usize, 1u8, val as u64)
        }
    }
    #[inline]
    pub fn new_bitfield_1(
        bond: u8,
        mitm: u8,
        lesc: u8,
        keypress: u8,
        io_caps: u8,
        oob: u8,
    ) -> __BindgenBitfieldUnit<[u8; 1usize], u8> {
        let mut __bindgen_bitfield_unit: __BindgenBitfieldUnit<[u8; 1usize], u8> = Default::default();
        __bindgen_bitfield_unit.set(0usize, 1u8, {
            let bond: u8 = unsafe { ::core::mem::transmute(bond) };
            bond as u64
        });
        __bindgen_bitfield_unit.set(1usize, 1u8, {
            let mitm: u8 = unsafe { ::core::mem::transmute(mitm) };
            mitm as u64
        });
        __bindgen_bitfield_unit.set(2usize, 1u8, {
            let lesc: u8 = unsafe { ::core::mem::transmute(lesc) };
            lesc as u64
        });
        __bindgen_bitfield_unit.set(3usize, 1u8, {
            let keypress: u8 = unsafe { ::core::mem::transmute(keypress) };
            keypress as u64
        });
        __bindgen_bitfield_unit.set(4usize, 3u8, {
            let io_caps: u8 = unsafe { ::core::mem::transmute(io_caps) };
            io_caps as u64
        });
        __bindgen_bitfield_unit.set(7usize, 1u8, {
            let oob: u8 = unsafe { ::core::mem::transmute(oob) };
            oob as u64
        });
        __bindgen_bitfield_unit
    }
}
#[doc = "@brief GAP Encryption Information."]
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct ble_gap_enc_info_t {
    #[doc = "< Long Term Key."]
    pub ltk: [u8; 16usize],
    pub _bitfield_1: __BindgenBitfieldUnit<[u8; 1usize], u8>,
}
#[test]
fn bindgen_test_layout_ble_gap_enc_info_t() {
    assert_eq!(
        ::core::mem::size_of::<ble_gap_enc_info_t>(),
        17usize,
        concat!("Size of: ", stringify!(ble_gap_enc_info_t))
    );
    assert_eq!(
        ::core::mem::align_of::<ble_gap_enc_info_t>(),
        1usize,
        concat!("Alignment of ", stringify!(ble_gap_enc_info_t))
    );
    assert_eq!(
        unsafe { &(*(::core::ptr::null::<ble_gap_enc_info_t>())).ltk as *const _ as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(ble_gap_enc_info_t),
            "::",
            stringify!(ltk)
        )
    );
}
impl ble_gap_enc_info_t {
    #[inline]
    pub fn lesc(&self) -> u8 {
        unsafe { ::core::mem::transmute(self._bitfield_1.get(0usize, 1u8) as u8) }
    }
    #[inline]
    pub fn set_lesc(&mut self, val: u8) {
        unsafe {
            let val: u8 = ::core::mem::transmute(val);
            self._bitfield_1.set(0usize, 1u8, val as u64)
        }
    }
    #[inline]
    pub fn auth(&self) -> u8 {
        unsafe { ::core::mem::transmute(self._bitfield_1.get(1usize, 1u8) as u8) }
    }
    #[inline]
    pub fn set_auth(&mut self, val: u8) {
        unsafe {
            let val: u8 = ::core::mem::transmute(val);
            self._bitfield_1.set(1usize, 1u8, val as u64)
        }
    }
    #[inline]
    pub fn ltk_len(&self) -> u8 {
        unsafe { ::core::mem::transmute(self._bitfield_1.get(2usize, 6u8) as u8) }
    }
    #[inline]
    pub fn set_ltk_len(&mut self, val: u8) {
        unsafe {
            let val: u8 = ::core::mem::transmute(val);
            self._bitfield_1.set(2usize, 6u8, val as u64)
        }
    }
    #[inline]
    pub fn new_bitfield_1(lesc: u8, auth: u8, ltk_len: u8) -> __BindgenBitfieldUnit<[u8; 1usize], u8> {
        let mut __bindgen_bitfield_unit: __BindgenBitfieldUnit<[u8; 1usize], u8> = Default::default();
        __bindgen_bitfield_unit.set(0usize, 1u8, {
            let lesc: u8 = unsafe { ::core::mem::transmute(lesc) };
            lesc as u64
        });
        __bindgen_bitfield_unit.set(1usize, 1u8, {
            let auth: u8 = unsafe { ::core::mem::transmute(auth) };
            auth as u64
        });
        __bindgen_bitfield_unit.set(2usize, 6u8, {
            let ltk_len: u8 = unsafe { ::core::mem::transmute(ltk_len) };
            ltk_len as u64
        });
        __bindgen_bitfield_unit
    }
}
#[doc = "@brief GAP Master Identification."]
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct ble_gap_master_id_t {
    #[doc = "< Encrypted Diversifier."]
    pub ediv: u16,
    #[doc = "< Random Number."]
    pub rand: [u8; 8usize],
}
#[test]
fn bindgen_test_layout_ble_gap_master_id_t() {
    assert_eq!(
        ::core::mem::size_of::<ble_gap_master_id_t>(),
        10usize,
        concat!("Size of: ", stringify!(ble_gap_master_id_t))
    );
    assert_eq!(
        ::core::mem::align_of::<ble_gap_master_id_t>(),
        2usize,
        concat!("Alignment of ", stringify!(ble_gap_master_id_t))
    );
    assert_eq!(
        unsafe { &(*(::core::ptr::null::<ble_gap_master_id_t>())).ediv as *const _ as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(ble_gap_master_id_t),
            "::",
            stringify!(ediv)
        )
    );
    assert_eq!(
        unsafe { &(*(::core::ptr::null::<ble_gap_master_id_t>())).rand as *const _ as usize },
        2usize,
        concat!(
            "Offset of field: ",
            stringify!(ble_gap_master_id_t),
            "::",
            stringify!(rand)
        )
    );
}
#[doc = "@brief GAP Signing Information."]
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct ble_gap_sign_info_t {
    #[doc = "< Connection Signature Resolving Key."]
    pub csrk: [u8; 16usize],
}
#[test]
fn bindgen_test_layout_ble_gap_sign_info_t() {
    assert_eq!(
        ::core::mem::size_of::<ble_gap_sign_info_t>(),
        16usize,
        concat!("Size of: ", stringify!(ble_gap_sign_info_t))
    );
    assert_eq!(
        ::core::mem::align_of::<ble_gap_sign_info_t>(),
        1usize,
        concat!("Alignment of ", stringify!(ble_gap_sign_info_t))
    );
    assert_eq!(
        unsafe { &(*(::core::ptr::null::<ble_gap_sign_info_t>())).csrk as *const _ as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(ble_gap_sign_info_t),
            "::",
            stringify!(csrk)
        )
    );
}
#[doc = "@brief GAP LE Secure Connections P-256 Public Key."]
#[repr(C)]
#[derive(Copy, Clone)]
pub struct ble_gap_lesc_p256_pk_t {
    #[doc = "< LE Secure Connections Elliptic Curve Diffie-Hellman P-256 Public Key. Stored in the standard SMP protocol format: {X,Y} both in little-endian."]
    pub pk: [u8; 64usize],
}
#[test]
fn bindgen_test_layout_ble_gap_lesc_p256_pk_t() {
    assert_eq!(
        ::core::mem::size_of::<ble_gap_lesc_p256_pk_t>(),
        64usize,
        concat!("Size of: ", stringify!(ble_gap_lesc_p256_pk_t))
    );
    assert_eq!(
        ::core::mem::align_of::<ble_gap_lesc_p256_pk_t>(),
        1usize,
        concat!("Alignment of ", stringify!(ble_gap_lesc_p256_pk_t))
    );
    assert_eq!(
        unsafe { &(*(::core::ptr::null::<ble_gap_lesc_p256_pk_t>())).pk as *const _ as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(ble_gap_lesc_p256_pk_t),
            "::",
            stringify!(pk)
        )
    );
}
#[doc = "@brief GAP LE Secure Connections DHKey."]
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct ble_gap_lesc_dhkey_t {
    #[doc = "< LE Secure Connections Elliptic Curve Diffie-Hellman Key. Stored in little-endian."]
    pub key: [u8; 32usize],
}
#[test]
fn bindgen_test_layout_ble_gap_lesc_dhkey_t() {
    assert_eq!(
        ::core::mem::size_of::<ble_gap_lesc_dhkey_t>(),
        32usize,
        concat!("Size of: ", stringify!(ble_gap_lesc_dhkey_t))
    );
    assert_eq!(
        ::core::mem::align_of::<ble_gap_lesc_dhkey_t>(),
        1usize,
        concat!("Alignment of ", stringify!(ble_gap_lesc_dhkey_t))
    );
    assert_eq!(
        unsafe { &(*(::core::ptr::null::<ble_gap_lesc_dhkey_t>())).key as *const _ as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(ble_gap_lesc_dhkey_t),
            "::",
            stringify!(key)
        )
    );
}
#[doc = "@brief GAP LE Secure Connections OOB data."]
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct ble_gap_lesc_oob_data_t {
    #[doc = "< Bluetooth address of the device."]
    pub addr: ble_gap_addr_t,
    #[doc = "< Random Number."]
    pub r: [u8; 16usize],
    #[doc = "< Confirm Value."]
    pub c: [u8; 16usize],
}
#[test]
fn bindgen_test_layout_ble_gap_lesc_oob_data_t() {
    assert_eq!(
        ::core::mem::size_of::<ble_gap_lesc_oob_data_t>(),
        39usize,
        concat!("Size of: ", stringify!(ble_gap_lesc_oob_data_t))
    );
    assert_eq!(
        ::core::mem::align_of::<ble_gap_lesc_oob_data_t>(),
        1usize,
        concat!("Alignment of ", stringify!(ble_gap_lesc_oob_data_t))
    );
    assert_eq!(
        unsafe { &(*(::core::ptr::null::<ble_gap_lesc_oob_data_t>())).addr as *const _ as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(ble_gap_lesc_oob_data_t),
            "::",
            stringify!(addr)
        )
    );
    assert_eq!(
        unsafe { &(*(::core::ptr::null::<ble_gap_lesc_oob_data_t>())).r as *const _ as usize },
        7usize,
        concat!(
            "Offset of field: ",
            stringify!(ble_gap_lesc_oob_data_t),
            "::",
            stringify!(r)
        )
    );
    assert_eq!(
        unsafe { &(*(::core::ptr::null::<ble_gap_lesc_oob_data_t>())).c as *const _ as usize },
        23usize,
        concat!(
            "Offset of field: ",
            stringify!(ble_gap_lesc_oob_data_t),
            "::",
            stringify!(c)
        )
    );
}
#[doc = "@brief Event structure for @ref BLE_GAP_EVT_CONNECTED."]
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct ble_gap_evt_connected_t {
    #[doc = "< Bluetooth address of the peer device. If the peer_addr resolved: @ref ble_gap_addr_t::addr_id_peer is set to 1"]
    #[doc = "and the address is the device's identity address."]
    pub peer_addr: ble_gap_addr_t,
    #[doc = "< BLE role for this connection, see @ref BLE_GAP_ROLES"]
    pub role: u8,
    #[doc = "< GAP Connection Parameters."]
    pub conn_params: ble_gap_conn_params_t,
    #[doc = "< Advertising handle in which advertising has ended."]
    #[doc = "This variable is only set if role is set to @ref BLE_GAP_ROLE_PERIPH."]
    pub adv_handle: u8,
    #[doc = "< Advertising buffers corresponding to the terminated"]
    #[doc = "advertising set. The advertising buffers provided in"]
    #[doc = "@ref sd_ble_gap_adv_set_configure are now released."]
    #[doc = "This variable is only set if role is set to @ref BLE_GAP_ROLE_PERIPH."]
    pub adv_data: ble_gap_adv_data_t,
}
#[test]
fn bindgen_test_layout_ble_gap_evt_connected_t() {
    assert_eq!(
        ::core::mem::size_of::<ble_gap_evt_connected_t>(),
        36usize,
        concat!("Size of: ", stringify!(ble_gap_evt_connected_t))
    );
    assert_eq!(
        ::core::mem::align_of::<ble_gap_evt_connected_t>(),
        4usize,
        concat!("Alignment of ", stringify!(ble_gap_evt_connected_t))
    );
    assert_eq!(
        unsafe { &(*(::core::ptr::null::<ble_gap_evt_connected_t>())).peer_addr as *const _ as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(ble_gap_evt_connected_t),
            "::",
            stringify!(peer_addr)
        )
    );
    assert_eq!(
        unsafe { &(*(::core::ptr::null::<ble_gap_evt_connected_t>())).role as *const _ as usize },
        7usize,
        concat!(
            "Offset of field: ",
            stringify!(ble_gap_evt_connected_t),
            "::",
            stringify!(role)
        )
    );
    assert_eq!(
        unsafe { &(*(::core::ptr::null::<ble_gap_evt_connected_t>())).conn_params as *const _ as usize },
        8usize,
        concat!(
            "Offset of field: ",
            stringify!(ble_gap_evt_connected_t),
            "::",
            stringify!(conn_params)
        )
    );
    assert_eq!(
        unsafe { &(*(::core::ptr::null::<ble_gap_evt_connected_t>())).adv_handle as *const _ as usize },
        16usize,
        concat!(
            "Offset of field: ",
            stringify!(ble_gap_evt_connected_t),
            "::",
            stringify!(adv_handle)
        )
    );
    assert_eq!(
        unsafe { &(*(::core::ptr::null::<ble_gap_evt_connected_t>())).adv_data as *const _ as usize },
        20usize,
        concat!(
            "Offset of field: ",
            stringify!(ble_gap_evt_connected_t),
            "::",
            stringify!(adv_data)
        )
    );
}
#[doc = "@brief Event structure for @ref BLE_GAP_EVT_DISCONNECTED."]
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct ble_gap_evt_disconnected_t {
    #[doc = "< HCI error code, see @ref BLE_HCI_STATUS_CODES."]
    pub reason: u8,
}
#[test]
fn bindgen_test_layout_ble_gap_evt_disconnected_t() {
    assert_eq!(
        ::core::mem::size_of::<ble_gap_evt_disconnected_t>(),
        1usize,
        concat!("Size of: ", stringify!(ble_gap_evt_disconnected_t))
    );
    assert_eq!(
        ::core::mem::align_of::<ble_gap_evt_disconnected_t>(),
        1usize,
        concat!("Alignment of ", stringify!(ble_gap_evt_disconnected_t))
    );
    assert_eq!(
        unsafe { &(*(::core::ptr::null::<ble_gap_evt_disconnected_t>())).reason as *const _ as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(ble_gap_evt_disconnected_t),
            "::",
            stringify!(reason)
        )
    );
}
#[doc = "@brief Event structure for @ref BLE_GAP_EVT_CONN_PARAM_UPDATE."]
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct ble_gap_evt_conn_param_update_t {
    #[doc = "<  GAP Connection Parameters."]
    pub conn_params: ble_gap_conn_params_t,
}
#[test]
fn bindgen_test_layout_ble_gap_evt_conn_param_update_t() {
    assert_eq!(
        ::core::mem::size_of::<ble_gap_evt_conn_param_update_t>(),
        8usize,
        concat!("Size of: ", stringify!(ble_gap_evt_conn_param_update_t))
    );
    assert_eq!(
        ::core::mem::align_of::<ble_gap_evt_conn_param_update_t>(),
        2usize,
        concat!("Alignment of ", stringify!(ble_gap_evt_conn_param_update_t))
    );
    assert_eq!(
        unsafe { &(*(::core::ptr::null::<ble_gap_evt_conn_param_update_t>())).conn_params as *const _ as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(ble_gap_evt_conn_param_update_t),
            "::",
            stringify!(conn_params)
        )
    );
}
#[doc = "@brief Event structure for @ref BLE_GAP_EVT_PHY_UPDATE_REQUEST."]
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct ble_gap_evt_phy_update_request_t {
    #[doc = "< The PHYs the peer prefers to use."]
    pub peer_preferred_phys: ble_gap_phys_t,
}
#[test]
fn bindgen_test_layout_ble_gap_evt_phy_update_request_t() {
    assert_eq!(
        ::core::mem::size_of::<ble_gap_evt_phy_update_request_t>(),
        2usize,
        concat!("Size of: ", stringify!(ble_gap_evt_phy_update_request_t))
    );
    assert_eq!(
        ::core::mem::align_of::<ble_gap_evt_phy_update_request_t>(),
        1usize,
        concat!("Alignment of ", stringify!(ble_gap_evt_phy_update_request_t))
    );
    assert_eq!(
        unsafe {
            &(*(::core::ptr::null::<ble_gap_evt_phy_update_request_t>())).peer_preferred_phys as *const _ as usize
        },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(ble_gap_evt_phy_update_request_t),
            "::",
            stringify!(peer_preferred_phys)
        )
    );
}
#[doc = "@brief Event Structure for @ref BLE_GAP_EVT_PHY_UPDATE."]
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct ble_gap_evt_phy_update_t {
    #[doc = "< Status of the procedure, see @ref BLE_HCI_STATUS_CODES."]
    pub status: u8,
    #[doc = "< TX PHY for this connection, see @ref BLE_GAP_PHYS."]
    pub tx_phy: u8,
    #[doc = "< RX PHY for this connection, see @ref BLE_GAP_PHYS."]
    pub rx_phy: u8,
}
#[test]
fn bindgen_test_layout_ble_gap_evt_phy_update_t() {
    assert_eq!(
        ::core::mem::size_of::<ble_gap_evt_phy_update_t>(),
        3usize,
        concat!("Size of: ", stringify!(ble_gap_evt_phy_update_t))
    );
    assert_eq!(
        ::core::mem::align_of::<ble_gap_evt_phy_update_t>(),
        1usize,
        concat!("Alignment of ", stringify!(ble_gap_evt_phy_update_t))
    );
    assert_eq!(
        unsafe { &(*(::core::ptr::null::<ble_gap_evt_phy_update_t>())).status as *const _ as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(ble_gap_evt_phy_update_t),
            "::",
            stringify!(status)
        )
    );
    assert_eq!(
        unsafe { &(*(::core::ptr::null::<ble_gap_evt_phy_update_t>())).tx_phy as *const _ as usize },
        1usize,
        concat!(
            "Offset of field: ",
            stringify!(ble_gap_evt_phy_update_t),
            "::",
            stringify!(tx_phy)
        )
    );
    assert_eq!(
        unsafe { &(*(::core::ptr::null::<ble_gap_evt_phy_update_t>())).rx_phy as *const _ as usize },
        2usize,
        concat!(
            "Offset of field: ",
            stringify!(ble_gap_evt_phy_update_t),
            "::",
            stringify!(rx_phy)
        )
    );
}
#[doc = "@brief Event structure for @ref BLE_GAP_EVT_SEC_PARAMS_REQUEST."]
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct ble_gap_evt_sec_params_request_t {
    #[doc = "< Initiator Security Parameters."]
    pub peer_params: ble_gap_sec_params_t,
}
#[test]
fn bindgen_test_layout_ble_gap_evt_sec_params_request_t() {
    assert_eq!(
        ::core::mem::size_of::<ble_gap_evt_sec_params_request_t>(),
        5usize,
        concat!("Size of: ", stringify!(ble_gap_evt_sec_params_request_t))
    );
    assert_eq!(
        ::core::mem::align_of::<ble_gap_evt_sec_params_request_t>(),
        1usize,
        concat!("Alignment of ", stringify!(ble_gap_evt_sec_params_request_t))
    );
    assert_eq!(
        unsafe { &(*(::core::ptr::null::<ble_gap_evt_sec_params_request_t>())).peer_params as *const _ as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(ble_gap_evt_sec_params_request_t),
            "::",
            stringify!(peer_params)
        )
    );
}
#[doc = "@brief Event structure for @ref BLE_GAP_EVT_SEC_INFO_REQUEST."]
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct ble_gap_evt_sec_info_request_t {
    #[doc = "< Bluetooth address of the peer device."]
    pub peer_addr: ble_gap_addr_t,
    #[doc = "< Master Identification for LTK lookup."]
    pub master_id: ble_gap_master_id_t,
    pub _bitfield_1: __BindgenBitfieldUnit<[u8; 1usize], u8>,
    pub __bindgen_padding_0: u8,
}
#[test]
fn bindgen_test_layout_ble_gap_evt_sec_info_request_t() {
    assert_eq!(
        ::core::mem::size_of::<ble_gap_evt_sec_info_request_t>(),
        20usize,
        concat!("Size of: ", stringify!(ble_gap_evt_sec_info_request_t))
    );
    assert_eq!(
        ::core::mem::align_of::<ble_gap_evt_sec_info_request_t>(),
        2usize,
        concat!("Alignment of ", stringify!(ble_gap_evt_sec_info_request_t))
    );
    assert_eq!(
        unsafe { &(*(::core::ptr::null::<ble_gap_evt_sec_info_request_t>())).peer_addr as *const _ as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(ble_gap_evt_sec_info_request_t),
            "::",
            stringify!(peer_addr)
        )
    );
    assert_eq!(
        unsafe { &(*(::core::ptr::null::<ble_gap_evt_sec_info_request_t>())).master_id as *const _ as usize },
        8usize,
        concat!(
            "Offset of field: ",
            stringify!(ble_gap_evt_sec_info_request_t),
            "::",
            stringify!(master_id)
        )
    );
}
impl ble_gap_evt_sec_info_request_t {
    #[inline]
    pub fn enc_info(&self) -> u8 {
        unsafe { ::core::mem::transmute(self._bitfield_1.get(0usize, 1u8) as u8) }
    }
    #[inline]
    pub fn set_enc_info(&mut self, val: u8) {
        unsafe {
            let val: u8 = ::core::mem::transmute(val);
            self._bitfield_1.set(0usize, 1u8, val as u64)
        }
    }
    #[inline]
    pub fn id_info(&self) -> u8 {
        unsafe { ::core::mem::transmute(self._bitfield_1.get(1usize, 1u8) as u8) }
    }
    #[inline]
    pub fn set_id_info(&mut self, val: u8) {
        unsafe {
            let val: u8 = ::core::mem::transmute(val);
            self._bitfield_1.set(1usize, 1u8, val as u64)
        }
    }
    #[inline]
    pub fn sign_info(&self) -> u8 {
        unsafe { ::core::mem::transmute(self._bitfield_1.get(2usize, 1u8) as u8) }
    }
    #[inline]
    pub fn set_sign_info(&mut self, val: u8) {
        unsafe {
            let val: u8 = ::core::mem::transmute(val);
            self._bitfield_1.set(2usize, 1u8, val as u64)
        }
    }
    #[inline]
    pub fn new_bitfield_1(enc_info: u8, id_info: u8, sign_info: u8) -> __BindgenBitfieldUnit<[u8; 1usize], u8> {
        let mut __bindgen_bitfield_unit: __BindgenBitfieldUnit<[u8; 1usize], u8> = Default::default();
        __bindgen_bitfield_unit.set(0usize, 1u8, {
            let enc_info: u8 = unsafe { ::core::mem::transmute(enc_info) };
            enc_info as u64
        });
        __bindgen_bitfield_unit.set(1usize, 1u8, {
            let id_info: u8 = unsafe { ::core::mem::transmute(id_info) };
            id_info as u64
        });
        __bindgen_bitfield_unit.set(2usize, 1u8, {
            let sign_info: u8 = unsafe { ::core::mem::transmute(sign_info) };
            sign_info as u64
        });
        __bindgen_bitfield_unit
    }
}
#[doc = "@brief Event structure for @ref BLE_GAP_EVT_PASSKEY_DISPLAY."]
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct ble_gap_evt_passkey_display_t {
    #[doc = "< 6-digit passkey in ASCII ('0'-'9' digits only)."]
    pub passkey: [u8; 6usize],
    pub _bitfield_1: __BindgenBitfieldUnit<[u8; 1usize], u8>,
}
#[test]
fn bindgen_test_layout_ble_gap_evt_passkey_display_t() {
    assert_eq!(
        ::core::mem::size_of::<ble_gap_evt_passkey_display_t>(),
        7usize,
        concat!("Size of: ", stringify!(ble_gap_evt_passkey_display_t))
    );
    assert_eq!(
        ::core::mem::align_of::<ble_gap_evt_passkey_display_t>(),
        1usize,
        concat!("Alignment of ", stringify!(ble_gap_evt_passkey_display_t))
    );
    assert_eq!(
        unsafe { &(*(::core::ptr::null::<ble_gap_evt_passkey_display_t>())).passkey as *const _ as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(ble_gap_evt_passkey_display_t),
            "::",
            stringify!(passkey)
        )
    );
}
impl ble_gap_evt_passkey_display_t {
    #[inline]
    pub fn match_request(&self) -> u8 {
        unsafe { ::core::mem::transmute(self._bitfield_1.get(0usize, 1u8) as u8) }
    }
    #[inline]
    pub fn set_match_request(&mut self, val: u8) {
        unsafe {
            let val: u8 = ::core::mem::transmute(val);
            self._bitfield_1.set(0usize, 1u8, val as u64)
        }
    }
    #[inline]
    pub fn new_bitfield_1(match_request: u8) -> __BindgenBitfieldUnit<[u8; 1usize], u8> {
        let mut __bindgen_bitfield_unit: __BindgenBitfieldUnit<[u8; 1usize], u8> = Default::default();
        __bindgen_bitfield_unit.set(0usize, 1u8, {
            let match_request: u8 = unsafe { ::core::mem::transmute(match_request) };
            match_request as u64
        });
        __bindgen_bitfield_unit
    }
}
#[doc = "@brief Event structure for @ref BLE_GAP_EVT_KEY_PRESSED."]
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct ble_gap_evt_key_pressed_t {
    #[doc = "< Keypress notification type, see @ref BLE_GAP_KP_NOT_TYPES."]
    pub kp_not: u8,
}
#[test]
fn bindgen_test_layout_ble_gap_evt_key_pressed_t() {
    assert_eq!(
        ::core::mem::size_of::<ble_gap_evt_key_pressed_t>(),
        1usize,
        concat!("Size of: ", stringify!(ble_gap_evt_key_pressed_t))
    );
    assert_eq!(
        ::core::mem::align_of::<ble_gap_evt_key_pressed_t>(),
        1usize,
        concat!("Alignment of ", stringify!(ble_gap_evt_key_pressed_t))
    );
    assert_eq!(
        unsafe { &(*(::core::ptr::null::<ble_gap_evt_key_pressed_t>())).kp_not as *const _ as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(ble_gap_evt_key_pressed_t),
            "::",
            stringify!(kp_not)
        )
    );
}
#[doc = "@brief Event structure for @ref BLE_GAP_EVT_AUTH_KEY_REQUEST."]
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct ble_gap_evt_auth_key_request_t {
    #[doc = "< See @ref BLE_GAP_AUTH_KEY_TYPES."]
    pub key_type: u8,
}
#[test]
fn bindgen_test_layout_ble_gap_evt_auth_key_request_t() {
    assert_eq!(
        ::core::mem::size_of::<ble_gap_evt_auth_key_request_t>(),
        1usize,
        concat!("Size of: ", stringify!(ble_gap_evt_auth_key_request_t))
    );
    assert_eq!(
        ::core::mem::align_of::<ble_gap_evt_auth_key_request_t>(),
        1usize,
        concat!("Alignment of ", stringify!(ble_gap_evt_auth_key_request_t))
    );
    assert_eq!(
        unsafe { &(*(::core::ptr::null::<ble_gap_evt_auth_key_request_t>())).key_type as *const _ as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(ble_gap_evt_auth_key_request_t),
            "::",
            stringify!(key_type)
        )
    );
}
#[doc = "@brief Event structure for @ref BLE_GAP_EVT_LESC_DHKEY_REQUEST."]
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct ble_gap_evt_lesc_dhkey_request_t {
    #[doc = "< LE Secure Connections remote P-256 Public Key. This will point to the application-supplied memory"]
    #[doc = "inside the keyset during the call to @ref sd_ble_gap_sec_params_reply."]
    pub p_pk_peer: *mut ble_gap_lesc_p256_pk_t,
    pub _bitfield_1: __BindgenBitfieldUnit<[u8; 1usize], u8>,
    pub __bindgen_padding_0: [u8; 3usize],
}
#[test]
fn bindgen_test_layout_ble_gap_evt_lesc_dhkey_request_t() {
    assert_eq!(
        ::core::mem::size_of::<ble_gap_evt_lesc_dhkey_request_t>(),
        8usize,
        concat!("Size of: ", stringify!(ble_gap_evt_lesc_dhkey_request_t))
    );
    assert_eq!(
        ::core::mem::align_of::<ble_gap_evt_lesc_dhkey_request_t>(),
        4usize,
        concat!("Alignment of ", stringify!(ble_gap_evt_lesc_dhkey_request_t))
    );
    assert_eq!(
        unsafe { &(*(::core::ptr::null::<ble_gap_evt_lesc_dhkey_request_t>())).p_pk_peer as *const _ as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(ble_gap_evt_lesc_dhkey_request_t),
            "::",
            stringify!(p_pk_peer)
        )
    );
}
impl ble_gap_evt_lesc_dhkey_request_t {
    #[inline]
    pub fn oobd_req(&self) -> u8 {
        unsafe { ::core::mem::transmute(self._bitfield_1.get(0usize, 1u8) as u8) }
    }
    #[inline]
    pub fn set_oobd_req(&mut self, val: u8) {
        unsafe {
            let val: u8 = ::core::mem::transmute(val);
            self._bitfield_1.set(0usize, 1u8, val as u64)
        }
    }
    #[inline]
    pub fn new_bitfield_1(oobd_req: u8) -> __BindgenBitfieldUnit<[u8; 1usize], u8> {
        let mut __bindgen_bitfield_unit: __BindgenBitfieldUnit<[u8; 1usize], u8> = Default::default();
        __bindgen_bitfield_unit.set(0usize, 1u8, {
            let oobd_req: u8 = unsafe { ::core::mem::transmute(oobd_req) };
            oobd_req as u64
        });
        __bindgen_bitfield_unit
    }
}
#[doc = "@brief Security levels supported."]
#[doc = " @note  See Bluetooth Specification Version 4.2 Volume 3, Part C, Chapter 10, Section 10.2.1."]
#[repr(C, packed)]
#[derive(Debug, Copy, Clone)]
pub struct ble_gap_sec_levels_t {
    pub _bitfield_1: __BindgenBitfieldUnit<[u8; 1usize], u8>,
}
#[test]
fn bindgen_test_layout_ble_gap_sec_levels_t() {
    assert_eq!(
        ::core::mem::size_of::<ble_gap_sec_levels_t>(),
        1usize,
        concat!("Size of: ", stringify!(ble_gap_sec_levels_t))
    );
    assert_eq!(
        ::core::mem::align_of::<ble_gap_sec_levels_t>(),
        1usize,
        concat!("Alignment of ", stringify!(ble_gap_sec_levels_t))
    );
}
impl ble_gap_sec_levels_t {
    #[inline]
    pub fn lv1(&self) -> u8 {
        unsafe { ::core::mem::transmute(self._bitfield_1.get(0usize, 1u8) as u8) }
    }
    #[inline]
    pub fn set_lv1(&mut self, val: u8) {
        unsafe {
            let val: u8 = ::core::mem::transmute(val);
            self._bitfield_1.set(0usize, 1u8, val as u64)
        }
    }
    #[inline]
    pub fn lv2(&self) -> u8 {
        unsafe { ::core::mem::transmute(self._bitfield_1.get(1usize, 1u8) as u8) }
    }
    #[inline]
    pub fn set_lv2(&mut self, val: u8) {
        unsafe {
            let val: u8 = ::core::mem::transmute(val);
            self._bitfield_1.set(1usize, 1u8, val as u64)
        }
    }
    #[inline]
    pub fn lv3(&self) -> u8 {
        unsafe { ::core::mem::transmute(self._bitfield_1.get(2usize, 1u8) as u8) }
    }
    #[inline]
    pub fn set_lv3(&mut self, val: u8) {
        unsafe {
            let val: u8 = ::core::mem::transmute(val);
            self._bitfield_1.set(2usize, 1u8, val as u64)
        }
    }
    #[inline]
    pub fn lv4(&self) -> u8 {
        unsafe { ::core::mem::transmute(self._bitfield_1.get(3usize, 1u8) as u8) }
    }
    #[inline]
    pub fn set_lv4(&mut self, val: u8) {
        unsafe {
            let val: u8 = ::core::mem::transmute(val);
            self._bitfield_1.set(3usize, 1u8, val as u64)
        }
    }
    #[inline]
    pub fn new_bitfield_1(lv1: u8, lv2: u8, lv3: u8, lv4: u8) -> __BindgenBitfieldUnit<[u8; 1usize], u8> {
        let mut __bindgen_bitfield_unit: __BindgenBitfieldUnit<[u8; 1usize], u8> = Default::default();
        __bindgen_bitfield_unit.set(0usize, 1u8, {
            let lv1: u8 = unsafe { ::core::mem::transmute(lv1) };
            lv1 as u64
        });
        __bindgen_bitfield_unit.set(1usize, 1u8, {
            let lv2: u8 = unsafe { ::core::mem::transmute(lv2) };
            lv2 as u64
        });
        __bindgen_bitfield_unit.set(2usize, 1u8, {
            let lv3: u8 = unsafe { ::core::mem::transmute(lv3) };
            lv3 as u64
        });
        __bindgen_bitfield_unit.set(3usize, 1u8, {
            let lv4: u8 = unsafe { ::core::mem::transmute(lv4) };
            lv4 as u64
        });
        __bindgen_bitfield_unit
    }
}
#[doc = "@brief Encryption Key."]
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct ble_gap_enc_key_t {
    #[doc = "< Encryption Information."]
    pub enc_info: ble_gap_enc_info_t,
    #[doc = "< Master Identification."]
    pub master_id: ble_gap_master_id_t,
}
#[test]
fn bindgen_test_layout_ble_gap_enc_key_t() {
    assert_eq!(
        ::core::mem::size_of::<ble_gap_enc_key_t>(),
        28usize,
        concat!("Size of: ", stringify!(ble_gap_enc_key_t))
    );
    assert_eq!(
        ::core::mem::align_of::<ble_gap_enc_key_t>(),
        2usize,
        concat!("Alignment of ", stringify!(ble_gap_enc_key_t))
    );
    assert_eq!(
        unsafe { &(*(::core::ptr::null::<ble_gap_enc_key_t>())).enc_info as *const _ as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(ble_gap_enc_key_t),
            "::",
            stringify!(enc_info)
        )
    );
    assert_eq!(
        unsafe { &(*(::core::ptr::null::<ble_gap_enc_key_t>())).master_id as *const _ as usize },
        18usize,
        concat!(
            "Offset of field: ",
            stringify!(ble_gap_enc_key_t),
            "::",
            stringify!(master_id)
        )
    );
}
#[doc = "@brief Identity Key."]
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct ble_gap_id_key_t {
    #[doc = "< Identity Resolving Key."]
    pub id_info: ble_gap_irk_t,
    #[doc = "< Identity Address."]
    pub id_addr_info: ble_gap_addr_t,
}
#[test]
fn bindgen_test_layout_ble_gap_id_key_t() {
    assert_eq!(
        ::core::mem::size_of::<ble_gap_id_key_t>(),
        23usize,
        concat!("Size of: ", stringify!(ble_gap_id_key_t))
    );
    assert_eq!(
        ::core::mem::align_of::<ble_gap_id_key_t>(),
        1usize,
        concat!("Alignment of ", stringify!(ble_gap_id_key_t))
    );
    assert_eq!(
        unsafe { &(*(::core::ptr::null::<ble_gap_id_key_t>())).id_info as *const _ as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(ble_gap_id_key_t),
            "::",
            stringify!(id_info)
        )
    );
    assert_eq!(
        unsafe { &(*(::core::ptr::null::<ble_gap_id_key_t>())).id_addr_info as *const _ as usize },
        16usize,
        concat!(
            "Offset of field: ",
            stringify!(ble_gap_id_key_t),
            "::",
            stringify!(id_addr_info)
        )
    );
}
#[doc = "@brief Security Keys."]
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct ble_gap_sec_keys_t {
    #[doc = "< Encryption Key, or NULL."]
    pub p_enc_key: *mut ble_gap_enc_key_t,
    #[doc = "< Identity Key, or NULL."]
    pub p_id_key: *mut ble_gap_id_key_t,
    #[doc = "< Signing Key, or NULL."]
    pub p_sign_key: *mut ble_gap_sign_info_t,
    #[doc = "< LE Secure Connections P-256 Public Key. When in debug mode the application must use the value defined"]
    #[doc = "in the Core Bluetooth Specification v4.2 Vol.3, Part H, Section 2.3.5.6.1"]
    pub p_pk: *mut ble_gap_lesc_p256_pk_t,
}
#[test]
fn bindgen_test_layout_ble_gap_sec_keys_t() {
    assert_eq!(
        ::core::mem::size_of::<ble_gap_sec_keys_t>(),
        16usize,
        concat!("Size of: ", stringify!(ble_gap_sec_keys_t))
    );
    assert_eq!(
        ::core::mem::align_of::<ble_gap_sec_keys_t>(),
        4usize,
        concat!("Alignment of ", stringify!(ble_gap_sec_keys_t))
    );
    assert_eq!(
        unsafe { &(*(::core::ptr::null::<ble_gap_sec_keys_t>())).p_enc_key as *const _ as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(ble_gap_sec_keys_t),
            "::",
            stringify!(p_enc_key)
        )
    );
    assert_eq!(
        unsafe { &(*(::core::ptr::null::<ble_gap_sec_keys_t>())).p_id_key as *const _ as usize },
        4usize,
        concat!(
            "Offset of field: ",
            stringify!(ble_gap_sec_keys_t),
            "::",
            stringify!(p_id_key)
        )
    );
    assert_eq!(
        unsafe { &(*(::core::ptr::null::<ble_gap_sec_keys_t>())).p_sign_key as *const _ as usize },
        8usize,
        concat!(
            "Offset of field: ",
            stringify!(ble_gap_sec_keys_t),
            "::",
            stringify!(p_sign_key)
        )
    );
    assert_eq!(
        unsafe { &(*(::core::ptr::null::<ble_gap_sec_keys_t>())).p_pk as *const _ as usize },
        12usize,
        concat!(
            "Offset of field: ",
            stringify!(ble_gap_sec_keys_t),
            "::",
            stringify!(p_pk)
        )
    );
}
#[doc = "@brief Security key set for both local and peer keys."]
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct ble_gap_sec_keyset_t {
    #[doc = "< Keys distributed by the local device. For LE Secure Connections the encryption key will be generated locally and will always be stored if bonding."]
    pub keys_own: ble_gap_sec_keys_t,
    #[doc = "< Keys distributed by the remote device. For LE Secure Connections, p_enc_key must always be NULL."]
    pub keys_peer: ble_gap_sec_keys_t,
}
#[test]
fn bindgen_test_layout_ble_gap_sec_keyset_t() {
    assert_eq!(
        ::core::mem::size_of::<ble_gap_sec_keyset_t>(),
        32usize,
        concat!("Size of: ", stringify!(ble_gap_sec_keyset_t))
    );
    assert_eq!(
        ::core::mem::align_of::<ble_gap_sec_keyset_t>(),
        4usize,
        concat!("Alignment of ", stringify!(ble_gap_sec_keyset_t))
    );
    assert_eq!(
        unsafe { &(*(::core::ptr::null::<ble_gap_sec_keyset_t>())).keys_own as *const _ as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(ble_gap_sec_keyset_t),
            "::",
            stringify!(keys_own)
        )
    );
    assert_eq!(
        unsafe { &(*(::core::ptr::null::<ble_gap_sec_keyset_t>())).keys_peer as *const _ as usize },
        16usize,
        concat!(
            "Offset of field: ",
            stringify!(ble_gap_sec_keyset_t),
            "::",
            stringify!(keys_peer)
        )
    );
}
#[doc = "@brief Data Length Update Procedure parameters."]
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct ble_gap_data_length_params_t {
    #[doc = "< Maximum number of payload octets that a Controller supports for transmission of a single Link Layer Data Channel PDU."]
    pub max_tx_octets: u16,
    #[doc = "< Maximum number of payload octets that a Controller supports for reception of a single Link Layer Data Channel PDU."]
    pub max_rx_octets: u16,
    #[doc = "< Maximum time, in microseconds, that a Controller supports for transmission of a single Link Layer Data Channel PDU."]
    pub max_tx_time_us: u16,
    #[doc = "< Maximum time, in microseconds, that a Controller supports for reception of a single Link Layer Data Channel PDU."]
    pub max_rx_time_us: u16,
}
#[test]
fn bindgen_test_layout_ble_gap_data_length_params_t() {
    assert_eq!(
        ::core::mem::size_of::<ble_gap_data_length_params_t>(),
        8usize,
        concat!("Size of: ", stringify!(ble_gap_data_length_params_t))
    );
    assert_eq!(
        ::core::mem::align_of::<ble_gap_data_length_params_t>(),
        2usize,
        concat!("Alignment of ", stringify!(ble_gap_data_length_params_t))
    );
    assert_eq!(
        unsafe { &(*(::core::ptr::null::<ble_gap_data_length_params_t>())).max_tx_octets as *const _ as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(ble_gap_data_length_params_t),
            "::",
            stringify!(max_tx_octets)
        )
    );
    assert_eq!(
        unsafe { &(*(::core::ptr::null::<ble_gap_data_length_params_t>())).max_rx_octets as *const _ as usize },
        2usize,
        concat!(
            "Offset of field: ",
            stringify!(ble_gap_data_length_params_t),
            "::",
            stringify!(max_rx_octets)
        )
    );
    assert_eq!(
        unsafe { &(*(::core::ptr::null::<ble_gap_data_length_params_t>())).max_tx_time_us as *const _ as usize },
        4usize,
        concat!(
            "Offset of field: ",
            stringify!(ble_gap_data_length_params_t),
            "::",
            stringify!(max_tx_time_us)
        )
    );
    assert_eq!(
        unsafe { &(*(::core::ptr::null::<ble_gap_data_length_params_t>())).max_rx_time_us as *const _ as usize },
        6usize,
        concat!(
            "Offset of field: ",
            stringify!(ble_gap_data_length_params_t),
            "::",
            stringify!(max_rx_time_us)
        )
    );
}
#[doc = "@brief Data Length Update Procedure local limitation."]
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct ble_gap_data_length_limitation_t {
    #[doc = "< If > 0, the requested TX packet length is too long by this many octets."]
    pub tx_payload_limited_octets: u16,
    #[doc = "< If > 0, the requested RX packet length is too long by this many octets."]
    pub rx_payload_limited_octets: u16,
    #[doc = "< If > 0, the requested combination of TX and RX packet lengths is too long by this many microseconds."]
    pub tx_rx_time_limited_us: u16,
}
#[test]
fn bindgen_test_layout_ble_gap_data_length_limitation_t() {
    assert_eq!(
        ::core::mem::size_of::<ble_gap_data_length_limitation_t>(),
        6usize,
        concat!("Size of: ", stringify!(ble_gap_data_length_limitation_t))
    );
    assert_eq!(
        ::core::mem::align_of::<ble_gap_data_length_limitation_t>(),
        2usize,
        concat!("Alignment of ", stringify!(ble_gap_data_length_limitation_t))
    );
    assert_eq!(
        unsafe {
            &(*(::core::ptr::null::<ble_gap_data_length_limitation_t>())).tx_payload_limited_octets as *const _ as usize
        },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(ble_gap_data_length_limitation_t),
            "::",
            stringify!(tx_payload_limited_octets)
        )
    );
    assert_eq!(
        unsafe {
            &(*(::core::ptr::null::<ble_gap_data_length_limitation_t>())).rx_payload_limited_octets as *const _ as usize
        },
        2usize,
        concat!(
            "Offset of field: ",
            stringify!(ble_gap_data_length_limitation_t),
            "::",
            stringify!(rx_payload_limited_octets)
        )
    );
    assert_eq!(
        unsafe {
            &(*(::core::ptr::null::<ble_gap_data_length_limitation_t>())).tx_rx_time_limited_us as *const _ as usize
        },
        4usize,
        concat!(
            "Offset of field: ",
            stringify!(ble_gap_data_length_limitation_t),
            "::",
            stringify!(tx_rx_time_limited_us)
        )
    );
}
#[doc = "@brief Event structure for @ref BLE_GAP_EVT_AUTH_STATUS."]
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct ble_gap_evt_auth_status_t {
    #[doc = "< Authentication status, see @ref BLE_GAP_SEC_STATUS."]
    pub auth_status: u8,
    pub _bitfield_1: __BindgenBitfieldUnit<[u8; 1usize], u8>,
    #[doc = "< Levels supported in Security Mode 1."]
    pub sm1_levels: ble_gap_sec_levels_t,
    #[doc = "< Levels supported in Security Mode 2."]
    pub sm2_levels: ble_gap_sec_levels_t,
    #[doc = "< Bitmap stating which keys were exchanged (distributed) by the local device. If bonding with LE Secure Connections, the enc bit will be always set."]
    pub kdist_own: ble_gap_sec_kdist_t,
    #[doc = "< Bitmap stating which keys were exchanged (distributed) by the remote device. If bonding with LE Secure Connections, the enc bit will never be set."]
    pub kdist_peer: ble_gap_sec_kdist_t,
}
#[test]
fn bindgen_test_layout_ble_gap_evt_auth_status_t() {
    assert_eq!(
        ::core::mem::size_of::<ble_gap_evt_auth_status_t>(),
        6usize,
        concat!("Size of: ", stringify!(ble_gap_evt_auth_status_t))
    );
    assert_eq!(
        ::core::mem::align_of::<ble_gap_evt_auth_status_t>(),
        1usize,
        concat!("Alignment of ", stringify!(ble_gap_evt_auth_status_t))
    );
    assert_eq!(
        unsafe { &(*(::core::ptr::null::<ble_gap_evt_auth_status_t>())).auth_status as *const _ as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(ble_gap_evt_auth_status_t),
            "::",
            stringify!(auth_status)
        )
    );
    assert_eq!(
        unsafe { &(*(::core::ptr::null::<ble_gap_evt_auth_status_t>())).sm1_levels as *const _ as usize },
        2usize,
        concat!(
            "Offset of field: ",
            stringify!(ble_gap_evt_auth_status_t),
            "::",
            stringify!(sm1_levels)
        )
    );
    assert_eq!(
        unsafe { &(*(::core::ptr::null::<ble_gap_evt_auth_status_t>())).sm2_levels as *const _ as usize },
        3usize,
        concat!(
            "Offset of field: ",
            stringify!(ble_gap_evt_auth_status_t),
            "::",
            stringify!(sm2_levels)
        )
    );
    assert_eq!(
        unsafe { &(*(::core::ptr::null::<ble_gap_evt_auth_status_t>())).kdist_own as *const _ as usize },
        4usize,
        concat!(
            "Offset of field: ",
            stringify!(ble_gap_evt_auth_status_t),
            "::",
            stringify!(kdist_own)
        )
    );
    assert_eq!(
        unsafe { &(*(::core::ptr::null::<ble_gap_evt_auth_status_t>())).kdist_peer as *const _ as usize },
        5usize,
        concat!(
            "Offset of field: ",
            stringify!(ble_gap_evt_auth_status_t),
            "::",
            stringify!(kdist_peer)
        )
    );
}
impl ble_gap_evt_auth_status_t {
    #[inline]
    pub fn error_src(&self) -> u8 {
        unsafe { ::core::mem::transmute(self._bitfield_1.get(0usize, 2u8) as u8) }
    }
    #[inline]
    pub fn set_error_src(&mut self, val: u8) {
        unsafe {
            let val: u8 = ::core::mem::transmute(val);
            self._bitfield_1.set(0usize, 2u8, val as u64)
        }
    }
    #[inline]
    pub fn bonded(&self) -> u8 {
        unsafe { ::core::mem::transmute(self._bitfield_1.get(2usize, 1u8) as u8) }
    }
    #[inline]
    pub fn set_bonded(&mut self, val: u8) {
        unsafe {
            let val: u8 = ::core::mem::transmute(val);
            self._bitfield_1.set(2usize, 1u8, val as u64)
        }
    }
    #[inline]
    pub fn lesc(&self) -> u8 {
        unsafe { ::core::mem::transmute(self._bitfield_1.get(3usize, 1u8) as u8) }
    }
    #[inline]
    pub fn set_lesc(&mut self, val: u8) {
        unsafe {
            let val: u8 = ::core::mem::transmute(val);
            self._bitfield_1.set(3usize, 1u8, val as u64)
        }
    }
    #[inline]
    pub fn new_bitfield_1(error_src: u8, bonded: u8, lesc: u8) -> __BindgenBitfieldUnit<[u8; 1usize], u8> {
        let mut __bindgen_bitfield_unit: __BindgenBitfieldUnit<[u8; 1usize], u8> = Default::default();
        __bindgen_bitfield_unit.set(0usize, 2u8, {
            let error_src: u8 = unsafe { ::core::mem::transmute(error_src) };
            error_src as u64
        });
        __bindgen_bitfield_unit.set(2usize, 1u8, {
            let bonded: u8 = unsafe { ::core::mem::transmute(bonded) };
            bonded as u64
        });
        __bindgen_bitfield_unit.set(3usize, 1u8, {
            let lesc: u8 = unsafe { ::core::mem::transmute(lesc) };
            lesc as u64
        });
        __bindgen_bitfield_unit
    }
}
#[doc = "@brief Event structure for @ref BLE_GAP_EVT_CONN_SEC_UPDATE."]
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct ble_gap_evt_conn_sec_update_t {
    #[doc = "< Connection security level."]
    pub conn_sec: ble_gap_conn_sec_t,
}
#[test]
fn bindgen_test_layout_ble_gap_evt_conn_sec_update_t() {
    assert_eq!(
        ::core::mem::size_of::<ble_gap_evt_conn_sec_update_t>(),
        2usize,
        concat!("Size of: ", stringify!(ble_gap_evt_conn_sec_update_t))
    );
    assert_eq!(
        ::core::mem::align_of::<ble_gap_evt_conn_sec_update_t>(),
        1usize,
        concat!("Alignment of ", stringify!(ble_gap_evt_conn_sec_update_t))
    );
    assert_eq!(
        unsafe { &(*(::core::ptr::null::<ble_gap_evt_conn_sec_update_t>())).conn_sec as *const _ as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(ble_gap_evt_conn_sec_update_t),
            "::",
            stringify!(conn_sec)
        )
    );
}
#[doc = "@brief Event structure for @ref BLE_GAP_EVT_TIMEOUT."]
#[repr(C)]
#[derive(Copy, Clone)]
pub struct ble_gap_evt_timeout_t {
    #[doc = "< Source of timeout event, see @ref BLE_GAP_TIMEOUT_SOURCES."]
    pub src: u8,
    #[doc = "< Event Parameters."]
    pub params: ble_gap_evt_timeout_t__bindgen_ty_1,
}
#[repr(C)]
#[derive(Copy, Clone)]
pub union ble_gap_evt_timeout_t__bindgen_ty_1 {
    #[doc = "< If source is set to @ref BLE_GAP_TIMEOUT_SRC_SCAN, the released"]
    #[doc = "scan buffer is contained in this field."]
    pub adv_report_buffer: ble_data_t,
    _bindgen_union_align: [u32; 2usize],
}
#[test]
fn bindgen_test_layout_ble_gap_evt_timeout_t__bindgen_ty_1() {
    assert_eq!(
        ::core::mem::size_of::<ble_gap_evt_timeout_t__bindgen_ty_1>(),
        8usize,
        concat!("Size of: ", stringify!(ble_gap_evt_timeout_t__bindgen_ty_1))
    );
    assert_eq!(
        ::core::mem::align_of::<ble_gap_evt_timeout_t__bindgen_ty_1>(),
        4usize,
        concat!("Alignment of ", stringify!(ble_gap_evt_timeout_t__bindgen_ty_1))
    );
    assert_eq!(
        unsafe {
            &(*(::core::ptr::null::<ble_gap_evt_timeout_t__bindgen_ty_1>())).adv_report_buffer as *const _ as usize
        },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(ble_gap_evt_timeout_t__bindgen_ty_1),
            "::",
            stringify!(adv_report_buffer)
        )
    );
}
#[test]
fn bindgen_test_layout_ble_gap_evt_timeout_t() {
    assert_eq!(
        ::core::mem::size_of::<ble_gap_evt_timeout_t>(),
        12usize,
        concat!("Size of: ", stringify!(ble_gap_evt_timeout_t))
    );
    assert_eq!(
        ::core::mem::align_of::<ble_gap_evt_timeout_t>(),
        4usize,
        concat!("Alignment of ", stringify!(ble_gap_evt_timeout_t))
    );
    assert_eq!(
        unsafe { &(*(::core::ptr::null::<ble_gap_evt_timeout_t>())).src as *const _ as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(ble_gap_evt_timeout_t),
            "::",
            stringify!(src)
        )
    );
    assert_eq!(
        unsafe { &(*(::core::ptr::null::<ble_gap_evt_timeout_t>())).params as *const _ as usize },
        4usize,
        concat!(
            "Offset of field: ",
            stringify!(ble_gap_evt_timeout_t),
            "::",
            stringify!(params)
        )
    );
}
#[doc = "@brief Event structure for @ref BLE_GAP_EVT_RSSI_CHANGED."]
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct ble_gap_evt_rssi_changed_t {
    #[doc = "< Received Signal Strength Indication in dBm."]
    #[doc = "@note ERRATA-153 requires the rssi sample to be compensated based on a temperature measurement."]
    pub rssi: i8,
    #[doc = "< Data Channel Index on which the Signal Strength is measured (0-36)."]
    pub ch_index: u8,
}
#[test]
fn bindgen_test_layout_ble_gap_evt_rssi_changed_t() {
    assert_eq!(
        ::core::mem::size_of::<ble_gap_evt_rssi_changed_t>(),
        2usize,
        concat!("Size of: ", stringify!(ble_gap_evt_rssi_changed_t))
    );
    assert_eq!(
        ::core::mem::align_of::<ble_gap_evt_rssi_changed_t>(),
        1usize,
        concat!("Alignment of ", stringify!(ble_gap_evt_rssi_changed_t))
    );
    assert_eq!(
        unsafe { &(*(::core::ptr::null::<ble_gap_evt_rssi_changed_t>())).rssi as *const _ as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(ble_gap_evt_rssi_changed_t),
            "::",
            stringify!(rssi)
        )
    );
    assert_eq!(
        unsafe { &(*(::core::ptr::null::<ble_gap_evt_rssi_changed_t>())).ch_index as *const _ as usize },
        1usize,
        concat!(
            "Offset of field: ",
            stringify!(ble_gap_evt_rssi_changed_t),
            "::",
            stringify!(ch_index)
        )
    );
}
#[doc = "@brief Event structure for @ref BLE_GAP_EVT_ADV_SET_TERMINATED"]
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct ble_gap_evt_adv_set_terminated_t {
    #[doc = "< Reason for why the advertising set terminated. See"]
    #[doc = "@ref BLE_GAP_EVT_ADV_SET_TERMINATED_REASON."]
    pub reason: u8,
    #[doc = "< Advertising handle in which advertising has ended."]
    pub adv_handle: u8,
    #[doc = "< If @ref ble_gap_adv_params_t::max_adv_evts was not set to 0,"]
    #[doc = "this field indicates the number of completed advertising events."]
    pub num_completed_adv_events: u8,
    #[doc = "< Advertising buffers corresponding to the terminated"]
    #[doc = "advertising set. The advertising buffers provided in"]
    #[doc = "@ref sd_ble_gap_adv_set_configure are now released."]
    pub adv_data: ble_gap_adv_data_t,
}
#[test]
fn bindgen_test_layout_ble_gap_evt_adv_set_terminated_t() {
    assert_eq!(
        ::core::mem::size_of::<ble_gap_evt_adv_set_terminated_t>(),
        20usize,
        concat!("Size of: ", stringify!(ble_gap_evt_adv_set_terminated_t))
    );
    assert_eq!(
        ::core::mem::align_of::<ble_gap_evt_adv_set_terminated_t>(),
        4usize,
        concat!("Alignment of ", stringify!(ble_gap_evt_adv_set_terminated_t))
    );
    assert_eq!(
        unsafe { &(*(::core::ptr::null::<ble_gap_evt_adv_set_terminated_t>())).reason as *const _ as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(ble_gap_evt_adv_set_terminated_t),
            "::",
            stringify!(reason)
        )
    );
    assert_eq!(
        unsafe { &(*(::core::ptr::null::<ble_gap_evt_adv_set_terminated_t>())).adv_handle as *const _ as usize },
        1usize,
        concat!(
            "Offset of field: ",
            stringify!(ble_gap_evt_adv_set_terminated_t),
            "::",
            stringify!(adv_handle)
        )
    );
    assert_eq!(
        unsafe {
            &(*(::core::ptr::null::<ble_gap_evt_adv_set_terminated_t>())).num_completed_adv_events as *const _ as usize
        },
        2usize,
        concat!(
            "Offset of field: ",
            stringify!(ble_gap_evt_adv_set_terminated_t),
            "::",
            stringify!(num_completed_adv_events)
        )
    );
    assert_eq!(
        unsafe { &(*(::core::ptr::null::<ble_gap_evt_adv_set_terminated_t>())).adv_data as *const _ as usize },
        4usize,
        concat!(
            "Offset of field: ",
            stringify!(ble_gap_evt_adv_set_terminated_t),
            "::",
            stringify!(adv_data)
        )
    );
}
#[doc = "@brief Event structure for @ref BLE_GAP_EVT_ADV_REPORT."]
#[doc = ""]
#[doc = " @note If @ref ble_gap_adv_report_type_t::status is set to @ref BLE_GAP_ADV_DATA_STATUS_INCOMPLETE_MORE_DATA,"]
#[doc = "       not all fields in the advertising report may be available."]
#[doc = ""]
#[doc = " @note When ble_gap_adv_report_type_t::status is not set to @ref BLE_GAP_ADV_DATA_STATUS_INCOMPLETE_MORE_DATA,"]
#[doc = "       scanning will be paused. To continue scanning, call @ref sd_ble_gap_scan_start."]
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct ble_gap_evt_adv_report_t {
    #[doc = "< Advertising report type. See @ref ble_gap_adv_report_type_t."]
    pub type_: ble_gap_adv_report_type_t,
    #[doc = "< Bluetooth address of the peer device. If the peer_addr is resolved:"]
    #[doc = "@ref ble_gap_addr_t::addr_id_peer is set to 1 and the address is the"]
    #[doc = "peer's identity address."]
    pub peer_addr: ble_gap_addr_t,
    #[doc = "< Contains the target address of the advertising event if"]
    #[doc = "@ref ble_gap_adv_report_type_t::directed is set to 1. If the"]
    #[doc = "SoftDevice was able to resolve the address,"]
    #[doc = "@ref ble_gap_addr_t::addr_id_peer is set to 1 and the direct_addr"]
    #[doc = "contains the local identity address. If the target address of the"]
    #[doc = "advertising event is @ref BLE_GAP_ADDR_TYPE_RANDOM_PRIVATE_RESOLVABLE,"]
    #[doc = "and the SoftDevice was unable to resolve it, the application may try"]
    #[doc = "to resolve this address to find out if the advertising event was"]
    #[doc = "directed to us."]
    pub direct_addr: ble_gap_addr_t,
    #[doc = "< Indicates the PHY on which the primary advertising packet was received."]
    #[doc = "See @ref BLE_GAP_PHYS."]
    pub primary_phy: u8,
    #[doc = "< Indicates the PHY on which the secondary advertising packet was received."]
    #[doc = "See @ref BLE_GAP_PHYS. This field is set to @ref BLE_GAP_PHY_NOT_SET if no packets"]
    #[doc = "were received on a secondary advertising channel."]
    pub secondary_phy: u8,
    #[doc = "< TX Power reported by the advertiser in the last packet header received."]
    #[doc = "This field is set to @ref BLE_GAP_POWER_LEVEL_INVALID if the"]
    #[doc = "last received packet did not contain the Tx Power field."]
    #[doc = "@note TX Power is only included in extended advertising packets."]
    pub tx_power: i8,
    #[doc = "< Received Signal Strength Indication in dBm of the last packet received."]
    #[doc = "@note ERRATA-153 requires the rssi sample to be compensated based on a temperature measurement."]
    pub rssi: i8,
    #[doc = "< Channel Index on which the last advertising packet is received (0-39)."]
    pub ch_index: u8,
    #[doc = "< Set ID of the received advertising data. Set ID is not present"]
    #[doc = "if set to @ref BLE_GAP_ADV_REPORT_SET_ID_NOT_AVAILABLE."]
    pub set_id: u8,
    pub _bitfield_1: __BindgenBitfieldUnit<[u8; 2usize], u16>,
    #[doc = "< Received advertising or scan response data. If"]
    #[doc = "@ref ble_gap_adv_report_type_t::status is not set to"]
    #[doc = "@ref BLE_GAP_ADV_DATA_STATUS_INCOMPLETE_MORE_DATA, the data buffer provided"]
    #[doc = "in @ref sd_ble_gap_scan_start is now released."]
    pub data: ble_data_t,
    #[doc = "< The offset and PHY of the next advertising packet in this extended advertising"]
    #[doc = "event. @note This field is only set if @ref ble_gap_adv_report_type_t::status"]
    #[doc = "is set to @ref BLE_GAP_ADV_DATA_STATUS_INCOMPLETE_MORE_DATA."]
    pub aux_pointer: ble_gap_aux_pointer_t,
}
#[test]
fn bindgen_test_layout_ble_gap_evt_adv_report_t() {
    assert_eq!(
        ::core::mem::size_of::<ble_gap_evt_adv_report_t>(),
        36usize,
        concat!("Size of: ", stringify!(ble_gap_evt_adv_report_t))
    );
    assert_eq!(
        ::core::mem::align_of::<ble_gap_evt_adv_report_t>(),
        4usize,
        concat!("Alignment of ", stringify!(ble_gap_evt_adv_report_t))
    );
    assert_eq!(
        unsafe { &(*(::core::ptr::null::<ble_gap_evt_adv_report_t>())).type_ as *const _ as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(ble_gap_evt_adv_report_t),
            "::",
            stringify!(type_)
        )
    );
    assert_eq!(
        unsafe { &(*(::core::ptr::null::<ble_gap_evt_adv_report_t>())).peer_addr as *const _ as usize },
        2usize,
        concat!(
            "Offset of field: ",
            stringify!(ble_gap_evt_adv_report_t),
            "::",
            stringify!(peer_addr)
        )
    );
    assert_eq!(
        unsafe { &(*(::core::ptr::null::<ble_gap_evt_adv_report_t>())).direct_addr as *const _ as usize },
        9usize,
        concat!(
            "Offset of field: ",
            stringify!(ble_gap_evt_adv_report_t),
            "::",
            stringify!(direct_addr)
        )
    );
    assert_eq!(
        unsafe { &(*(::core::ptr::null::<ble_gap_evt_adv_report_t>())).primary_phy as *const _ as usize },
        16usize,
        concat!(
            "Offset of field: ",
            stringify!(ble_gap_evt_adv_report_t),
            "::",
            stringify!(primary_phy)
        )
    );
    assert_eq!(
        unsafe { &(*(::core::ptr::null::<ble_gap_evt_adv_report_t>())).secondary_phy as *const _ as usize },
        17usize,
        concat!(
            "Offset of field: ",
            stringify!(ble_gap_evt_adv_report_t),
            "::",
            stringify!(secondary_phy)
        )
    );
    assert_eq!(
        unsafe { &(*(::core::ptr::null::<ble_gap_evt_adv_report_t>())).tx_power as *const _ as usize },
        18usize,
        concat!(
            "Offset of field: ",
            stringify!(ble_gap_evt_adv_report_t),
            "::",
            stringify!(tx_power)
        )
    );
    assert_eq!(
        unsafe { &(*(::core::ptr::null::<ble_gap_evt_adv_report_t>())).rssi as *const _ as usize },
        19usize,
        concat!(
            "Offset of field: ",
            stringify!(ble_gap_evt_adv_report_t),
            "::",
            stringify!(rssi)
        )
    );
    assert_eq!(
        unsafe { &(*(::core::ptr::null::<ble_gap_evt_adv_report_t>())).ch_index as *const _ as usize },
        20usize,
        concat!(
            "Offset of field: ",
            stringify!(ble_gap_evt_adv_report_t),
            "::",
            stringify!(ch_index)
        )
    );
    assert_eq!(
        unsafe { &(*(::core::ptr::null::<ble_gap_evt_adv_report_t>())).set_id as *const _ as usize },
        21usize,
        concat!(
            "Offset of field: ",
            stringify!(ble_gap_evt_adv_report_t),
            "::",
            stringify!(set_id)
        )
    );
    assert_eq!(
        unsafe { &(*(::core::ptr::null::<ble_gap_evt_adv_report_t>())).data as *const _ as usize },
        24usize,
        concat!(
            "Offset of field: ",
            stringify!(ble_gap_evt_adv_report_t),
            "::",
            stringify!(data)
        )
    );
    assert_eq!(
        unsafe { &(*(::core::ptr::null::<ble_gap_evt_adv_report_t>())).aux_pointer as *const _ as usize },
        32usize,
        concat!(
            "Offset of field: ",
            stringify!(ble_gap_evt_adv_report_t),
            "::",
            stringify!(aux_pointer)
        )
    );
}
impl ble_gap_evt_adv_report_t {
    #[inline]
    pub fn data_id(&self) -> u16 {
        unsafe { ::core::mem::transmute(self._bitfield_1.get(0usize, 12u8) as u16) }
    }
    #[inline]
    pub fn set_data_id(&mut self, val: u16) {
        unsafe {
            let val: u16 = ::core::mem::transmute(val);
            self._bitfield_1.set(0usize, 12u8, val as u64)
        }
    }
    #[inline]
    pub fn new_bitfield_1(data_id: u16) -> __BindgenBitfieldUnit<[u8; 2usize], u16> {
        let mut __bindgen_bitfield_unit: __BindgenBitfieldUnit<[u8; 2usize], u16> = Default::default();
        __bindgen_bitfield_unit.set(0usize, 12u8, {
            let data_id: u16 = unsafe { ::core::mem::transmute(data_id) };
            data_id as u64
        });
        __bindgen_bitfield_unit
    }
}
#[doc = "@brief Event structure for @ref BLE_GAP_EVT_SEC_REQUEST."]
#[repr(C, packed)]
#[derive(Debug, Copy, Clone)]
pub struct ble_gap_evt_sec_request_t {
    pub _bitfield_1: __BindgenBitfieldUnit<[u8; 1usize], u8>,
}
#[test]
fn bindgen_test_layout_ble_gap_evt_sec_request_t() {
    assert_eq!(
        ::core::mem::size_of::<ble_gap_evt_sec_request_t>(),
        1usize,
        concat!("Size of: ", stringify!(ble_gap_evt_sec_request_t))
    );
    assert_eq!(
        ::core::mem::align_of::<ble_gap_evt_sec_request_t>(),
        1usize,
        concat!("Alignment of ", stringify!(ble_gap_evt_sec_request_t))
    );
}
impl ble_gap_evt_sec_request_t {
    #[inline]
    pub fn bond(&self) -> u8 {
        unsafe { ::core::mem::transmute(self._bitfield_1.get(0usize, 1u8) as u8) }
    }
    #[inline]
    pub fn set_bond(&mut self, val: u8) {
        unsafe {
            let val: u8 = ::core::mem::transmute(val);
            self._bitfield_1.set(0usize, 1u8, val as u64)
        }
    }
    #[inline]
    pub fn mitm(&self) -> u8 {
        unsafe { ::core::mem::transmute(self._bitfield_1.get(1usize, 1u8) as u8) }
    }
    #[inline]
    pub fn set_mitm(&mut self, val: u8) {
        unsafe {
            let val: u8 = ::core::mem::transmute(val);
            self._bitfield_1.set(1usize, 1u8, val as u64)
        }
    }
    #[inline]
    pub fn lesc(&self) -> u8 {
        unsafe { ::core::mem::transmute(self._bitfield_1.get(2usize, 1u8) as u8) }
    }
    #[inline]
    pub fn set_lesc(&mut self, val: u8) {
        unsafe {
            let val: u8 = ::core::mem::transmute(val);
            self._bitfield_1.set(2usize, 1u8, val as u64)
        }
    }
    #[inline]
    pub fn keypress(&self) -> u8 {
        unsafe { ::core::mem::transmute(self._bitfield_1.get(3usize, 1u8) as u8) }
    }
    #[inline]
    pub fn set_keypress(&mut self, val: u8) {
        unsafe {
            let val: u8 = ::core::mem::transmute(val);
            self._bitfield_1.set(3usize, 1u8, val as u64)
        }
    }
    #[inline]
    pub fn new_bitfield_1(bond: u8, mitm: u8, lesc: u8, keypress: u8) -> __BindgenBitfieldUnit<[u8; 1usize], u8> {
        let mut __bindgen_bitfield_unit: __BindgenBitfieldUnit<[u8; 1usize], u8> = Default::default();
        __bindgen_bitfield_unit.set(0usize, 1u8, {
            let bond: u8 = unsafe { ::core::mem::transmute(bond) };
            bond as u64
        });
        __bindgen_bitfield_unit.set(1usize, 1u8, {
            let mitm: u8 = unsafe { ::core::mem::transmute(mitm) };
            mitm as u64
        });
        __bindgen_bitfield_unit.set(2usize, 1u8, {
            let lesc: u8 = unsafe { ::core::mem::transmute(lesc) };
            lesc as u64
        });
        __bindgen_bitfield_unit.set(3usize, 1u8, {
            let keypress: u8 = unsafe { ::core::mem::transmute(keypress) };
            keypress as u64
        });
        __bindgen_bitfield_unit
    }
}
#[doc = "@brief Event structure for @ref BLE_GAP_EVT_CONN_PARAM_UPDATE_REQUEST."]
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct ble_gap_evt_conn_param_update_request_t {
    #[doc = "<  GAP Connection Parameters."]
    pub conn_params: ble_gap_conn_params_t,
}
#[test]
fn bindgen_test_layout_ble_gap_evt_conn_param_update_request_t() {
    assert_eq!(
        ::core::mem::size_of::<ble_gap_evt_conn_param_update_request_t>(),
        8usize,
        concat!("Size of: ", stringify!(ble_gap_evt_conn_param_update_request_t))
    );
    assert_eq!(
        ::core::mem::align_of::<ble_gap_evt_conn_param_update_request_t>(),
        2usize,
        concat!("Alignment of ", stringify!(ble_gap_evt_conn_param_update_request_t))
    );
    assert_eq!(
        unsafe {
            &(*(::core::ptr::null::<ble_gap_evt_conn_param_update_request_t>())).conn_params as *const _ as usize
        },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(ble_gap_evt_conn_param_update_request_t),
            "::",
            stringify!(conn_params)
        )
    );
}
#[doc = "@brief Event structure for @ref BLE_GAP_EVT_SCAN_REQ_REPORT."]
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct ble_gap_evt_scan_req_report_t {
    #[doc = "< Advertising handle for the advertising set which received the Scan Request"]
    pub adv_handle: u8,
    #[doc = "< Received Signal Strength Indication in dBm."]
    #[doc = "@note ERRATA-153 requires the rssi sample to be compensated based on a temperature measurement."]
    pub rssi: i8,
    #[doc = "< Bluetooth address of the peer device. If the peer_addr resolved: @ref ble_gap_addr_t::addr_id_peer is set to 1"]
    #[doc = "and the address is the device's identity address."]
    pub peer_addr: ble_gap_addr_t,
}
#[test]
fn bindgen_test_layout_ble_gap_evt_scan_req_report_t() {
    assert_eq!(
        ::core::mem::size_of::<ble_gap_evt_scan_req_report_t>(),
        9usize,
        concat!("Size of: ", stringify!(ble_gap_evt_scan_req_report_t))
    );
    assert_eq!(
        ::core::mem::align_of::<ble_gap_evt_scan_req_report_t>(),
        1usize,
        concat!("Alignment of ", stringify!(ble_gap_evt_scan_req_report_t))
    );
    assert_eq!(
        unsafe { &(*(::core::ptr::null::<ble_gap_evt_scan_req_report_t>())).adv_handle as *const _ as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(ble_gap_evt_scan_req_report_t),
            "::",
            stringify!(adv_handle)
        )
    );
    assert_eq!(
        unsafe { &(*(::core::ptr::null::<ble_gap_evt_scan_req_report_t>())).rssi as *const _ as usize },
        1usize,
        concat!(
            "Offset of field: ",
            stringify!(ble_gap_evt_scan_req_report_t),
            "::",
            stringify!(rssi)
        )
    );
    assert_eq!(
        unsafe { &(*(::core::ptr::null::<ble_gap_evt_scan_req_report_t>())).peer_addr as *const _ as usize },
        2usize,
        concat!(
            "Offset of field: ",
            stringify!(ble_gap_evt_scan_req_report_t),
            "::",
            stringify!(peer_addr)
        )
    );
}
#[doc = "@brief Event structure for @ref BLE_GAP_EVT_DATA_LENGTH_UPDATE_REQUEST."]
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct ble_gap_evt_data_length_update_request_t {
    #[doc = "< Peer data length parameters."]
    pub peer_params: ble_gap_data_length_params_t,
}
#[test]
fn bindgen_test_layout_ble_gap_evt_data_length_update_request_t() {
    assert_eq!(
        ::core::mem::size_of::<ble_gap_evt_data_length_update_request_t>(),
        8usize,
        concat!("Size of: ", stringify!(ble_gap_evt_data_length_update_request_t))
    );
    assert_eq!(
        ::core::mem::align_of::<ble_gap_evt_data_length_update_request_t>(),
        2usize,
        concat!("Alignment of ", stringify!(ble_gap_evt_data_length_update_request_t))
    );
    assert_eq!(
        unsafe {
            &(*(::core::ptr::null::<ble_gap_evt_data_length_update_request_t>())).peer_params as *const _ as usize
        },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(ble_gap_evt_data_length_update_request_t),
            "::",
            stringify!(peer_params)
        )
    );
}
#[doc = "@brief Event structure for @ref BLE_GAP_EVT_DATA_LENGTH_UPDATE."]
#[doc = ""]
#[doc = " @note This event may also be raised after a PHY Update procedure."]
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct ble_gap_evt_data_length_update_t {
    #[doc = "< The effective data length parameters."]
    pub effective_params: ble_gap_data_length_params_t,
}
#[test]
fn bindgen_test_layout_ble_gap_evt_data_length_update_t() {
    assert_eq!(
        ::core::mem::size_of::<ble_gap_evt_data_length_update_t>(),
        8usize,
        concat!("Size of: ", stringify!(ble_gap_evt_data_length_update_t))
    );
    assert_eq!(
        ::core::mem::align_of::<ble_gap_evt_data_length_update_t>(),
        2usize,
        concat!("Alignment of ", stringify!(ble_gap_evt_data_length_update_t))
    );
    assert_eq!(
        unsafe { &(*(::core::ptr::null::<ble_gap_evt_data_length_update_t>())).effective_params as *const _ as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(ble_gap_evt_data_length_update_t),
            "::",
            stringify!(effective_params)
        )
    );
}
#[doc = "@brief Event structure for @ref BLE_GAP_EVT_QOS_CHANNEL_SURVEY_REPORT."]
#[repr(C)]
#[derive(Copy, Clone)]
pub struct ble_gap_evt_qos_channel_survey_report_t {
    #[doc = "< The measured energy on the Bluetooth Low Energy"]
    #[doc = "channels, in dBm, indexed by Channel Index."]
    #[doc = "If no measurement is available for the given channel, channel_energy is set to"]
    #[doc = "@ref BLE_GAP_POWER_LEVEL_INVALID."]
    pub channel_energy: [i8; 40usize],
}
#[test]
fn bindgen_test_layout_ble_gap_evt_qos_channel_survey_report_t() {
    assert_eq!(
        ::core::mem::size_of::<ble_gap_evt_qos_channel_survey_report_t>(),
        40usize,
        concat!("Size of: ", stringify!(ble_gap_evt_qos_channel_survey_report_t))
    );
    assert_eq!(
        ::core::mem::align_of::<ble_gap_evt_qos_channel_survey_report_t>(),
        1usize,
        concat!("Alignment of ", stringify!(ble_gap_evt_qos_channel_survey_report_t))
    );
    assert_eq!(
        unsafe {
            &(*(::core::ptr::null::<ble_gap_evt_qos_channel_survey_report_t>())).channel_energy as *const _ as usize
        },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(ble_gap_evt_qos_channel_survey_report_t),
            "::",
            stringify!(channel_energy)
        )
    );
}
#[doc = "@brief GAP event structure."]
#[repr(C)]
#[derive(Copy, Clone)]
pub struct ble_gap_evt_t {
    #[doc = "< Connection Handle on which event occurred."]
    pub conn_handle: u16,
    #[doc = "< Event Parameters."]
    pub params: ble_gap_evt_t__bindgen_ty_1,
}
#[repr(C)]
#[derive(Copy, Clone)]
pub union ble_gap_evt_t__bindgen_ty_1 {
    #[doc = "< Connected Event Parameters."]
    pub connected: ble_gap_evt_connected_t,
    #[doc = "< Disconnected Event Parameters."]
    pub disconnected: ble_gap_evt_disconnected_t,
    #[doc = "< Connection Parameter Update Parameters."]
    pub conn_param_update: ble_gap_evt_conn_param_update_t,
    #[doc = "< Security Parameters Request Event Parameters."]
    pub sec_params_request: ble_gap_evt_sec_params_request_t,
    #[doc = "< Security Information Request Event Parameters."]
    pub sec_info_request: ble_gap_evt_sec_info_request_t,
    #[doc = "< Passkey Display Event Parameters."]
    pub passkey_display: ble_gap_evt_passkey_display_t,
    #[doc = "< Key Pressed Event Parameters."]
    pub key_pressed: ble_gap_evt_key_pressed_t,
    #[doc = "< Authentication Key Request Event Parameters."]
    pub auth_key_request: ble_gap_evt_auth_key_request_t,
    #[doc = "< LE Secure Connections DHKey calculation request."]
    pub lesc_dhkey_request: ble_gap_evt_lesc_dhkey_request_t,
    #[doc = "< Authentication Status Event Parameters."]
    pub auth_status: ble_gap_evt_auth_status_t,
    #[doc = "< Connection Security Update Event Parameters."]
    pub conn_sec_update: ble_gap_evt_conn_sec_update_t,
    #[doc = "< Timeout Event Parameters."]
    pub timeout: ble_gap_evt_timeout_t,
    #[doc = "< RSSI Event Parameters."]
    pub rssi_changed: ble_gap_evt_rssi_changed_t,
    #[doc = "< Advertising Report Event Parameters."]
    pub adv_report: ble_gap_evt_adv_report_t,
    #[doc = "< Advertising Set Terminated Event Parameters."]
    pub adv_set_terminated: ble_gap_evt_adv_set_terminated_t,
    #[doc = "< Security Request Event Parameters."]
    pub sec_request: ble_gap_evt_sec_request_t,
    #[doc = "< Connection Parameter Update Parameters."]
    pub conn_param_update_request: ble_gap_evt_conn_param_update_request_t,
    #[doc = "< Scan Request Report Parameters."]
    pub scan_req_report: ble_gap_evt_scan_req_report_t,
    #[doc = "< PHY Update Request Event Parameters."]
    pub phy_update_request: ble_gap_evt_phy_update_request_t,
    #[doc = "< PHY Update Parameters."]
    pub phy_update: ble_gap_evt_phy_update_t,
    #[doc = "< Data Length Update Request Event Parameters."]
    pub data_length_update_request: ble_gap_evt_data_length_update_request_t,
    #[doc = "< Data Length Update Event Parameters."]
    pub data_length_update: ble_gap_evt_data_length_update_t,
    #[doc = "< Quality of Service (QoS) Channel Survey Report Parameters."]
    pub qos_channel_survey_report: ble_gap_evt_qos_channel_survey_report_t,
    _bindgen_union_align: [u32; 10usize],
}
#[test]
fn bindgen_test_layout_ble_gap_evt_t__bindgen_ty_1() {
    assert_eq!(
        ::core::mem::size_of::<ble_gap_evt_t__bindgen_ty_1>(),
        40usize,
        concat!("Size of: ", stringify!(ble_gap_evt_t__bindgen_ty_1))
    );
    assert_eq!(
        ::core::mem::align_of::<ble_gap_evt_t__bindgen_ty_1>(),
        4usize,
        concat!("Alignment of ", stringify!(ble_gap_evt_t__bindgen_ty_1))
    );
    assert_eq!(
        unsafe { &(*(::core::ptr::null::<ble_gap_evt_t__bindgen_ty_1>())).connected as *const _ as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(ble_gap_evt_t__bindgen_ty_1),
            "::",
            stringify!(connected)
        )
    );
    assert_eq!(
        unsafe { &(*(::core::ptr::null::<ble_gap_evt_t__bindgen_ty_1>())).disconnected as *const _ as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(ble_gap_evt_t__bindgen_ty_1),
            "::",
            stringify!(disconnected)
        )
    );
    assert_eq!(
        unsafe { &(*(::core::ptr::null::<ble_gap_evt_t__bindgen_ty_1>())).conn_param_update as *const _ as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(ble_gap_evt_t__bindgen_ty_1),
            "::",
            stringify!(conn_param_update)
        )
    );
    assert_eq!(
        unsafe { &(*(::core::ptr::null::<ble_gap_evt_t__bindgen_ty_1>())).sec_params_request as *const _ as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(ble_gap_evt_t__bindgen_ty_1),
            "::",
            stringify!(sec_params_request)
        )
    );
    assert_eq!(
        unsafe { &(*(::core::ptr::null::<ble_gap_evt_t__bindgen_ty_1>())).sec_info_request as *const _ as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(ble_gap_evt_t__bindgen_ty_1),
            "::",
            stringify!(sec_info_request)
        )
    );
    assert_eq!(
        unsafe { &(*(::core::ptr::null::<ble_gap_evt_t__bindgen_ty_1>())).passkey_display as *const _ as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(ble_gap_evt_t__bindgen_ty_1),
            "::",
            stringify!(passkey_display)
        )
    );
    assert_eq!(
        unsafe { &(*(::core::ptr::null::<ble_gap_evt_t__bindgen_ty_1>())).key_pressed as *const _ as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(ble_gap_evt_t__bindgen_ty_1),
            "::",
            stringify!(key_pressed)
        )
    );
    assert_eq!(
        unsafe { &(*(::core::ptr::null::<ble_gap_evt_t__bindgen_ty_1>())).auth_key_request as *const _ as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(ble_gap_evt_t__bindgen_ty_1),
            "::",
            stringify!(auth_key_request)
        )
    );
    assert_eq!(
        unsafe { &(*(::core::ptr::null::<ble_gap_evt_t__bindgen_ty_1>())).lesc_dhkey_request as *const _ as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(ble_gap_evt_t__bindgen_ty_1),
            "::",
            stringify!(lesc_dhkey_request)
        )
    );
    assert_eq!(
        unsafe { &(*(::core::ptr::null::<ble_gap_evt_t__bindgen_ty_1>())).auth_status as *const _ as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(ble_gap_evt_t__bindgen_ty_1),
            "::",
            stringify!(auth_status)
        )
    );
    assert_eq!(
        unsafe { &(*(::core::ptr::null::<ble_gap_evt_t__bindgen_ty_1>())).conn_sec_update as *const _ as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(ble_gap_evt_t__bindgen_ty_1),
            "::",
            stringify!(conn_sec_update)
        )
    );
    assert_eq!(
        unsafe { &(*(::core::ptr::null::<ble_gap_evt_t__bindgen_ty_1>())).timeout as *const _ as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(ble_gap_evt_t__bindgen_ty_1),
            "::",
            stringify!(timeout)
        )
    );
    assert_eq!(
        unsafe { &(*(::core::ptr::null::<ble_gap_evt_t__bindgen_ty_1>())).rssi_changed as *const _ as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(ble_gap_evt_t__bindgen_ty_1),
            "::",
            stringify!(rssi_changed)
        )
    );
    assert_eq!(
        unsafe { &(*(::core::ptr::null::<ble_gap_evt_t__bindgen_ty_1>())).adv_report as *const _ as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(ble_gap_evt_t__bindgen_ty_1),
            "::",
            stringify!(adv_report)
        )
    );
    assert_eq!(
        unsafe { &(*(::core::ptr::null::<ble_gap_evt_t__bindgen_ty_1>())).adv_set_terminated as *const _ as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(ble_gap_evt_t__bindgen_ty_1),
            "::",
            stringify!(adv_set_terminated)
        )
    );
    assert_eq!(
        unsafe { &(*(::core::ptr::null::<ble_gap_evt_t__bindgen_ty_1>())).sec_request as *const _ as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(ble_gap_evt_t__bindgen_ty_1),
            "::",
            stringify!(sec_request)
        )
    );
    assert_eq!(
        unsafe {
            &(*(::core::ptr::null::<ble_gap_evt_t__bindgen_ty_1>())).conn_param_update_request as *const _ as usize
        },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(ble_gap_evt_t__bindgen_ty_1),
            "::",
            stringify!(conn_param_update_request)
        )
    );
    assert_eq!(
        unsafe { &(*(::core::ptr::null::<ble_gap_evt_t__bindgen_ty_1>())).scan_req_report as *const _ as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(ble_gap_evt_t__bindgen_ty_1),
            "::",
            stringify!(scan_req_report)
        )
    );
    assert_eq!(
        unsafe { &(*(::core::ptr::null::<ble_gap_evt_t__bindgen_ty_1>())).phy_update_request as *const _ as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(ble_gap_evt_t__bindgen_ty_1),
            "::",
            stringify!(phy_update_request)
        )
    );
    assert_eq!(
        unsafe { &(*(::core::ptr::null::<ble_gap_evt_t__bindgen_ty_1>())).phy_update as *const _ as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(ble_gap_evt_t__bindgen_ty_1),
            "::",
            stringify!(phy_update)
        )
    );
    assert_eq!(
        unsafe {
            &(*(::core::ptr::null::<ble_gap_evt_t__bindgen_ty_1>())).data_length_update_request as *const _ as usize
        },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(ble_gap_evt_t__bindgen_ty_1),
            "::",
            stringify!(data_length_update_request)
        )
    );
    assert_eq!(
        unsafe { &(*(::core::ptr::null::<ble_gap_evt_t__bindgen_ty_1>())).data_length_update as *const _ as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(ble_gap_evt_t__bindgen_ty_1),
            "::",
            stringify!(data_length_update)
        )
    );
    assert_eq!(
        unsafe {
            &(*(::core::ptr::null::<ble_gap_evt_t__bindgen_ty_1>())).qos_channel_survey_report as *const _ as usize
        },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(ble_gap_evt_t__bindgen_ty_1),
            "::",
            stringify!(qos_channel_survey_report)
        )
    );
}
#[test]
fn bindgen_test_layout_ble_gap_evt_t() {
    assert_eq!(
        ::core::mem::size_of::<ble_gap_evt_t>(),
        44usize,
        concat!("Size of: ", stringify!(ble_gap_evt_t))
    );
    assert_eq!(
        ::core::mem::align_of::<ble_gap_evt_t>(),
        4usize,
        concat!("Alignment of ", stringify!(ble_gap_evt_t))
    );
    assert_eq!(
        unsafe { &(*(::core::ptr::null::<ble_gap_evt_t>())).conn_handle as *const _ as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(ble_gap_evt_t),
            "::",
            stringify!(conn_handle)
        )
    );
    assert_eq!(
        unsafe { &(*(::core::ptr::null::<ble_gap_evt_t>())).params as *const _ as usize },
        4usize,
        concat!("Offset of field: ", stringify!(ble_gap_evt_t), "::", stringify!(params))
    );
}
#[doc = " @brief BLE GAP connection configuration parameters, set with @ref sd_ble_cfg_set."]
#[doc = ""]
#[doc = " @retval ::NRF_ERROR_CONN_COUNT     The connection count for the connection configurations is zero."]
#[doc = " @retval ::NRF_ERROR_INVALID_PARAM  One or more of the following is true:"]
#[doc = "                                    - The sum of conn_count for all connection configurations combined exceeds UINT8_MAX."]
#[doc = "                                    - The event length is smaller than @ref BLE_GAP_EVENT_LENGTH_MIN."]
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct ble_gap_conn_cfg_t {
    #[doc = "< The number of concurrent connections the application can create with this configuration."]
    #[doc = "The default and minimum value is @ref BLE_GAP_CONN_COUNT_DEFAULT."]
    pub conn_count: u8,
    #[doc = "< The time set aside for this connection on every connection interval in 1.25 ms units."]
    #[doc = "The default value is @ref BLE_GAP_EVENT_LENGTH_DEFAULT, the minimum value is @ref BLE_GAP_EVENT_LENGTH_MIN."]
    #[doc = "The event length and the connection interval are the primary parameters"]
    #[doc = "for setting the throughput of a connection."]
    #[doc = "See the SoftDevice Specification for details on throughput."]
    pub event_length: u16,
}
#[test]
fn bindgen_test_layout_ble_gap_conn_cfg_t() {
    assert_eq!(
        ::core::mem::size_of::<ble_gap_conn_cfg_t>(),
        4usize,
        concat!("Size of: ", stringify!(ble_gap_conn_cfg_t))
    );
    assert_eq!(
        ::core::mem::align_of::<ble_gap_conn_cfg_t>(),
        2usize,
        concat!("Alignment of ", stringify!(ble_gap_conn_cfg_t))
    );
    assert_eq!(
        unsafe { &(*(::core::ptr::null::<ble_gap_conn_cfg_t>())).conn_count as *const _ as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(ble_gap_conn_cfg_t),
            "::",
            stringify!(conn_count)
        )
    );
    assert_eq!(
        unsafe { &(*(::core::ptr::null::<ble_gap_conn_cfg_t>())).event_length as *const _ as usize },
        2usize,
        concat!(
            "Offset of field: ",
            stringify!(ble_gap_conn_cfg_t),
            "::",
            stringify!(event_length)
        )
    );
}
#[doc = " @brief Configuration of maximum concurrent connections in the different connected roles, set with"]
#[doc = " @ref sd_ble_cfg_set."]
#[doc = ""]
#[doc = " @retval ::NRF_ERROR_CONN_COUNT     The sum of periph_role_count and central_role_count is too"]
#[doc = "                                    large. The maximum supported sum of concurrent connections is"]
#[doc = "                                    @ref BLE_GAP_ROLE_COUNT_COMBINED_MAX."]
#[doc = " @retval ::NRF_ERROR_INVALID_PARAM  central_sec_count is larger than central_role_count."]
#[doc = " @retval ::NRF_ERROR_RESOURCES      The adv_set_count is too large. The maximum"]
#[doc = "                                    supported advertising handles is"]
#[doc = "                                    @ref BLE_GAP_ADV_SET_COUNT_MAX."]
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct ble_gap_cfg_role_count_t {
    #[doc = "< Maximum number of advertising sets. Default value is @ref BLE_GAP_ADV_SET_COUNT_DEFAULT."]
    pub adv_set_count: u8,
    #[doc = "< Maximum number of connections concurrently acting as a peripheral. Default value is @ref BLE_GAP_ROLE_COUNT_PERIPH_DEFAULT."]
    pub periph_role_count: u8,
    #[doc = "< Maximum number of connections concurrently acting as a central. Default value is @ref BLE_GAP_ROLE_COUNT_CENTRAL_DEFAULT."]
    pub central_role_count: u8,
    #[doc = "< Number of SMP instances shared between all connections acting as a central. Default value is @ref BLE_GAP_ROLE_COUNT_CENTRAL_SEC_DEFAULT."]
    pub central_sec_count: u8,
    pub _bitfield_1: __BindgenBitfieldUnit<[u8; 1usize], u8>,
}
#[test]
fn bindgen_test_layout_ble_gap_cfg_role_count_t() {
    assert_eq!(
        ::core::mem::size_of::<ble_gap_cfg_role_count_t>(),
        5usize,
        concat!("Size of: ", stringify!(ble_gap_cfg_role_count_t))
    );
    assert_eq!(
        ::core::mem::align_of::<ble_gap_cfg_role_count_t>(),
        1usize,
        concat!("Alignment of ", stringify!(ble_gap_cfg_role_count_t))
    );
    assert_eq!(
        unsafe { &(*(::core::ptr::null::<ble_gap_cfg_role_count_t>())).adv_set_count as *const _ as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(ble_gap_cfg_role_count_t),
            "::",
            stringify!(adv_set_count)
        )
    );
    assert_eq!(
        unsafe { &(*(::core::ptr::null::<ble_gap_cfg_role_count_t>())).periph_role_count as *const _ as usize },
        1usize,
        concat!(
            "Offset of field: ",
            stringify!(ble_gap_cfg_role_count_t),
            "::",
            stringify!(periph_role_count)
        )
    );
    assert_eq!(
        unsafe { &(*(::core::ptr::null::<ble_gap_cfg_role_count_t>())).central_role_count as *const _ as usize },
        2usize,
        concat!(
            "Offset of field: ",
            stringify!(ble_gap_cfg_role_count_t),
            "::",
            stringify!(central_role_count)
        )
    );
    assert_eq!(
        unsafe { &(*(::core::ptr::null::<ble_gap_cfg_role_count_t>())).central_sec_count as *const _ as usize },
        3usize,
        concat!(
            "Offset of field: ",
            stringify!(ble_gap_cfg_role_count_t),
            "::",
            stringify!(central_sec_count)
        )
    );
}
impl ble_gap_cfg_role_count_t {
    #[inline]
    pub fn qos_channel_survey_role_available(&self) -> u8 {
        unsafe { ::core::mem::transmute(self._bitfield_1.get(0usize, 1u8) as u8) }
    }
    #[inline]
    pub fn set_qos_channel_survey_role_available(&mut self, val: u8) {
        unsafe {
            let val: u8 = ::core::mem::transmute(val);
            self._bitfield_1.set(0usize, 1u8, val as u64)
        }
    }
    #[inline]
    pub fn new_bitfield_1(qos_channel_survey_role_available: u8) -> __BindgenBitfieldUnit<[u8; 1usize], u8> {
        let mut __bindgen_bitfield_unit: __BindgenBitfieldUnit<[u8; 1usize], u8> = Default::default();
        __bindgen_bitfield_unit.set(0usize, 1u8, {
            let qos_channel_survey_role_available: u8 =
                unsafe { ::core::mem::transmute(qos_channel_survey_role_available) };
            qos_channel_survey_role_available as u64
        });
        __bindgen_bitfield_unit
    }
}
#[doc = " @brief Device name and its properties, set with @ref sd_ble_cfg_set."]
#[doc = ""]
#[doc = " @note  If the device name is not configured, the default device name will be"]
#[doc = "        @ref BLE_GAP_DEVNAME_DEFAULT, the maximum device name length will be"]
#[doc = "        @ref BLE_GAP_DEVNAME_DEFAULT_LEN, vloc will be set to @ref BLE_GATTS_VLOC_STACK and the device name"]
#[doc = "        will have no write access."]
#[doc = ""]
#[doc = " @note  If @ref max_len is more than @ref BLE_GAP_DEVNAME_DEFAULT_LEN and vloc is set to @ref BLE_GATTS_VLOC_STACK,"]
#[doc = "        the attribute table size must be increased to have room for the longer device name (see"]
#[doc = "        @ref sd_ble_cfg_set and @ref ble_gatts_cfg_attr_tab_size_t)."]
#[doc = ""]
#[doc = " @note  If vloc is @ref BLE_GATTS_VLOC_STACK :"]
#[doc = "        - p_value must point to non-volatile memory (flash) or be NULL."]
#[doc = "        - If p_value is NULL, the device name will initially be empty."]
#[doc = ""]
#[doc = " @note  If vloc is @ref BLE_GATTS_VLOC_USER :"]
#[doc = "        - p_value cannot be NULL."]
#[doc = "        - If the device name is writable, p_value must point to volatile memory (RAM)."]
#[doc = ""]
#[doc = " @retval ::NRF_ERROR_INVALID_PARAM  One or more of the following is true:"]
#[doc = "                                    - Invalid device name location (vloc)."]
#[doc = "                                    - Invalid device name security mode."]
#[doc = " @retval ::NRF_ERROR_INVALID_LENGTH One or more of the following is true:"]
#[doc = "                                    - The device name length is invalid (must be between 0 and @ref BLE_GAP_DEVNAME_MAX_LEN)."]
#[doc = "                                    - The device name length is too long for the given Attribute Table."]
#[doc = " @retval ::NRF_ERROR_NOT_SUPPORTED  Device name security mode is not supported."]
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct ble_gap_cfg_device_name_t {
    #[doc = "< Write permissions."]
    pub write_perm: ble_gap_conn_sec_mode_t,
    pub _bitfield_1: __BindgenBitfieldUnit<[u8; 1usize], u8>,
    #[doc = "< Pointer to where the value (device name) is stored or will be stored."]
    pub p_value: *mut u8,
    #[doc = "< Current length in bytes of the memory pointed to by p_value."]
    pub current_len: u16,
    #[doc = "< Maximum length in bytes of the memory pointed to by p_value."]
    pub max_len: u16,
}
#[test]
fn bindgen_test_layout_ble_gap_cfg_device_name_t() {
    assert_eq!(
        ::core::mem::size_of::<ble_gap_cfg_device_name_t>(),
        12usize,
        concat!("Size of: ", stringify!(ble_gap_cfg_device_name_t))
    );
    assert_eq!(
        ::core::mem::align_of::<ble_gap_cfg_device_name_t>(),
        4usize,
        concat!("Alignment of ", stringify!(ble_gap_cfg_device_name_t))
    );
    assert_eq!(
        unsafe { &(*(::core::ptr::null::<ble_gap_cfg_device_name_t>())).write_perm as *const _ as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(ble_gap_cfg_device_name_t),
            "::",
            stringify!(write_perm)
        )
    );
    assert_eq!(
        unsafe { &(*(::core::ptr::null::<ble_gap_cfg_device_name_t>())).p_value as *const _ as usize },
        4usize,
        concat!(
            "Offset of field: ",
            stringify!(ble_gap_cfg_device_name_t),
            "::",
            stringify!(p_value)
        )
    );
    assert_eq!(
        unsafe { &(*(::core::ptr::null::<ble_gap_cfg_device_name_t>())).current_len as *const _ as usize },
        8usize,
        concat!(
            "Offset of field: ",
            stringify!(ble_gap_cfg_device_name_t),
            "::",
            stringify!(current_len)
        )
    );
    assert_eq!(
        unsafe { &(*(::core::ptr::null::<ble_gap_cfg_device_name_t>())).max_len as *const _ as usize },
        10usize,
        concat!(
            "Offset of field: ",
            stringify!(ble_gap_cfg_device_name_t),
            "::",
            stringify!(max_len)
        )
    );
}
impl ble_gap_cfg_device_name_t {
    #[inline]
    pub fn vloc(&self) -> u8 {
        unsafe { ::core::mem::transmute(self._bitfield_1.get(0usize, 2u8) as u8) }
    }
    #[inline]
    pub fn set_vloc(&mut self, val: u8) {
        unsafe {
            let val: u8 = ::core::mem::transmute(val);
            self._bitfield_1.set(0usize, 2u8, val as u64)
        }
    }
    #[inline]
    pub fn new_bitfield_1(vloc: u8) -> __BindgenBitfieldUnit<[u8; 1usize], u8> {
        let mut __bindgen_bitfield_unit: __BindgenBitfieldUnit<[u8; 1usize], u8> = Default::default();
        __bindgen_bitfield_unit.set(0usize, 2u8, {
            let vloc: u8 = unsafe { ::core::mem::transmute(vloc) };
            vloc as u64
        });
        __bindgen_bitfield_unit
    }
}
#[doc = "@brief Peripheral Preferred Connection Parameters include configuration parameters, set with @ref sd_ble_cfg_set."]
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct ble_gap_cfg_ppcp_incl_cfg_t {
    #[doc = "< Inclusion configuration of the Peripheral Preferred Connection Parameters characteristic."]
    #[doc = "See @ref BLE_GAP_CHAR_INCL_CONFIG. Default is @ref BLE_GAP_PPCP_INCL_CONFIG_DEFAULT."]
    pub include_cfg: u8,
}
#[test]
fn bindgen_test_layout_ble_gap_cfg_ppcp_incl_cfg_t() {
    assert_eq!(
        ::core::mem::size_of::<ble_gap_cfg_ppcp_incl_cfg_t>(),
        1usize,
        concat!("Size of: ", stringify!(ble_gap_cfg_ppcp_incl_cfg_t))
    );
    assert_eq!(
        ::core::mem::align_of::<ble_gap_cfg_ppcp_incl_cfg_t>(),
        1usize,
        concat!("Alignment of ", stringify!(ble_gap_cfg_ppcp_incl_cfg_t))
    );
    assert_eq!(
        unsafe { &(*(::core::ptr::null::<ble_gap_cfg_ppcp_incl_cfg_t>())).include_cfg as *const _ as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(ble_gap_cfg_ppcp_incl_cfg_t),
            "::",
            stringify!(include_cfg)
        )
    );
}
#[doc = "@brief Central Address Resolution include configuration parameters, set with @ref sd_ble_cfg_set."]
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct ble_gap_cfg_car_incl_cfg_t {
    #[doc = "< Inclusion configuration of the Central Address Resolution characteristic."]
    #[doc = "See @ref BLE_GAP_CHAR_INCL_CONFIG. Default is @ref BLE_GAP_CAR_INCL_CONFIG_DEFAULT."]
    pub include_cfg: u8,
}
#[test]
fn bindgen_test_layout_ble_gap_cfg_car_incl_cfg_t() {
    assert_eq!(
        ::core::mem::size_of::<ble_gap_cfg_car_incl_cfg_t>(),
        1usize,
        concat!("Size of: ", stringify!(ble_gap_cfg_car_incl_cfg_t))
    );
    assert_eq!(
        ::core::mem::align_of::<ble_gap_cfg_car_incl_cfg_t>(),
        1usize,
        concat!("Alignment of ", stringify!(ble_gap_cfg_car_incl_cfg_t))
    );
    assert_eq!(
        unsafe { &(*(::core::ptr::null::<ble_gap_cfg_car_incl_cfg_t>())).include_cfg as *const _ as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(ble_gap_cfg_car_incl_cfg_t),
            "::",
            stringify!(include_cfg)
        )
    );
}
#[doc = "@brief Configuration structure for GAP configurations."]
#[repr(C)]
#[derive(Copy, Clone)]
pub union ble_gap_cfg_t {
    #[doc = "< Role count configuration, cfg_id is @ref BLE_GAP_CFG_ROLE_COUNT."]
    pub role_count_cfg: ble_gap_cfg_role_count_t,
    #[doc = "< Device name configuration, cfg_id is @ref BLE_GAP_CFG_DEVICE_NAME."]
    pub device_name_cfg: ble_gap_cfg_device_name_t,
    #[doc = "< Peripheral Preferred Connection Parameters characteristic include"]
    #[doc = "configuration, cfg_id is @ref BLE_GAP_CFG_PPCP_INCL_CONFIG."]
    pub ppcp_include_cfg: ble_gap_cfg_ppcp_incl_cfg_t,
    #[doc = "< Central Address Resolution characteristic include configuration,"]
    #[doc = "cfg_id is @ref BLE_GAP_CFG_CAR_INCL_CONFIG."]
    pub car_include_cfg: ble_gap_cfg_car_incl_cfg_t,
    _bindgen_union_align: [u32; 3usize],
}
#[test]
fn bindgen_test_layout_ble_gap_cfg_t() {
    assert_eq!(
        ::core::mem::size_of::<ble_gap_cfg_t>(),
        12usize,
        concat!("Size of: ", stringify!(ble_gap_cfg_t))
    );
    assert_eq!(
        ::core::mem::align_of::<ble_gap_cfg_t>(),
        4usize,
        concat!("Alignment of ", stringify!(ble_gap_cfg_t))
    );
    assert_eq!(
        unsafe { &(*(::core::ptr::null::<ble_gap_cfg_t>())).role_count_cfg as *const _ as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(ble_gap_cfg_t),
            "::",
            stringify!(role_count_cfg)
        )
    );
    assert_eq!(
        unsafe { &(*(::core::ptr::null::<ble_gap_cfg_t>())).device_name_cfg as *const _ as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(ble_gap_cfg_t),
            "::",
            stringify!(device_name_cfg)
        )
    );
    assert_eq!(
        unsafe { &(*(::core::ptr::null::<ble_gap_cfg_t>())).ppcp_include_cfg as *const _ as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(ble_gap_cfg_t),
            "::",
            stringify!(ppcp_include_cfg)
        )
    );
    assert_eq!(
        unsafe { &(*(::core::ptr::null::<ble_gap_cfg_t>())).car_include_cfg as *const _ as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(ble_gap_cfg_t),
            "::",
            stringify!(car_include_cfg)
        )
    );
}
#[doc = "@brief Channel Map option."]
#[doc = ""]
#[doc = " @details Used with @ref sd_ble_opt_get to get the current channel map"]
#[doc = "          or @ref sd_ble_opt_set to set a new channel map. When setting the"]
#[doc = "          channel map, it applies to all current and future connections. When getting the"]
#[doc = "          current channel map, it applies to a single connection and the connection handle"]
#[doc = "          must be supplied."]
#[doc = ""]
#[doc = " @note Setting the channel map may take some time, depending on connection parameters."]
#[doc = "       The time taken may be different for each connection and the get operation will"]
#[doc = "       return the previous channel map until the new one has taken effect."]
#[doc = ""]
#[doc = " @note After setting the channel map, by spec it can not be set again until at least 1 s has passed."]
#[doc = "       See Bluetooth Specification Version 4.1 Volume 2, Part E, Section 7.3.46."]
#[doc = ""]
#[doc = " @retval ::NRF_SUCCESS Get or set successful."]
#[doc = " @retval ::NRF_ERROR_INVALID_PARAM One or more of the following is true:"]
#[doc = "                                   - Less then two bits in @ref ch_map are set."]
#[doc = "                                   - Bits for primary advertising channels (37-39) are set."]
#[doc = " @retval ::NRF_ERROR_BUSY Channel map was set again before enough time had passed."]
#[doc = " @retval ::BLE_ERROR_INVALID_CONN_HANDLE Invalid connection handle supplied for get."]
#[doc = ""]
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct ble_gap_opt_ch_map_t {
    #[doc = "< Connection Handle (only applicable for get)"]
    pub conn_handle: u16,
    #[doc = "< Channel Map (37-bit)."]
    pub ch_map: [u8; 5usize],
}
#[test]
fn bindgen_test_layout_ble_gap_opt_ch_map_t() {
    assert_eq!(
        ::core::mem::size_of::<ble_gap_opt_ch_map_t>(),
        8usize,
        concat!("Size of: ", stringify!(ble_gap_opt_ch_map_t))
    );
    assert_eq!(
        ::core::mem::align_of::<ble_gap_opt_ch_map_t>(),
        2usize,
        concat!("Alignment of ", stringify!(ble_gap_opt_ch_map_t))
    );
    assert_eq!(
        unsafe { &(*(::core::ptr::null::<ble_gap_opt_ch_map_t>())).conn_handle as *const _ as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(ble_gap_opt_ch_map_t),
            "::",
            stringify!(conn_handle)
        )
    );
    assert_eq!(
        unsafe { &(*(::core::ptr::null::<ble_gap_opt_ch_map_t>())).ch_map as *const _ as usize },
        2usize,
        concat!(
            "Offset of field: ",
            stringify!(ble_gap_opt_ch_map_t),
            "::",
            stringify!(ch_map)
        )
    );
}
#[doc = "@brief Local connection latency option."]
#[doc = ""]
#[doc = " @details Local connection latency is a feature which enables the slave to improve"]
#[doc = "          current consumption by ignoring the slave latency set by the peer. The"]
#[doc = "          local connection latency can only be set to a multiple of the slave latency,"]
#[doc = "          and cannot be longer than half of the supervision timeout."]
#[doc = ""]
#[doc = " @details Used with @ref sd_ble_opt_set to set the local connection latency. The"]
#[doc = "          @ref sd_ble_opt_get is not supported for this option, but the actual"]
#[doc = "          local connection latency (unless set to NULL) is set as a return parameter"]
#[doc = "          when setting the option."]
#[doc = ""]
#[doc = " @note The latency set will be truncated down to the closest slave latency event"]
#[doc = "       multiple, or the nearest multiple before half of the supervision timeout."]
#[doc = ""]
#[doc = " @note The local connection latency is disabled by default, and needs to be enabled for new"]
#[doc = "       connections and whenever the connection is updated."]
#[doc = ""]
#[doc = " @retval ::NRF_SUCCESS Set successfully."]
#[doc = " @retval ::NRF_ERROR_NOT_SUPPORTED Get is not supported."]
#[doc = " @retval ::BLE_ERROR_INVALID_CONN_HANDLE Invalid connection handle parameter."]
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct ble_gap_opt_local_conn_latency_t {
    #[doc = "< Connection Handle"]
    pub conn_handle: u16,
    #[doc = "< Requested local connection latency."]
    pub requested_latency: u16,
    #[doc = "< Pointer to storage for the actual local connection latency (can be set to NULL to skip return value)."]
    pub p_actual_latency: *mut u16,
}
#[test]
fn bindgen_test_layout_ble_gap_opt_local_conn_latency_t() {
    assert_eq!(
        ::core::mem::size_of::<ble_gap_opt_local_conn_latency_t>(),
        8usize,
        concat!("Size of: ", stringify!(ble_gap_opt_local_conn_latency_t))
    );
    assert_eq!(
        ::core::mem::align_of::<ble_gap_opt_local_conn_latency_t>(),
        4usize,
        concat!("Alignment of ", stringify!(ble_gap_opt_local_conn_latency_t))
    );
    assert_eq!(
        unsafe { &(*(::core::ptr::null::<ble_gap_opt_local_conn_latency_t>())).conn_handle as *const _ as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(ble_gap_opt_local_conn_latency_t),
            "::",
            stringify!(conn_handle)
        )
    );
    assert_eq!(
        unsafe { &(*(::core::ptr::null::<ble_gap_opt_local_conn_latency_t>())).requested_latency as *const _ as usize },
        2usize,
        concat!(
            "Offset of field: ",
            stringify!(ble_gap_opt_local_conn_latency_t),
            "::",
            stringify!(requested_latency)
        )
    );
    assert_eq!(
        unsafe { &(*(::core::ptr::null::<ble_gap_opt_local_conn_latency_t>())).p_actual_latency as *const _ as usize },
        4usize,
        concat!(
            "Offset of field: ",
            stringify!(ble_gap_opt_local_conn_latency_t),
            "::",
            stringify!(p_actual_latency)
        )
    );
}
#[doc = "@brief Disable slave latency"]
#[doc = ""]
#[doc = " @details Used with @ref sd_ble_opt_set to temporarily disable slave latency of a peripheral connection"]
#[doc = "          (see @ref ble_gap_conn_params_t::slave_latency). And to re-enable it again. When disabled, the"]
#[doc = "          peripheral will ignore the slave_latency set by the central."]
#[doc = ""]
#[doc = " @note  Shall only be called on peripheral links."]
#[doc = ""]
#[doc = " @retval ::NRF_SUCCESS Set successfully."]
#[doc = " @retval ::NRF_ERROR_NOT_SUPPORTED Get is not supported."]
#[doc = " @retval ::BLE_ERROR_INVALID_CONN_HANDLE Invalid connection handle parameter."]
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct ble_gap_opt_slave_latency_disable_t {
    #[doc = "< Connection Handle"]
    pub conn_handle: u16,
    pub _bitfield_1: __BindgenBitfieldUnit<[u8; 1usize], u8>,
    pub __bindgen_padding_0: u8,
}
#[test]
fn bindgen_test_layout_ble_gap_opt_slave_latency_disable_t() {
    assert_eq!(
        ::core::mem::size_of::<ble_gap_opt_slave_latency_disable_t>(),
        4usize,
        concat!("Size of: ", stringify!(ble_gap_opt_slave_latency_disable_t))
    );
    assert_eq!(
        ::core::mem::align_of::<ble_gap_opt_slave_latency_disable_t>(),
        2usize,
        concat!("Alignment of ", stringify!(ble_gap_opt_slave_latency_disable_t))
    );
    assert_eq!(
        unsafe { &(*(::core::ptr::null::<ble_gap_opt_slave_latency_disable_t>())).conn_handle as *const _ as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(ble_gap_opt_slave_latency_disable_t),
            "::",
            stringify!(conn_handle)
        )
    );
}
impl ble_gap_opt_slave_latency_disable_t {
    #[inline]
    pub fn disable(&self) -> u8 {
        unsafe { ::core::mem::transmute(self._bitfield_1.get(0usize, 1u8) as u8) }
    }
    #[inline]
    pub fn set_disable(&mut self, val: u8) {
        unsafe {
            let val: u8 = ::core::mem::transmute(val);
            self._bitfield_1.set(0usize, 1u8, val as u64)
        }
    }
    #[inline]
    pub fn new_bitfield_1(disable: u8) -> __BindgenBitfieldUnit<[u8; 1usize], u8> {
        let mut __bindgen_bitfield_unit: __BindgenBitfieldUnit<[u8; 1usize], u8> = Default::default();
        __bindgen_bitfield_unit.set(0usize, 1u8, {
            let disable: u8 = unsafe { ::core::mem::transmute(disable) };
            disable as u64
        });
        __bindgen_bitfield_unit
    }
}
#[doc = "@brief Passkey Option."]
#[doc = ""]
#[doc = " @mscs"]
#[doc = " @mmsc{@ref BLE_GAP_PERIPH_BONDING_STATIC_PK_MSC}"]
#[doc = " @endmscs"]
#[doc = ""]
#[doc = " @details Structure containing the passkey to be used during pairing. This can be used with @ref"]
#[doc = "          sd_ble_opt_set to make the SoftDevice use a preprogrammed passkey for authentication"]
#[doc = "          instead of generating a random one."]
#[doc = ""]
#[doc = " @note Repeated pairing attempts using the same preprogrammed passkey makes pairing vulnerable to MITM attacks."]
#[doc = ""]
#[doc = " @note @ref sd_ble_opt_get is not supported for this option."]
#[doc = ""]
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct ble_gap_opt_passkey_t {
    #[doc = "< Pointer to 6-digit ASCII string (digit 0..9 only, no NULL termination) passkey to be used during pairing. If this is NULL, the SoftDevice will generate a random passkey if required."]
    pub p_passkey: *const u8,
}
#[test]
fn bindgen_test_layout_ble_gap_opt_passkey_t() {
    assert_eq!(
        ::core::mem::size_of::<ble_gap_opt_passkey_t>(),
        4usize,
        concat!("Size of: ", stringify!(ble_gap_opt_passkey_t))
    );
    assert_eq!(
        ::core::mem::align_of::<ble_gap_opt_passkey_t>(),
        4usize,
        concat!("Alignment of ", stringify!(ble_gap_opt_passkey_t))
    );
    assert_eq!(
        unsafe { &(*(::core::ptr::null::<ble_gap_opt_passkey_t>())).p_passkey as *const _ as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(ble_gap_opt_passkey_t),
            "::",
            stringify!(p_passkey)
        )
    );
}
#[doc = "@brief Compatibility mode 1 option."]
#[doc = ""]
#[doc = " @details This can be used with @ref sd_ble_opt_set to enable and disable"]
#[doc = "          compatibility mode 1. Compatibility mode 1 is disabled by default."]
#[doc = ""]
#[doc = " @note Compatibility mode 1 enables interoperability with devices that do not support a value of"]
#[doc = "       0 for the WinOffset parameter in the Link Layer CONNECT_IND packet. This applies to a"]
#[doc = "       limited set of legacy peripheral devices from another vendor. Enabling this compatibility"]
#[doc = "       mode will only have an effect if the local device will act as a central device and"]
#[doc = "       initiate a connection to a peripheral device. In that case it may lead to the connection"]
#[doc = "       creation taking up to one connection interval longer to complete for all connections."]
#[doc = ""]
#[doc = "  @retval ::NRF_SUCCESS Set successfully."]
#[doc = "  @retval ::NRF_ERROR_INVALID_STATE When connection creation is ongoing while mode 1 is set."]
#[repr(C, packed)]
#[derive(Debug, Copy, Clone)]
pub struct ble_gap_opt_compat_mode_1_t {
    pub _bitfield_1: __BindgenBitfieldUnit<[u8; 1usize], u8>,
}
#[test]
fn bindgen_test_layout_ble_gap_opt_compat_mode_1_t() {
    assert_eq!(
        ::core::mem::size_of::<ble_gap_opt_compat_mode_1_t>(),
        1usize,
        concat!("Size of: ", stringify!(ble_gap_opt_compat_mode_1_t))
    );
    assert_eq!(
        ::core::mem::align_of::<ble_gap_opt_compat_mode_1_t>(),
        1usize,
        concat!("Alignment of ", stringify!(ble_gap_opt_compat_mode_1_t))
    );
}
impl ble_gap_opt_compat_mode_1_t {
    #[inline]
    pub fn enable(&self) -> u8 {
        unsafe { ::core::mem::transmute(self._bitfield_1.get(0usize, 1u8) as u8) }
    }
    #[inline]
    pub fn set_enable(&mut self, val: u8) {
        unsafe {
            let val: u8 = ::core::mem::transmute(val);
            self._bitfield_1.set(0usize, 1u8, val as u64)
        }
    }
    #[inline]
    pub fn new_bitfield_1(enable: u8) -> __BindgenBitfieldUnit<[u8; 1usize], u8> {
        let mut __bindgen_bitfield_unit: __BindgenBitfieldUnit<[u8; 1usize], u8> = Default::default();
        __bindgen_bitfield_unit.set(0usize, 1u8, {
            let enable: u8 = unsafe { ::core::mem::transmute(enable) };
            enable as u64
        });
        __bindgen_bitfield_unit
    }
}
#[doc = "@brief Authenticated payload timeout option."]
#[doc = ""]
#[doc = " @details This can be used with @ref sd_ble_opt_set to change the Authenticated payload timeout to a value other"]
#[doc = "          than the default of @ref BLE_GAP_AUTH_PAYLOAD_TIMEOUT_MAX."]
#[doc = ""]
#[doc = " @note The authenticated payload timeout event ::BLE_GAP_TIMEOUT_SRC_AUTH_PAYLOAD will be generated"]
#[doc = "       if auth_payload_timeout time has elapsed without receiving a packet with a valid MIC on an encrypted"]
#[doc = "       link."]
#[doc = ""]
#[doc = " @note The LE ping procedure will be initiated before the timer expires to give the peer a chance"]
#[doc = "       to reset the timer. In addition the stack will try to prioritize running of LE ping over other"]
#[doc = "       activities to increase chances of finishing LE ping before timer expires. To avoid side-effects"]
#[doc = "       on other activities, it is recommended to use high timeout values."]
#[doc = "       Recommended timeout > 2*(connInterval * (6 + connSlaveLatency))."]
#[doc = ""]
#[doc = " @retval ::NRF_SUCCESS Set successfully."]
#[doc = " @retval ::NRF_ERROR_INVALID_PARAM Invalid parameter(s) supplied. auth_payload_timeout was outside of allowed range."]
#[doc = " @retval ::BLE_ERROR_INVALID_CONN_HANDLE Invalid connection handle parameter."]
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct ble_gap_opt_auth_payload_timeout_t {
    #[doc = "< Connection Handle"]
    pub conn_handle: u16,
    #[doc = "< Requested timeout in 10 ms unit, see @ref BLE_GAP_AUTH_PAYLOAD_TIMEOUT."]
    pub auth_payload_timeout: u16,
}
#[test]
fn bindgen_test_layout_ble_gap_opt_auth_payload_timeout_t() {
    assert_eq!(
        ::core::mem::size_of::<ble_gap_opt_auth_payload_timeout_t>(),
        4usize,
        concat!("Size of: ", stringify!(ble_gap_opt_auth_payload_timeout_t))
    );
    assert_eq!(
        ::core::mem::align_of::<ble_gap_opt_auth_payload_timeout_t>(),
        2usize,
        concat!("Alignment of ", stringify!(ble_gap_opt_auth_payload_timeout_t))
    );
    assert_eq!(
        unsafe { &(*(::core::ptr::null::<ble_gap_opt_auth_payload_timeout_t>())).conn_handle as *const _ as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(ble_gap_opt_auth_payload_timeout_t),
            "::",
            stringify!(conn_handle)
        )
    );
    assert_eq!(
        unsafe {
            &(*(::core::ptr::null::<ble_gap_opt_auth_payload_timeout_t>())).auth_payload_timeout as *const _ as usize
        },
        2usize,
        concat!(
            "Offset of field: ",
            stringify!(ble_gap_opt_auth_payload_timeout_t),
            "::",
            stringify!(auth_payload_timeout)
        )
    );
}
#[doc = "@brief Option structure for GAP options."]
#[repr(C)]
#[derive(Copy, Clone)]
pub union ble_gap_opt_t {
    #[doc = "< Parameters for the Channel Map option."]
    pub ch_map: ble_gap_opt_ch_map_t,
    #[doc = "< Parameters for the Local connection latency option"]
    pub local_conn_latency: ble_gap_opt_local_conn_latency_t,
    #[doc = "< Parameters for the Passkey option."]
    pub passkey: ble_gap_opt_passkey_t,
    #[doc = "< Parameters for the compatibility mode 1 option."]
    pub compat_mode_1: ble_gap_opt_compat_mode_1_t,
    #[doc = "< Parameters for the authenticated payload timeout option."]
    pub auth_payload_timeout: ble_gap_opt_auth_payload_timeout_t,
    #[doc = "< Parameters for the Disable slave latency option"]
    pub slave_latency_disable: ble_gap_opt_slave_latency_disable_t,
    _bindgen_union_align: [u32; 2usize],
}
#[test]
fn bindgen_test_layout_ble_gap_opt_t() {
    assert_eq!(
        ::core::mem::size_of::<ble_gap_opt_t>(),
        8usize,
        concat!("Size of: ", stringify!(ble_gap_opt_t))
    );
    assert_eq!(
        ::core::mem::align_of::<ble_gap_opt_t>(),
        4usize,
        concat!("Alignment of ", stringify!(ble_gap_opt_t))
    );
    assert_eq!(
        unsafe { &(*(::core::ptr::null::<ble_gap_opt_t>())).ch_map as *const _ as usize },
        0usize,
        concat!("Offset of field: ", stringify!(ble_gap_opt_t), "::", stringify!(ch_map))
    );
    assert_eq!(
        unsafe { &(*(::core::ptr::null::<ble_gap_opt_t>())).local_conn_latency as *const _ as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(ble_gap_opt_t),
            "::",
            stringify!(local_conn_latency)
        )
    );
    assert_eq!(
        unsafe { &(*(::core::ptr::null::<ble_gap_opt_t>())).passkey as *const _ as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(ble_gap_opt_t),
            "::",
            stringify!(passkey)
        )
    );
    assert_eq!(
        unsafe { &(*(::core::ptr::null::<ble_gap_opt_t>())).compat_mode_1 as *const _ as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(ble_gap_opt_t),
            "::",
            stringify!(compat_mode_1)
        )
    );
    assert_eq!(
        unsafe { &(*(::core::ptr::null::<ble_gap_opt_t>())).auth_payload_timeout as *const _ as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(ble_gap_opt_t),
            "::",
            stringify!(auth_payload_timeout)
        )
    );
    assert_eq!(
        unsafe { &(*(::core::ptr::null::<ble_gap_opt_t>())).slave_latency_disable as *const _ as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(ble_gap_opt_t),
            "::",
            stringify!(slave_latency_disable)
        )
    );
}
#[doc = "@brief  Connection event triggering parameters."]
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct ble_gap_conn_event_trigger_t {
    #[doc = "< PPI channel to use. This channel should be regarded as reserved until"]
    #[doc = "connection event PPI task triggering is stopped."]
    #[doc = "The PPI channel ID can not be one of the PPI channels reserved by"]
    #[doc = "the SoftDevice. See @ref NRF_SOC_SD_PPI_CHANNELS_SD_ENABLED_MSK."]
    pub ppi_ch_id: u8,
    #[doc = "< Task Endpoint to trigger."]
    pub task_endpoint: u32,
    #[doc = "< The connection event on which the task triggering should start."]
    pub conn_evt_counter_start: u16,
    #[doc = "< Trigger period. Valid range is [1, 32767]."]
    #[doc = "If the device is in slave role and slave latency is enabled,"]
    #[doc = "this parameter should be set to a multiple of (slave latency + 1)"]
    #[doc = "to ensure low power operation."]
    pub period_in_events: u16,
}
#[test]
fn bindgen_test_layout_ble_gap_conn_event_trigger_t() {
    assert_eq!(
        ::core::mem::size_of::<ble_gap_conn_event_trigger_t>(),
        12usize,
        concat!("Size of: ", stringify!(ble_gap_conn_event_trigger_t))
    );
    assert_eq!(
        ::core::mem::align_of::<ble_gap_conn_event_trigger_t>(),
        4usize,
        concat!("Alignment of ", stringify!(ble_gap_conn_event_trigger_t))
    );
    assert_eq!(
        unsafe { &(*(::core::ptr::null::<ble_gap_conn_event_trigger_t>())).ppi_ch_id as *const _ as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(ble_gap_conn_event_trigger_t),
            "::",
            stringify!(ppi_ch_id)
        )
    );
    assert_eq!(
        unsafe { &(*(::core::ptr::null::<ble_gap_conn_event_trigger_t>())).task_endpoint as *const _ as usize },
        4usize,
        concat!(
            "Offset of field: ",
            stringify!(ble_gap_conn_event_trigger_t),
            "::",
            stringify!(task_endpoint)
        )
    );
    assert_eq!(
        unsafe {
            &(*(::core::ptr::null::<ble_gap_conn_event_trigger_t>())).conn_evt_counter_start as *const _ as usize
        },
        8usize,
        concat!(
            "Offset of field: ",
            stringify!(ble_gap_conn_event_trigger_t),
            "::",
            stringify!(conn_evt_counter_start)
        )
    );
    assert_eq!(
        unsafe { &(*(::core::ptr::null::<ble_gap_conn_event_trigger_t>())).period_in_events as *const _ as usize },
        10usize,
        concat!(
            "Offset of field: ",
            stringify!(ble_gap_conn_event_trigger_t),
            "::",
            stringify!(period_in_events)
        )
    );
}

#[doc = "@brief Set the local Bluetooth identity address."]
#[doc = ""]
#[doc = "        The local Bluetooth identity address is the address that identifies this device to other peers."]
#[doc = "        The address type must be either @ref BLE_GAP_ADDR_TYPE_PUBLIC or @ref BLE_GAP_ADDR_TYPE_RANDOM_STATIC."]
#[doc = ""]
#[doc = " @note  The identity address cannot be changed while advertising, scanning or creating a connection."]
#[doc = ""]
#[doc = " @note  This address will be distributed to the peer during bonding."]
#[doc = "        If the address changes, the address stored in the peer device will not be valid and the ability to"]
#[doc = "        reconnect using the old address will be lost."]
#[doc = ""]
#[doc = " @note  By default the SoftDevice will set an address of type @ref BLE_GAP_ADDR_TYPE_RANDOM_STATIC upon being"]
#[doc = "        enabled. The address is a random number populated during the IC manufacturing process and remains unchanged"]
#[doc = "        for the lifetime of each IC."]
#[doc = ""]
#[doc = " @mscs"]
#[doc = " @mmsc{@ref BLE_GAP_ADV_MSC}"]
#[doc = " @endmscs"]
#[doc = ""]
#[doc = " @param[in] p_addr Pointer to address structure."]
#[doc = ""]
#[doc = " @retval ::NRF_SUCCESS Address successfully set."]
#[doc = " @retval ::NRF_ERROR_INVALID_ADDR Invalid pointer supplied."]
#[doc = " @retval ::BLE_ERROR_GAP_INVALID_BLE_ADDR Invalid address."]
#[doc = " @retval ::NRF_ERROR_BUSY The stack is busy, process pending events and retry."]
#[doc = " @retval ::NRF_ERROR_INVALID_STATE The identity address cannot be changed while advertising,"]
#[doc = "                                   scanning or creating a connection."]
#[inline(always)]
pub unsafe fn sd_ble_gap_addr_set(p_addr: *const ble_gap_addr_t) -> u32 {
    let ret: u32;
    core::arch::asm!("svc 108",
        inout("r0") to_asm(p_addr) => ret,
        lateout("r1") _,
        lateout("r2") _,
        lateout("r3") _,
        lateout("r12") _,
    );
    ret
}

#[doc = "@brief Get local Bluetooth identity address."]
#[doc = ""]
#[doc = " @note  This will always return the identity address irrespective of the privacy settings,"]
#[doc = "        i.e. the address type will always be either @ref BLE_GAP_ADDR_TYPE_PUBLIC or @ref BLE_GAP_ADDR_TYPE_RANDOM_STATIC."]
#[doc = ""]
#[doc = " @param[out] p_addr Pointer to address structure to be filled in."]
#[doc = ""]
#[doc = " @retval ::NRF_SUCCESS Address successfully retrieved."]
#[doc = " @retval ::NRF_ERROR_INVALID_ADDR Invalid or NULL pointer supplied."]
#[inline(always)]
pub unsafe fn sd_ble_gap_addr_get(p_addr: *mut ble_gap_addr_t) -> u32 {
    let ret: u32;
    core::arch::asm!("svc 109",
        inout("r0") to_asm(p_addr) => ret,
        lateout("r1") _,
        lateout("r2") _,
        lateout("r3") _,
        lateout("r12") _,
    );
    ret
}

#[doc = "@brief Get the Bluetooth device address used by the advertiser."]
#[doc = ""]
#[doc = " @note  This function will return the local Bluetooth address used in advertising PDUs. When"]
#[doc = "        using privacy, the SoftDevice will generate a new private address every"]
#[doc = "        @ref ble_gap_privacy_params_t::private_addr_cycle_s configured using"]
#[doc = "        @ref sd_ble_gap_privacy_set. Hence depending on when the application calls this API, the"]
#[doc = "        address returned may not be the latest address that is used in the advertising PDUs."]
#[doc = ""]
#[doc = " @param[in]  adv_handle The advertising handle to get the address from."]
#[doc = " @param[out] p_addr     Pointer to address structure to be filled in."]
#[doc = ""]
#[doc = " @retval ::NRF_SUCCESS                  Address successfully retrieved."]
#[doc = " @retval ::NRF_ERROR_INVALID_ADDR       Invalid or NULL pointer supplied."]
#[doc = " @retval ::BLE_ERROR_INVALID_ADV_HANDLE The provided advertising handle was not found."]
#[doc = " @retval ::NRF_ERROR_INVALID_STATE      The advertising set is currently not advertising."]
#[inline(always)]
pub unsafe fn sd_ble_gap_adv_addr_get(adv_handle: u8, p_addr: *mut ble_gap_addr_t) -> u32 {
    let ret: u32;
    core::arch::asm!("svc 147",
        inout("r0") to_asm(adv_handle) => ret,
        inout("r1") to_asm(p_addr) => _,
        lateout("r2") _,
        lateout("r3") _,
        lateout("r12") _,
    );
    ret
}

#[doc = "@brief Set the active whitelist in the SoftDevice."]
#[doc = ""]
#[doc = " @note  Only one whitelist can be used at a time and the whitelist is shared between the BLE roles."]
#[doc = "        The whitelist cannot be set if a BLE role is using the whitelist."]
#[doc = ""]
#[doc = " @note  If an address is resolved using the information in the device identity list, then the whitelist"]
#[doc = "        filter policy applies to the peer identity address and not the resolvable address sent on air."]
#[doc = ""]
#[doc = " @mscs"]
#[doc = " @mmsc{@ref BLE_GAP_WL_SHARE_MSC}"]
#[doc = " @mmsc{@ref BLE_GAP_PRIVACY_SCAN_PRIVATE_SCAN_MSC}"]
#[doc = " @endmscs"]
#[doc = ""]
#[doc = " @param[in] pp_wl_addrs Pointer to a whitelist of peer addresses, if NULL the whitelist will be cleared."]
#[doc = " @param[in] len         Length of the whitelist, maximum @ref BLE_GAP_WHITELIST_ADDR_MAX_COUNT."]
#[doc = ""]
#[doc = " @retval ::NRF_SUCCESS The whitelist is successfully set/cleared."]
#[doc = " @retval ::NRF_ERROR_INVALID_ADDR The whitelist (or one of its entries) provided is invalid."]
#[doc = " @retval ::BLE_ERROR_GAP_WHITELIST_IN_USE The whitelist is in use by a BLE role and cannot be set or cleared."]
#[doc = " @retval ::BLE_ERROR_GAP_INVALID_BLE_ADDR Invalid address type is supplied."]
#[doc = " @retval ::NRF_ERROR_DATA_SIZE The given whitelist size is invalid (zero or too large); this can only return when"]
#[doc = "                               pp_wl_addrs is not NULL."]
#[inline(always)]
pub unsafe fn sd_ble_gap_whitelist_set(pp_wl_addrs: *const *const ble_gap_addr_t, len: u8) -> u32 {
    let ret: u32;
    core::arch::asm!("svc 110",
        inout("r0") to_asm(pp_wl_addrs) => ret,
        inout("r1") to_asm(len) => _,
        lateout("r2") _,
        lateout("r3") _,
        lateout("r12") _,
    );
    ret
}

#[doc = "@brief Set device identity list."]
#[doc = ""]
#[doc = " @note  Only one device identity list can be used at a time and the list is shared between the BLE roles."]
#[doc = "        The device identity list cannot be set if a BLE role is using the list."]
#[doc = ""]
#[doc = " @param[in] pp_id_keys     Pointer to an array of peer identity addresses and peer IRKs, if NULL the device identity list will be cleared."]
#[doc = " @param[in] pp_local_irks  Pointer to an array of local IRKs. Each entry in the array maps to the entry in pp_id_keys at the same index."]
#[doc = "                           To fill in the list with the currently set device IRK for all peers, set to NULL."]
#[doc = " @param[in] len            Length of the device identity list, maximum @ref BLE_GAP_DEVICE_IDENTITIES_MAX_COUNT."]
#[doc = ""]
#[doc = " @mscs"]
#[doc = " @mmsc{@ref BLE_GAP_PRIVACY_ADV_MSC}"]
#[doc = " @mmsc{@ref BLE_GAP_PRIVACY_SCAN_MSC}"]
#[doc = " @mmsc{@ref BLE_GAP_PRIVACY_SCAN_PRIVATE_SCAN_MSC}"]
#[doc = " @mmsc{@ref BLE_GAP_PRIVACY_ADV_DIR_PRIV_MSC}"]
#[doc = " @mmsc{@ref BLE_GAP_PERIPH_CONN_PRIV_MSC}"]
#[doc = " @mmsc{@ref BLE_GAP_CENTRAL_CONN_PRIV_MSC}"]
#[doc = " @endmscs"]
#[doc = ""]
#[doc = " @retval ::NRF_SUCCESS The device identity list successfully set/cleared."]
#[doc = " @retval ::NRF_ERROR_INVALID_ADDR The device identity list (or one of its entries) provided is invalid."]
#[doc = "                                  This code may be returned if the local IRK list also has an invalid entry."]
#[doc = " @retval ::BLE_ERROR_GAP_DEVICE_IDENTITIES_IN_USE The device identity list is in use and cannot be set or cleared."]
#[doc = " @retval ::BLE_ERROR_GAP_DEVICE_IDENTITIES_DUPLICATE The device identity list contains multiple entries with the same identity address."]
#[doc = " @retval ::BLE_ERROR_GAP_INVALID_BLE_ADDR Invalid address type is supplied."]
#[doc = " @retval ::NRF_ERROR_DATA_SIZE The given device identity list size invalid (zero or too large); this can"]
#[doc = "                               only return when pp_id_keys is not NULL."]
#[inline(always)]
pub unsafe fn sd_ble_gap_device_identities_set(
    pp_id_keys: *const *const ble_gap_id_key_t,
    pp_local_irks: *const *const ble_gap_irk_t,
    len: u8,
) -> u32 {
    let ret: u32;
    core::arch::asm!("svc 111",
        inout("r0") to_asm(pp_id_keys) => ret,
        inout("r1") to_asm(pp_local_irks) => _,
        inout("r2") to_asm(len) => _,
        lateout("r3") _,
        lateout("r12") _,
    );
    ret
}

#[doc = "@brief Set privacy settings."]
#[doc = ""]
#[doc = " @note  Privacy settings cannot be changed while advertising, scanning or creating a connection."]
#[doc = ""]
#[doc = " @param[in] p_privacy_params Privacy settings."]
#[doc = ""]
#[doc = " @mscs"]
#[doc = " @mmsc{@ref BLE_GAP_PRIVACY_ADV_MSC}"]
#[doc = " @mmsc{@ref BLE_GAP_PRIVACY_SCAN_MSC}"]
#[doc = " @mmsc{@ref BLE_GAP_PRIVACY_ADV_DIR_PRIV_MSC}"]
#[doc = " @endmscs"]
#[doc = ""]
#[doc = " @retval ::NRF_SUCCESS Set successfully."]
#[doc = " @retval ::NRF_ERROR_BUSY The stack is busy, process pending events and retry."]
#[doc = " @retval ::BLE_ERROR_GAP_INVALID_BLE_ADDR Invalid address type is supplied."]
#[doc = " @retval ::NRF_ERROR_INVALID_ADDR The pointer to privacy settings is NULL or invalid."]
#[doc = "                                  Otherwise, the p_device_irk pointer in privacy parameter is an invalid pointer."]
#[doc = " @retval ::NRF_ERROR_INVALID_PARAM Out of range parameters are provided."]
#[doc = " @retval ::NRF_ERROR_NOT_SUPPORTED The SoftDevice does not support privacy if the Central Address Resolution"]
#[doc = "characteristic is not configured to be included and the SoftDevice is configured"]
#[doc = "to support central roles."]
#[doc = "See @ref ble_gap_cfg_car_incl_cfg_t and @ref ble_gap_cfg_role_count_t."]
#[doc = " @retval ::NRF_ERROR_INVALID_STATE Privacy settings cannot be changed while advertising, scanning"]
#[doc = "                                   or creating a connection."]
#[inline(always)]
pub unsafe fn sd_ble_gap_privacy_set(p_privacy_params: *const ble_gap_privacy_params_t) -> u32 {
    let ret: u32;
    core::arch::asm!("svc 112",
        inout("r0") to_asm(p_privacy_params) => ret,
        lateout("r1") _,
        lateout("r2") _,
        lateout("r3") _,
        lateout("r12") _,
    );
    ret
}

#[doc = "@brief Get privacy settings."]
#[doc = ""]
#[doc = " @note ::ble_gap_privacy_params_t::p_device_irk must be initialized to NULL or a valid address before this function is called."]
#[doc = "       If it is initialized to a valid address, the address pointed to will contain the current device IRK on return."]
#[doc = ""]
#[doc = " @param[in,out] p_privacy_params Privacy settings."]
#[doc = ""]
#[doc = " @retval ::NRF_SUCCESS            Privacy settings read."]
#[doc = " @retval ::NRF_ERROR_INVALID_ADDR The pointer given for returning the privacy settings may be NULL or invalid."]
#[doc = "                                  Otherwise, the p_device_irk pointer in privacy parameter is an invalid pointer."]
#[inline(always)]
pub unsafe fn sd_ble_gap_privacy_get(p_privacy_params: *mut ble_gap_privacy_params_t) -> u32 {
    let ret: u32;
    core::arch::asm!("svc 113",
        inout("r0") to_asm(p_privacy_params) => ret,
        lateout("r1") _,
        lateout("r2") _,
        lateout("r3") _,
        lateout("r12") _,
    );
    ret
}

#[doc = "@brief Configure an advertising set. Set, clear or update advertising and scan response data."]
#[doc = ""]
#[doc = " @note  The format of the advertising data will be checked by this call to ensure interoperability."]
#[doc = "        Limitations imposed by this API call to the data provided include having a flags data type in the scan response data and"]
#[doc = "        duplicating the local name in the advertising data and scan response data."]
#[doc = ""]
#[doc = " @note In order to update advertising data while advertising, new advertising buffers must be provided."]
#[doc = ""]
#[doc = " @mscs"]
#[doc = " @mmsc{@ref BLE_GAP_ADV_MSC}"]
#[doc = " @mmsc{@ref BLE_GAP_WL_SHARE_MSC}"]
#[doc = " @endmscs"]
#[doc = ""]
#[doc = " @param[in,out] p_adv_handle                         Provide a pointer to a handle containing @ref BLE_GAP_ADV_SET_HANDLE_NOT_SET to configure"]
#[doc = "                                                     a new advertising set. On success, a new handle is then returned through the pointer."]
#[doc = "                                                     Provide a pointer to an existing advertising handle to configure an existing advertising set."]
#[doc = " @param[in]     p_adv_data                           Advertising data. If set to NULL, no advertising data will be used. See @ref ble_gap_adv_data_t."]
#[doc = " @param[in]     p_adv_params                         Advertising parameters. When this function is used to update advertising data while advertising,"]
#[doc = "                                                     this parameter must be NULL. See @ref ble_gap_adv_params_t."]
#[doc = ""]
#[doc = " @retval ::NRF_SUCCESS                               Advertising set successfully configured."]
#[doc = " @retval ::NRF_ERROR_INVALID_PARAM                   Invalid parameter(s) supplied:"]
#[doc = "                                                      - Invalid advertising data configuration specified. See @ref ble_gap_adv_data_t."]
#[doc = "                                                      - Invalid configuration of p_adv_params. See @ref ble_gap_adv_params_t."]
#[doc = "                                                      - Use of whitelist requested but whitelist has not been set,"]
#[doc = "                                                        see @ref sd_ble_gap_whitelist_set."]
#[doc = " @retval ::BLE_ERROR_GAP_INVALID_BLE_ADDR            ble_gap_adv_params_t::p_peer_addr is invalid."]
#[doc = " @retval ::NRF_ERROR_INVALID_STATE                   Invalid state to perform operation. Either:"]
#[doc = "                                                     - It is invalid to provide non-NULL advertising set parameters while advertising."]
#[doc = "                                                     - It is invalid to provide the same data buffers while advertising. To update"]
#[doc = "                                                       advertising data, provide new advertising buffers."]
#[doc = " @retval ::BLE_ERROR_GAP_DISCOVERABLE_WITH_WHITELIST Discoverable mode and whitelist incompatible."]
#[doc = " @retval ::BLE_ERROR_INVALID_ADV_HANDLE              The provided advertising handle was not found. Use @ref BLE_GAP_ADV_SET_HANDLE_NOT_SET to"]
#[doc = "                                                     configure a new advertising handle."]
#[doc = " @retval ::NRF_ERROR_INVALID_ADDR                    Invalid pointer supplied."]
#[doc = " @retval ::NRF_ERROR_INVALID_FLAGS                   Invalid combination of advertising flags supplied."]
#[doc = " @retval ::NRF_ERROR_INVALID_DATA                    Invalid data type(s) supplied. Check the advertising data format specification"]
#[doc = "                                                     given in Bluetooth Specification Version 5.0, Volume 3, Part C, Chapter 11."]
#[doc = " @retval ::NRF_ERROR_INVALID_LENGTH                  Invalid data length(s) supplied."]
#[doc = " @retval ::NRF_ERROR_NOT_SUPPORTED                   Unsupported data length or advertising parameter configuration."]
#[doc = " @retval ::NRF_ERROR_NO_MEM                          Not enough memory to configure a new advertising handle. Update an"]
#[doc = "                                                     existing advertising handle instead."]
#[doc = " @retval ::BLE_ERROR_GAP_UUID_LIST_MISMATCH Invalid UUID list supplied."]
#[inline(always)]
pub unsafe fn sd_ble_gap_adv_set_configure(
    p_adv_handle: *mut u8,
    p_adv_data: *const ble_gap_adv_data_t,
    p_adv_params: *const ble_gap_adv_params_t,
) -> u32 {
    let ret: u32;
    core::arch::asm!("svc 114",
        inout("r0") to_asm(p_adv_handle) => ret,
        inout("r1") to_asm(p_adv_data) => _,
        inout("r2") to_asm(p_adv_params) => _,
        lateout("r3") _,
        lateout("r12") _,
    );
    ret
}

#[doc = "@brief Start advertising (GAP Discoverable, Connectable modes, Broadcast Procedure)."]
#[doc = ""]
#[doc = " @note Only one advertiser may be active at any time."]
#[doc = ""]
#[doc = " @events"]
#[doc = " @event{@ref BLE_GAP_EVT_CONNECTED, Generated after connection has been established through connectable advertising.}"]
#[doc = " @event{@ref BLE_GAP_EVT_ADV_SET_TERMINATED, Advertising set has terminated.}"]
#[doc = " @event{@ref BLE_GAP_EVT_SCAN_REQ_REPORT, A scan request was received.}"]
#[doc = " @endevents"]
#[doc = ""]
#[doc = " @mscs"]
#[doc = " @mmsc{@ref BLE_GAP_ADV_MSC}"]
#[doc = " @mmsc{@ref BLE_GAP_PERIPH_CONN_PRIV_MSC}"]
#[doc = " @mmsc{@ref BLE_GAP_PRIVACY_ADV_DIR_PRIV_MSC}"]
#[doc = " @mmsc{@ref BLE_GAP_WL_SHARE_MSC}"]
#[doc = " @endmscs"]
#[doc = ""]
#[doc = " @param[in] adv_handle   Advertising handle to advertise on, received from @ref sd_ble_gap_adv_set_configure."]
#[doc = " @param[in] conn_cfg_tag Tag identifying a configuration set by @ref sd_ble_cfg_set or"]
#[doc = "                         @ref BLE_CONN_CFG_TAG_DEFAULT to use the default connection configuration. For non-connectable"]
#[doc = "                         advertising, this is ignored."]
#[doc = ""]
#[doc = " @retval ::NRF_SUCCESS                  The BLE stack has started advertising."]
#[doc = " @retval ::NRF_ERROR_INVALID_STATE      adv_handle is not configured or already advertising."]
#[doc = " @retval ::NRF_ERROR_CONN_COUNT         The limit of available connections for this connection configuration"]
#[doc = "                                        tag has been reached; connectable advertiser cannot be started."]
#[doc = "                                        To increase the number of available connections,"]
#[doc = "                                        use @ref sd_ble_cfg_set with @ref BLE_GAP_CFG_ROLE_COUNT or @ref BLE_CONN_CFG_GAP."]
#[doc = " @retval ::BLE_ERROR_INVALID_ADV_HANDLE Advertising handle not found. Configure a new adveriting handle with @ref sd_ble_gap_adv_set_configure."]
#[doc = " @retval ::NRF_ERROR_NOT_FOUND          conn_cfg_tag not found."]
#[doc = " @retval ::NRF_ERROR_INVALID_PARAM      Invalid parameter(s) supplied:"]
#[doc = "                                        - Invalid configuration of p_adv_params. See @ref ble_gap_adv_params_t."]
#[doc = "                                        - Use of whitelist requested but whitelist has not been set, see @ref sd_ble_gap_whitelist_set."]
#[doc = " @retval ::NRF_ERROR_RESOURCES          Either:"]
#[doc = "                                        - adv_handle is configured with connectable advertising, but the event_length parameter"]
#[doc = "                                          associated with conn_cfg_tag is too small to be able to establish a connection on"]
#[doc = "                                          the selected advertising phys. Use @ref sd_ble_cfg_set to increase the event length."]
#[doc = "                                        - Not enough BLE role slots available."]
#[doc = "Stop one or more currently active roles (Central, Peripheral, Broadcaster or Observer) and try again."]
#[doc = "                                        - p_adv_params is configured with connectable advertising, but the event_length parameter"]
#[doc = "                                          associated with conn_cfg_tag is too small to be able to establish a connection on"]
#[doc = "                                          the selected advertising phys. Use @ref sd_ble_cfg_set to increase the event length."]
#[inline(always)]
pub unsafe fn sd_ble_gap_adv_start(adv_handle: u8, conn_cfg_tag: u8) -> u32 {
    let ret: u32;
    core::arch::asm!("svc 115",
        inout("r0") to_asm(adv_handle) => ret,
        inout("r1") to_asm(conn_cfg_tag) => _,
        lateout("r2") _,
        lateout("r3") _,
        lateout("r12") _,
    );
    ret
}

#[doc = "@brief Stop advertising (GAP Discoverable, Connectable modes, Broadcast Procedure)."]
#[doc = ""]
#[doc = " @mscs"]
#[doc = " @mmsc{@ref BLE_GAP_ADV_MSC}"]
#[doc = " @mmsc{@ref BLE_GAP_WL_SHARE_MSC}"]
#[doc = " @endmscs"]
#[doc = ""]
#[doc = " @param[in] adv_handle The advertising handle that should stop advertising."]
#[doc = ""]
#[doc = " @retval ::NRF_SUCCESS The BLE stack has stopped advertising."]
#[doc = " @retval ::BLE_ERROR_INVALID_ADV_HANDLE Invalid advertising handle."]
#[doc = " @retval ::NRF_ERROR_INVALID_STATE The advertising handle is not advertising."]
#[inline(always)]
pub unsafe fn sd_ble_gap_adv_stop(adv_handle: u8) -> u32 {
    let ret: u32;
    core::arch::asm!("svc 116",
        inout("r0") to_asm(adv_handle) => ret,
        lateout("r1") _,
        lateout("r2") _,
        lateout("r3") _,
        lateout("r12") _,
    );
    ret
}

#[doc = "@brief Update connection parameters."]
#[doc = ""]
#[doc = " @details In the central role this will initiate a Link Layer connection parameter update procedure,"]
#[doc = "          otherwise in the peripheral role, this will send the corresponding L2CAP request and wait for"]
#[doc = "          the central to perform the procedure. In both cases, and regardless of success or failure, the application"]
#[doc = "          will be informed of the result with a @ref BLE_GAP_EVT_CONN_PARAM_UPDATE event."]
#[doc = ""]
#[doc = " @details This function can be used as a central both to reply to a @ref BLE_GAP_EVT_CONN_PARAM_UPDATE_REQUEST or to start the procedure unrequested."]
#[doc = ""]
#[doc = " @events"]
#[doc = " @event{@ref BLE_GAP_EVT_CONN_PARAM_UPDATE, Result of the connection parameter update procedure.}"]
#[doc = " @endevents"]
#[doc = ""]
#[doc = " @mscs"]
#[doc = " @mmsc{@ref BLE_GAP_CPU_MSC}"]
#[doc = " @mmsc{@ref BLE_GAP_CENTRAL_ENC_AUTH_MUTEX_MSC}"]
#[doc = " @mmsc{@ref BLE_GAP_MULTILINK_CPU_MSC}"]
#[doc = " @mmsc{@ref BLE_GAP_MULTILINK_CTRL_PROC_MSC}"]
#[doc = " @mmsc{@ref BLE_GAP_CENTRAL_CPU_MSC}"]
#[doc = " @endmscs"]
#[doc = ""]
#[doc = " @param[in] conn_handle Connection handle."]
#[doc = " @param[in] p_conn_params  Pointer to desired connection parameters. If NULL is provided on a peripheral role,"]
#[doc = "                           the parameters in the PPCP characteristic of the GAP service will be used instead."]
#[doc = "                           If NULL is provided on a central role and in response to a @ref BLE_GAP_EVT_CONN_PARAM_UPDATE_REQUEST, the peripheral request will be rejected"]
#[doc = ""]
#[doc = " @retval ::NRF_SUCCESS The Connection Update procedure has been started successfully."]
#[doc = " @retval ::NRF_ERROR_INVALID_ADDR Invalid pointer supplied."]
#[doc = " @retval ::NRF_ERROR_INVALID_PARAM Invalid parameter(s) supplied, check parameter limits and constraints."]
#[doc = " @retval ::NRF_ERROR_INVALID_STATE Disconnection in progress or link has not been established."]
#[doc = " @retval ::NRF_ERROR_BUSY Procedure already in progress, wait for pending procedures to complete and retry."]
#[doc = " @retval ::BLE_ERROR_INVALID_CONN_HANDLE Invalid connection handle supplied."]
#[doc = " @retval ::NRF_ERROR_NO_MEM Not enough memory to complete operation."]
#[inline(always)]
pub unsafe fn sd_ble_gap_conn_param_update(conn_handle: u16, p_conn_params: *const ble_gap_conn_params_t) -> u32 {
    let ret: u32;
    core::arch::asm!("svc 117",
        inout("r0") to_asm(conn_handle) => ret,
        inout("r1") to_asm(p_conn_params) => _,
        lateout("r2") _,
        lateout("r3") _,
        lateout("r12") _,
    );
    ret
}

#[doc = "@brief Disconnect (GAP Link Termination)."]
#[doc = ""]
#[doc = " @details This call initiates the disconnection procedure, and its completion will be communicated to the application"]
#[doc = "          with a @ref BLE_GAP_EVT_DISCONNECTED event."]
#[doc = ""]
#[doc = " @events"]
#[doc = " @event{@ref BLE_GAP_EVT_DISCONNECTED, Generated when disconnection procedure is complete.}"]
#[doc = " @endevents"]
#[doc = ""]
#[doc = " @mscs"]
#[doc = " @mmsc{@ref BLE_GAP_CONN_MSC}"]
#[doc = " @endmscs"]
#[doc = ""]
#[doc = " @param[in] conn_handle Connection handle."]
#[doc = " @param[in] hci_status_code HCI status code, see @ref BLE_HCI_STATUS_CODES (accepted values are @ref BLE_HCI_REMOTE_USER_TERMINATED_CONNECTION and @ref BLE_HCI_CONN_INTERVAL_UNACCEPTABLE)."]
#[doc = ""]
#[doc = " @retval ::NRF_SUCCESS The disconnection procedure has been started successfully."]
#[doc = " @retval ::NRF_ERROR_INVALID_PARAM Invalid parameter(s) supplied."]
#[doc = " @retval ::BLE_ERROR_INVALID_CONN_HANDLE Invalid connection handle supplied."]
#[doc = " @retval ::NRF_ERROR_INVALID_STATE Disconnection in progress or link has not been established."]
#[inline(always)]
pub unsafe fn sd_ble_gap_disconnect(conn_handle: u16, hci_status_code: u8) -> u32 {
    let ret: u32;
    core::arch::asm!("svc 118",
        inout("r0") to_asm(conn_handle) => ret,
        inout("r1") to_asm(hci_status_code) => _,
        lateout("r2") _,
        lateout("r3") _,
        lateout("r12") _,
    );
    ret
}

#[doc = "@brief Set the radio's transmit power."]
#[doc = ""]
#[doc = " @param[in] role The role to set the transmit power for, see @ref BLE_GAP_TX_POWER_ROLES for"]
#[doc = "                 possible roles."]
#[doc = " @param[in] handle   The handle parameter is interpreted depending on role:"]
#[doc = "                     - If role is @ref BLE_GAP_TX_POWER_ROLE_CONN, this value is the specific connection handle."]
#[doc = "                     - If role is @ref BLE_GAP_TX_POWER_ROLE_ADV, the advertising set identified with the advertising handle,"]
#[doc = "                       will use the specified transmit power, and include it in the advertising packet headers if"]
#[doc = "                       @ref ble_gap_adv_properties_t::include_tx_power set."]
#[doc = "                     - For all other roles handle is ignored."]
#[doc = " @param[in] tx_power Radio transmit power in dBm (see note for accepted values)."]
#[doc = ""]
#[doc = " @note Supported tx_power values: -40dBm, -20dBm, -16dBm, -12dBm, -8dBm, -4dBm, 0dBm, +2dBm, +3dBm, +4dBm, +5dBm, +6dBm, +7dBm and +8dBm."]
#[doc = " @note The initiator will have the same transmit power as the scanner."]
#[doc = " @note When a connection is created it will inherit the transmit power from the initiator or"]
#[doc = "       advertiser leading to the connection."]
#[doc = ""]
#[doc = " @retval ::NRF_SUCCESS Successfully changed the transmit power."]
#[doc = " @retval ::NRF_ERROR_INVALID_PARAM Invalid parameter(s) supplied."]
#[doc = " @retval ::BLE_ERROR_INVALID_ADV_HANDLE Advertising handle not found."]
#[doc = " @retval ::BLE_ERROR_INVALID_CONN_HANDLE Invalid connection handle supplied."]
#[inline(always)]
pub unsafe fn sd_ble_gap_tx_power_set(role: u8, handle: u16, tx_power: i8) -> u32 {
    let ret: u32;
    core::arch::asm!("svc 119",
        inout("r0") to_asm(role) => ret,
        inout("r1") to_asm(handle) => _,
        inout("r2") to_asm(tx_power) => _,
        lateout("r3") _,
        lateout("r12") _,
    );
    ret
}

#[doc = "@brief Set GAP Appearance value."]
#[doc = ""]
#[doc = " @param[in] appearance Appearance (16-bit), see @ref BLE_APPEARANCES."]
#[doc = ""]
#[doc = " @retval ::NRF_SUCCESS  Appearance value set successfully."]
#[doc = " @retval ::NRF_ERROR_INVALID_PARAM Invalid parameter(s) supplied."]
#[inline(always)]
pub unsafe fn sd_ble_gap_appearance_set(appearance: u16) -> u32 {
    let ret: u32;
    core::arch::asm!("svc 120",
        inout("r0") to_asm(appearance) => ret,
        lateout("r1") _,
        lateout("r2") _,
        lateout("r3") _,
        lateout("r12") _,
    );
    ret
}

#[doc = "@brief Get GAP Appearance value."]
#[doc = ""]
#[doc = " @param[out] p_appearance Pointer to appearance (16-bit) to be filled in, see @ref BLE_APPEARANCES."]
#[doc = ""]
#[doc = " @retval ::NRF_SUCCESS Appearance value retrieved successfully."]
#[doc = " @retval ::NRF_ERROR_INVALID_ADDR Invalid pointer supplied."]
#[inline(always)]
pub unsafe fn sd_ble_gap_appearance_get(p_appearance: *mut u16) -> u32 {
    let ret: u32;
    core::arch::asm!("svc 121",
        inout("r0") to_asm(p_appearance) => ret,
        lateout("r1") _,
        lateout("r2") _,
        lateout("r3") _,
        lateout("r12") _,
    );
    ret
}

#[doc = "@brief Set GAP Peripheral Preferred Connection Parameters."]
#[doc = ""]
#[doc = " @param[in] p_conn_params Pointer to a @ref ble_gap_conn_params_t structure with the desired parameters."]
#[doc = ""]
#[doc = " @retval ::NRF_SUCCESS Peripheral Preferred Connection Parameters set successfully."]
#[doc = " @retval ::NRF_ERROR_INVALID_ADDR Invalid pointer supplied."]
#[doc = " @retval ::NRF_ERROR_INVALID_PARAM Invalid parameter(s) supplied."]
#[doc = " @retval ::NRF_ERROR_NOT_SUPPORTED The characteristic is not included in the Attribute Table,"]
#[doc = "see @ref ble_gap_cfg_ppcp_incl_cfg_t."]
#[inline(always)]
pub unsafe fn sd_ble_gap_ppcp_set(p_conn_params: *const ble_gap_conn_params_t) -> u32 {
    let ret: u32;
    core::arch::asm!("svc 122",
        inout("r0") to_asm(p_conn_params) => ret,
        lateout("r1") _,
        lateout("r2") _,
        lateout("r3") _,
        lateout("r12") _,
    );
    ret
}

#[doc = "@brief Get GAP Peripheral Preferred Connection Parameters."]
#[doc = ""]
#[doc = " @param[out] p_conn_params Pointer to a @ref ble_gap_conn_params_t structure where the parameters will be stored."]
#[doc = ""]
#[doc = " @retval ::NRF_SUCCESS Peripheral Preferred Connection Parameters retrieved successfully."]
#[doc = " @retval ::NRF_ERROR_INVALID_ADDR Invalid pointer supplied."]
#[doc = " @retval ::NRF_ERROR_NOT_SUPPORTED The characteristic is not included in the Attribute Table,"]
#[doc = "see @ref ble_gap_cfg_ppcp_incl_cfg_t."]
#[inline(always)]
pub unsafe fn sd_ble_gap_ppcp_get(p_conn_params: *mut ble_gap_conn_params_t) -> u32 {
    let ret: u32;
    core::arch::asm!("svc 123",
        inout("r0") to_asm(p_conn_params) => ret,
        lateout("r1") _,
        lateout("r2") _,
        lateout("r3") _,
        lateout("r12") _,
    );
    ret
}

#[doc = "@brief Set GAP device name."]
#[doc = ""]
#[doc = " @note  If the device name is located in application flash memory (see @ref ble_gap_cfg_device_name_t),"]
#[doc = "        it cannot be changed. Then @ref NRF_ERROR_FORBIDDEN will be returned."]
#[doc = ""]
#[doc = " @param[in] p_write_perm Write permissions for the Device Name characteristic, see @ref ble_gap_conn_sec_mode_t."]
#[doc = " @param[in] p_dev_name Pointer to a UTF-8 encoded, <b>non NULL-terminated</b> string."]
#[doc = " @param[in] len Length of the UTF-8, <b>non NULL-terminated</b> string pointed to by p_dev_name in octets (must be smaller or equal than @ref BLE_GAP_DEVNAME_MAX_LEN)."]
#[doc = ""]
#[doc = " @retval ::NRF_SUCCESS GAP device name and permissions set successfully."]
#[doc = " @retval ::NRF_ERROR_INVALID_ADDR Invalid pointer supplied."]
#[doc = " @retval ::NRF_ERROR_INVALID_PARAM Invalid parameter(s) supplied."]
#[doc = " @retval ::NRF_ERROR_DATA_SIZE Invalid data size(s) supplied."]
#[doc = " @retval ::NRF_ERROR_FORBIDDEN Device name is not writable."]
#[inline(always)]
pub unsafe fn sd_ble_gap_device_name_set(
    p_write_perm: *const ble_gap_conn_sec_mode_t,
    p_dev_name: *const u8,
    len: u16,
) -> u32 {
    let ret: u32;
    core::arch::asm!("svc 124",
        inout("r0") to_asm(p_write_perm) => ret,
        inout("r1") to_asm(p_dev_name) => _,
        inout("r2") to_asm(len) => _,
        lateout("r3") _,
        lateout("r12") _,
    );
    ret
}

#[doc = "@brief Get GAP device name."]
#[doc = ""]
#[doc = " @note  If the device name is longer than the size of the supplied buffer,"]
#[doc = "        p_len will return the complete device name length,"]
#[doc = "        and not the number of bytes actually returned in p_dev_name."]
#[doc = "        The application may use this information to allocate a suitable buffer size."]
#[doc = ""]
#[doc = " @param[out]    p_dev_name Pointer to an empty buffer where the UTF-8 <b>non NULL-terminated</b> string will be placed. Set to NULL to obtain the complete device name length."]
#[doc = " @param[in,out] p_len      Length of the buffer pointed by p_dev_name, complete device name length on output."]
#[doc = ""]
#[doc = " @retval ::NRF_SUCCESS GAP device name retrieved successfully."]
#[doc = " @retval ::NRF_ERROR_INVALID_ADDR Invalid pointer supplied."]
#[doc = " @retval ::NRF_ERROR_DATA_SIZE Invalid data size(s) supplied."]
#[inline(always)]
pub unsafe fn sd_ble_gap_device_name_get(p_dev_name: *mut u8, p_len: *mut u16) -> u32 {
    let ret: u32;
    core::arch::asm!("svc 125",
        inout("r0") to_asm(p_dev_name) => ret,
        inout("r1") to_asm(p_len) => _,
        lateout("r2") _,
        lateout("r3") _,
        lateout("r12") _,
    );
    ret
}

#[doc = "@brief Initiate the GAP Authentication procedure."]
#[doc = ""]
#[doc = " @details In the central role, this function will send an SMP Pairing Request (or an SMP Pairing Failed if rejected),"]
#[doc = "          otherwise in the peripheral role, an SMP Security Request will be sent."]
#[doc = ""]
#[doc = " @events"]
#[doc = " @event{Depending on the security parameters set and the packet exchanges with the peer\\, the following events may be generated:}"]
#[doc = " @event{@ref BLE_GAP_EVT_SEC_PARAMS_REQUEST}"]
#[doc = " @event{@ref BLE_GAP_EVT_SEC_INFO_REQUEST}"]
#[doc = " @event{@ref BLE_GAP_EVT_PASSKEY_DISPLAY}"]
#[doc = " @event{@ref BLE_GAP_EVT_KEY_PRESSED}"]
#[doc = " @event{@ref BLE_GAP_EVT_AUTH_KEY_REQUEST}"]
#[doc = " @event{@ref BLE_GAP_EVT_LESC_DHKEY_REQUEST}"]
#[doc = " @event{@ref BLE_GAP_EVT_CONN_SEC_UPDATE}"]
#[doc = " @event{@ref BLE_GAP_EVT_AUTH_STATUS}"]
#[doc = " @event{@ref BLE_GAP_EVT_TIMEOUT}"]
#[doc = " @endevents"]
#[doc = ""]
#[doc = " @mscs"]
#[doc = " @mmsc{@ref BLE_GAP_PERIPH_SEC_REQ_MSC}"]
#[doc = " @mmsc{@ref BLE_GAP_CENTRAL_SEC_REQ_MSC}"]
#[doc = " @mmsc{@ref BLE_GAP_CENTRAL_ENC_AUTH_MUTEX_MSC}"]
#[doc = " @mmsc{@ref BLE_GAP_CENTRAL_PAIRING_JW_MSC}"]
#[doc = " @mmsc{@ref BLE_GAP_CENTRAL_BONDING_JW_MSC}"]
#[doc = " @mmsc{@ref BLE_GAP_CENTRAL_BONDING_PK_PERIPH_MSC}"]
#[doc = " @mmsc{@ref BLE_GAP_CENTRAL_BONDING_PK_PERIPH_OOB_MSC}"]
#[doc = " @mmsc{@ref BLE_GAP_CENTRAL_LESC_PAIRING_JW_MSC}"]
#[doc = " @mmsc{@ref BLE_GAP_CENTRAL_LESC_BONDING_NC_MSC}"]
#[doc = " @mmsc{@ref BLE_GAP_CENTRAL_LESC_BONDING_PKE_PD_MSC}"]
#[doc = " @mmsc{@ref BLE_GAP_CENTRAL_LESC_BONDING_PKE_CD_MSC}"]
#[doc = " @mmsc{@ref BLE_GAP_CENTRAL_LESC_BONDING_OOB_MSC}"]
#[doc = " @endmscs"]
#[doc = ""]
#[doc = " @param[in] conn_handle Connection handle."]
#[doc = " @param[in] p_sec_params Pointer to the @ref ble_gap_sec_params_t structure with the security parameters to be used during the pairing or bonding procedure."]
#[doc = "                         In the peripheral role, only the bond, mitm, lesc and keypress fields of this structure are used."]
#[doc = "                         In the central role, this pointer may be NULL to reject a Security Request."]
#[doc = ""]
#[doc = " @retval ::NRF_SUCCESS Successfully initiated authentication procedure."]
#[doc = " @retval ::NRF_ERROR_INVALID_ADDR Invalid pointer supplied."]
#[doc = " @retval ::NRF_ERROR_INVALID_PARAM Invalid parameter(s) supplied."]
#[doc = " @retval ::NRF_ERROR_INVALID_STATE Invalid state to perform operation. Either:"]
#[doc = "                                   - No link has been established."]
#[doc = "                                   - An encryption is already executing or queued."]
#[doc = " @retval ::NRF_ERROR_NO_MEM The maximum number of authentication procedures that can run in parallel for the given role is reached."]
#[doc = " @retval ::BLE_ERROR_INVALID_CONN_HANDLE Invalid connection handle supplied."]
#[doc = " @retval ::NRF_ERROR_NOT_SUPPORTED Setting of sign or link fields in @ref ble_gap_sec_kdist_t not supported."]
#[doc = "                                   Distribution of own Identity Information is only supported if the Central"]
#[doc = "                                   Address Resolution characteristic is configured to be included or"]
#[doc = "                                   the Softdevice is configured to support peripheral roles only."]
#[doc = "                                   See @ref ble_gap_cfg_car_incl_cfg_t and @ref ble_gap_cfg_role_count_t."]
#[doc = " @retval ::NRF_ERROR_TIMEOUT A SMP timeout has occurred, and further SMP operations on this link is prohibited."]
#[inline(always)]
pub unsafe fn sd_ble_gap_authenticate(conn_handle: u16, p_sec_params: *const ble_gap_sec_params_t) -> u32 {
    let ret: u32;
    core::arch::asm!("svc 126",
        inout("r0") to_asm(conn_handle) => ret,
        inout("r1") to_asm(p_sec_params) => _,
        lateout("r2") _,
        lateout("r3") _,
        lateout("r12") _,
    );
    ret
}

#[doc = "@brief Reply with GAP security parameters."]
#[doc = ""]
#[doc = " @details This function is only used to reply to a @ref BLE_GAP_EVT_SEC_PARAMS_REQUEST, calling it at other times will result in an @ref NRF_ERROR_INVALID_STATE."]
#[doc = " @note    If the call returns an error code, the request is still pending, and the reply call may be repeated with corrected parameters."]
#[doc = ""]
#[doc = " @events"]
#[doc = " @event{This function is used during authentication procedures, see the list of events in the documentation of @ref sd_ble_gap_authenticate.}"]
#[doc = " @endevents"]
#[doc = ""]
#[doc = " @mscs"]
#[doc = " @mmsc{@ref BLE_GAP_PERIPH_PAIRING_JW_MSC}"]
#[doc = " @mmsc{@ref BLE_GAP_PERIPH_BONDING_JW_MSC}"]
#[doc = " @mmsc{@ref BLE_GAP_PERIPH_BONDING_PK_PERIPH_MSC}"]
#[doc = " @mmsc{@ref BLE_GAP_PERIPH_BONDING_PK_CENTRAL_OOB_MSC}"]
#[doc = " @mmsc{@ref BLE_GAP_PERIPH_BONDING_STATIC_PK_MSC}"]
#[doc = " @mmsc{@ref BLE_GAP_PERIPH_PAIRING_CONFIRM_FAIL_MSC}"]
#[doc = " @mmsc{@ref BLE_GAP_PERIPH_LESC_PAIRING_JW_MSC}"]
#[doc = " @mmsc{@ref BLE_GAP_PERIPH_LESC_BONDING_NC_MSC}"]
#[doc = " @mmsc{@ref BLE_GAP_PERIPH_LESC_BONDING_PKE_PD_MSC}"]
#[doc = " @mmsc{@ref BLE_GAP_PERIPH_LESC_BONDING_PKE_CD_MSC}"]
#[doc = " @mmsc{@ref BLE_GAP_PERIPH_LESC_BONDING_OOB_MSC}"]
#[doc = " @mmsc{@ref BLE_GAP_PERIPH_PAIRING_KS_TOO_SMALL_MSC}"]
#[doc = " @mmsc{@ref BLE_GAP_PERIPH_PAIRING_APP_ERROR_MSC}"]
#[doc = " @mmsc{@ref BLE_GAP_PERIPH_PAIRING_REMOTE_PAIRING_FAIL_MSC}"]
#[doc = " @mmsc{@ref BLE_GAP_PERIPH_PAIRING_TIMEOUT_MSC}"]
#[doc = " @mmsc{@ref BLE_GAP_CENTRAL_PAIRING_JW_MSC}"]
#[doc = " @mmsc{@ref BLE_GAP_CENTRAL_BONDING_JW_MSC}"]
#[doc = " @mmsc{@ref BLE_GAP_CENTRAL_BONDING_PK_PERIPH_MSC}"]
#[doc = " @mmsc{@ref BLE_GAP_CENTRAL_BONDING_PK_PERIPH_OOB_MSC}"]
#[doc = " @mmsc{@ref BLE_GAP_CENTRAL_LESC_PAIRING_JW_MSC}"]
#[doc = " @mmsc{@ref BLE_GAP_CENTRAL_LESC_BONDING_NC_MSC}"]
#[doc = " @mmsc{@ref BLE_GAP_CENTRAL_LESC_BONDING_PKE_PD_MSC}"]
#[doc = " @mmsc{@ref BLE_GAP_CENTRAL_LESC_BONDING_PKE_CD_MSC}"]
#[doc = " @mmsc{@ref BLE_GAP_CENTRAL_LESC_BONDING_OOB_MSC}"]
#[doc = " @endmscs"]
#[doc = ""]
#[doc = " @param[in] conn_handle Connection handle."]
#[doc = " @param[in] sec_status Security status, see @ref BLE_GAP_SEC_STATUS."]
#[doc = " @param[in] p_sec_params Pointer to a @ref ble_gap_sec_params_t security parameters structure. In the central role this must be set to NULL, as the parameters have"]
#[doc = "                         already been provided during a previous call to @ref sd_ble_gap_authenticate."]
#[doc = " @param[in,out] p_sec_keyset Pointer to a @ref ble_gap_sec_keyset_t security keyset structure. Any keys generated and/or distributed as a result of the ongoing security procedure"]
#[doc = "                         will be stored into the memory referenced by the pointers inside this structure. The keys will be stored and available to the application"]
#[doc = "                         upon reception of a @ref BLE_GAP_EVT_AUTH_STATUS event."]
#[doc = "                         Note that the SoftDevice expects the application to provide memory for storing the"]
#[doc = "                         peer's keys. So it must be ensured that the relevant pointers inside this structure are not NULL. The pointers to the local key"]
#[doc = "                         can, however, be NULL, in which case, the local key data will not be available to the application upon reception of the"]
#[doc = "                         @ref BLE_GAP_EVT_AUTH_STATUS event."]
#[doc = ""]
#[doc = " @retval ::NRF_SUCCESS Successfully accepted security parameter from the application."]
#[doc = " @retval ::NRF_ERROR_INVALID_ADDR Invalid pointer supplied."]
#[doc = " @retval ::NRF_ERROR_BUSY The stack is busy, process pending events and retry."]
#[doc = " @retval ::NRF_ERROR_INVALID_PARAM Invalid parameter(s) supplied."]
#[doc = " @retval ::NRF_ERROR_INVALID_STATE Security parameters has not been requested."]
#[doc = " @retval ::BLE_ERROR_INVALID_CONN_HANDLE Invalid connection handle supplied."]
#[doc = " @retval ::NRF_ERROR_NOT_SUPPORTED Setting of sign or link fields in @ref ble_gap_sec_kdist_t not supported."]
#[doc = "                                   Distribution of own Identity Information is only supported if the Central"]
#[doc = "                                   Address Resolution characteristic is configured to be included or"]
#[doc = "                                   the Softdevice is configured to support peripheral roles only."]
#[doc = "                                   See @ref ble_gap_cfg_car_incl_cfg_t and @ref ble_gap_cfg_role_count_t."]
#[inline(always)]
pub unsafe fn sd_ble_gap_sec_params_reply(
    conn_handle: u16,
    sec_status: u8,
    p_sec_params: *const ble_gap_sec_params_t,
    p_sec_keyset: *const ble_gap_sec_keyset_t,
) -> u32 {
    let ret: u32;
    core::arch::asm!("svc 127",
        inout("r0") to_asm(conn_handle) => ret,
        inout("r1") to_asm(sec_status) => _,
        inout("r2") to_asm(p_sec_params) => _,
        inout("r3") to_asm(p_sec_keyset) => _,
        lateout("r12") _,
    );
    ret
}

#[doc = "@brief Reply with an authentication key."]
#[doc = ""]
#[doc = " @details This function is only used to reply to a @ref BLE_GAP_EVT_AUTH_KEY_REQUEST or a @ref BLE_GAP_EVT_PASSKEY_DISPLAY, calling it at other times will result in an @ref NRF_ERROR_INVALID_STATE."]
#[doc = " @note    If the call returns an error code, the request is still pending, and the reply call may be repeated with corrected parameters."]
#[doc = ""]
#[doc = " @events"]
#[doc = " @event{This function is used during authentication procedures\\, see the list of events in the documentation of @ref sd_ble_gap_authenticate.}"]
#[doc = " @endevents"]
#[doc = ""]
#[doc = " @mscs"]
#[doc = " @mmsc{@ref BLE_GAP_PERIPH_BONDING_PK_CENTRAL_OOB_MSC}"]
#[doc = " @mmsc{@ref BLE_GAP_PERIPH_LESC_BONDING_NC_MSC}"]
#[doc = " @mmsc{@ref BLE_GAP_PERIPH_LESC_BONDING_PKE_CD_MSC}"]
#[doc = " @mmsc{@ref BLE_GAP_CENTRAL_BONDING_PK_PERIPH_OOB_MSC}"]
#[doc = " @mmsc{@ref BLE_GAP_CENTRAL_LESC_BONDING_NC_MSC}"]
#[doc = " @mmsc{@ref BLE_GAP_CENTRAL_LESC_BONDING_PKE_CD_MSC}"]
#[doc = " @endmscs"]
#[doc = ""]
#[doc = " @param[in] conn_handle Connection handle."]
#[doc = " @param[in] key_type See @ref BLE_GAP_AUTH_KEY_TYPES."]
#[doc = " @param[in] p_key If key type is @ref BLE_GAP_AUTH_KEY_TYPE_NONE, then NULL."]
#[doc = "                  If key type is @ref BLE_GAP_AUTH_KEY_TYPE_PASSKEY, then a 6-byte ASCII string (digit 0..9 only, no NULL termination)"]
#[doc = "                     or NULL when confirming LE Secure Connections Numeric Comparison."]
#[doc = "                  If key type is @ref BLE_GAP_AUTH_KEY_TYPE_OOB, then a 16-byte OOB key value in little-endian format."]
#[doc = ""]
#[doc = " @retval ::NRF_SUCCESS Authentication key successfully set."]
#[doc = " @retval ::NRF_ERROR_INVALID_ADDR Invalid pointer supplied."]
#[doc = " @retval ::NRF_ERROR_INVALID_PARAM Invalid parameter(s) supplied."]
#[doc = " @retval ::NRF_ERROR_INVALID_STATE Authentication key has not been requested."]
#[doc = " @retval ::BLE_ERROR_INVALID_CONN_HANDLE Invalid connection handle supplied."]
#[inline(always)]
pub unsafe fn sd_ble_gap_auth_key_reply(conn_handle: u16, key_type: u8, p_key: *const u8) -> u32 {
    let ret: u32;
    core::arch::asm!("svc 128",
        inout("r0") to_asm(conn_handle) => ret,
        inout("r1") to_asm(key_type) => _,
        inout("r2") to_asm(p_key) => _,
        lateout("r3") _,
        lateout("r12") _,
    );
    ret
}

#[doc = "@brief Reply with an LE Secure connections DHKey."]
#[doc = ""]
#[doc = " @details This function is only used to reply to a @ref BLE_GAP_EVT_LESC_DHKEY_REQUEST, calling it at other times will result in an @ref NRF_ERROR_INVALID_STATE."]
#[doc = " @note    If the call returns an error code, the request is still pending, and the reply call may be repeated with corrected parameters."]
#[doc = ""]
#[doc = " @events"]
#[doc = " @event{This function is used during authentication procedures\\, see the list of events in the documentation of @ref sd_ble_gap_authenticate.}"]
#[doc = " @endevents"]
#[doc = ""]
#[doc = " @mscs"]
#[doc = " @mmsc{@ref BLE_GAP_PERIPH_LESC_PAIRING_JW_MSC}"]
#[doc = " @mmsc{@ref BLE_GAP_PERIPH_LESC_BONDING_NC_MSC}"]
#[doc = " @mmsc{@ref BLE_GAP_PERIPH_LESC_BONDING_PKE_PD_MSC}"]
#[doc = " @mmsc{@ref BLE_GAP_PERIPH_LESC_BONDING_PKE_CD_MSC}"]
#[doc = " @mmsc{@ref BLE_GAP_PERIPH_LESC_BONDING_OOB_MSC}"]
#[doc = " @mmsc{@ref BLE_GAP_CENTRAL_LESC_PAIRING_JW_MSC}"]
#[doc = " @mmsc{@ref BLE_GAP_CENTRAL_LESC_BONDING_NC_MSC}"]
#[doc = " @mmsc{@ref BLE_GAP_CENTRAL_LESC_BONDING_PKE_PD_MSC}"]
#[doc = " @mmsc{@ref BLE_GAP_CENTRAL_LESC_BONDING_PKE_CD_MSC}"]
#[doc = " @mmsc{@ref BLE_GAP_CENTRAL_LESC_BONDING_OOB_MSC}"]
#[doc = " @endmscs"]
#[doc = ""]
#[doc = " @param[in] conn_handle Connection handle."]
#[doc = " @param[in] p_dhkey LE Secure Connections DHKey."]
#[doc = ""]
#[doc = " @retval ::NRF_SUCCESS DHKey successfully set."]
#[doc = " @retval ::NRF_ERROR_INVALID_ADDR Invalid pointer supplied."]
#[doc = " @retval ::NRF_ERROR_INVALID_PARAM Invalid parameter(s) supplied."]
#[doc = " @retval ::NRF_ERROR_INVALID_STATE Invalid state to perform operation. Either:"]
#[doc = "                                   - The peer is not authenticated."]
#[doc = "                                   - The application has not pulled a @ref BLE_GAP_EVT_LESC_DHKEY_REQUEST event."]
#[doc = " @retval ::BLE_ERROR_INVALID_CONN_HANDLE Invalid connection handle supplied."]
#[inline(always)]
pub unsafe fn sd_ble_gap_lesc_dhkey_reply(conn_handle: u16, p_dhkey: *const ble_gap_lesc_dhkey_t) -> u32 {
    let ret: u32;
    core::arch::asm!("svc 129",
        inout("r0") to_asm(conn_handle) => ret,
        inout("r1") to_asm(p_dhkey) => _,
        lateout("r2") _,
        lateout("r3") _,
        lateout("r12") _,
    );
    ret
}

#[doc = "@brief Notify the peer of a local keypress."]
#[doc = ""]
#[doc = " @mscs"]
#[doc = " @mmsc{@ref BLE_GAP_PERIPH_LESC_BONDING_PKE_CD_MSC}"]
#[doc = " @mmsc{@ref BLE_GAP_CENTRAL_LESC_BONDING_PKE_CD_MSC}"]
#[doc = " @endmscs"]
#[doc = ""]
#[doc = " @param[in] conn_handle Connection handle."]
#[doc = " @param[in] kp_not See @ref BLE_GAP_KP_NOT_TYPES."]
#[doc = ""]
#[doc = " @retval ::NRF_SUCCESS Keypress notification successfully queued for transmission."]
#[doc = " @retval ::NRF_ERROR_INVALID_PARAM Invalid parameter(s) supplied."]
#[doc = " @retval ::NRF_ERROR_INVALID_STATE Invalid state to perform operation. Either:"]
#[doc = "                                   - Authentication key not requested."]
#[doc = "                                   - Passkey has not been entered."]
#[doc = "                                   - Keypresses have not been enabled by both peers."]
#[doc = " @retval ::BLE_ERROR_INVALID_CONN_HANDLE Invalid connection handle supplied."]
#[doc = " @retval ::NRF_ERROR_BUSY The BLE stack is busy. Retry at later time."]
#[inline(always)]
pub unsafe fn sd_ble_gap_keypress_notify(conn_handle: u16, kp_not: u8) -> u32 {
    let ret: u32;
    core::arch::asm!("svc 130",
        inout("r0") to_asm(conn_handle) => ret,
        inout("r1") to_asm(kp_not) => _,
        lateout("r2") _,
        lateout("r3") _,
        lateout("r12") _,
    );
    ret
}

#[doc = "@brief Generate a set of OOB data to send to a peer out of band."]
#[doc = ""]
#[doc = " @note  The @ref ble_gap_addr_t included in the OOB data returned will be the currently active one (or, if a connection has already been established,"]
#[doc = "        the one used during connection setup). The application may manually overwrite it with an updated value."]
#[doc = ""]
#[doc = " @mscs"]
#[doc = " @mmsc{@ref BLE_GAP_PERIPH_LESC_BONDING_OOB_MSC}"]
#[doc = " @mmsc{@ref BLE_GAP_CENTRAL_LESC_BONDING_OOB_MSC}"]
#[doc = " @endmscs"]
#[doc = ""]
#[doc = " @param[in] conn_handle Connection handle. Can be @ref BLE_CONN_HANDLE_INVALID if a BLE connection has not been established yet."]
#[doc = " @param[in] p_pk_own LE Secure Connections local P-256 Public Key."]
#[doc = " @param[out] p_oobd_own The OOB data to be sent out of band to a peer."]
#[doc = ""]
#[doc = " @retval ::NRF_SUCCESS OOB data successfully generated."]
#[doc = " @retval ::NRF_ERROR_INVALID_ADDR Invalid pointer supplied."]
#[doc = " @retval ::BLE_ERROR_INVALID_CONN_HANDLE Invalid connection handle supplied."]
#[inline(always)]
pub unsafe fn sd_ble_gap_lesc_oob_data_get(
    conn_handle: u16,
    p_pk_own: *const ble_gap_lesc_p256_pk_t,
    p_oobd_own: *mut ble_gap_lesc_oob_data_t,
) -> u32 {
    let ret: u32;
    core::arch::asm!("svc 131",
        inout("r0") to_asm(conn_handle) => ret,
        inout("r1") to_asm(p_pk_own) => _,
        inout("r2") to_asm(p_oobd_own) => _,
        lateout("r3") _,
        lateout("r12") _,
    );
    ret
}

#[doc = "@brief Provide the OOB data sent/received out of band."]
#[doc = ""]
#[doc = " @note  An authentication procedure with OOB selected as an algorithm must be in progress when calling this function."]
#[doc = " @note  A @ref BLE_GAP_EVT_LESC_DHKEY_REQUEST event with the oobd_req set to 1 must have been received prior to calling this function."]
#[doc = ""]
#[doc = " @events"]
#[doc = " @event{This function is used during authentication procedures\\, see the list of events in the documentation of @ref sd_ble_gap_authenticate.}"]
#[doc = " @endevents"]
#[doc = ""]
#[doc = " @mscs"]
#[doc = " @mmsc{@ref BLE_GAP_PERIPH_LESC_BONDING_OOB_MSC}"]
#[doc = " @mmsc{@ref BLE_GAP_CENTRAL_LESC_BONDING_OOB_MSC}"]
#[doc = " @endmscs"]
#[doc = ""]
#[doc = " @param[in] conn_handle Connection handle."]
#[doc = " @param[in] p_oobd_own The OOB data sent out of band to a peer or NULL if the peer has not received OOB data."]
#[doc = "                       Must correspond to @ref ble_gap_sec_params_t::oob flag in @ref BLE_GAP_EVT_SEC_PARAMS_REQUEST."]
#[doc = " @param[in] p_oobd_peer The OOB data received out of band from a peer or NULL if none received."]
#[doc = "                        Must correspond to @ref ble_gap_sec_params_t::oob flag"]
#[doc = "                        in @ref sd_ble_gap_authenticate in the central role or"]
#[doc = "                        in @ref sd_ble_gap_sec_params_reply in the peripheral role."]
#[doc = ""]
#[doc = " @retval ::NRF_SUCCESS OOB data accepted."]
#[doc = " @retval ::NRF_ERROR_INVALID_ADDR Invalid pointer supplied."]
#[doc = " @retval ::NRF_ERROR_INVALID_STATE Invalid state to perform operation. Either:"]
#[doc = "                                   - Authentication key not requested"]
#[doc = "                                   - Not expecting LESC OOB data"]
#[doc = "                                   - Have not actually exchanged passkeys."]
#[doc = " @retval ::BLE_ERROR_INVALID_CONN_HANDLE Invalid connection handle supplied."]
#[inline(always)]
pub unsafe fn sd_ble_gap_lesc_oob_data_set(
    conn_handle: u16,
    p_oobd_own: *const ble_gap_lesc_oob_data_t,
    p_oobd_peer: *const ble_gap_lesc_oob_data_t,
) -> u32 {
    let ret: u32;
    core::arch::asm!("svc 132",
        inout("r0") to_asm(conn_handle) => ret,
        inout("r1") to_asm(p_oobd_own) => _,
        inout("r2") to_asm(p_oobd_peer) => _,
        lateout("r3") _,
        lateout("r12") _,
    );
    ret
}

#[doc = "@brief Initiate GAP Encryption procedure."]
#[doc = ""]
#[doc = " @details In the central role, this function will initiate the encryption procedure using the encryption information provided."]
#[doc = ""]
#[doc = " @events"]
#[doc = " @event{@ref BLE_GAP_EVT_CONN_SEC_UPDATE, The connection security has been updated.}"]
#[doc = " @endevents"]
#[doc = ""]
#[doc = " @mscs"]
#[doc = " @mmsc{@ref BLE_GAP_CENTRAL_ENC_AUTH_MUTEX_MSC}"]
#[doc = " @mmsc{@ref BLE_GAP_CENTRAL_ENC_MSC}"]
#[doc = " @mmsc{@ref BLE_GAP_MULTILINK_CTRL_PROC_MSC}"]
#[doc = " @mmsc{@ref BLE_GAP_CENTRAL_SEC_REQ_MSC}"]
#[doc = " @endmscs"]
#[doc = ""]
#[doc = " @param[in] conn_handle Connection handle."]
#[doc = " @param[in] p_master_id Pointer to a @ref ble_gap_master_id_t master identification structure."]
#[doc = " @param[in] p_enc_info  Pointer to a @ref ble_gap_enc_info_t encryption information structure."]
#[doc = ""]
#[doc = " @retval ::NRF_SUCCESS Successfully initiated authentication procedure."]
#[doc = " @retval ::NRF_ERROR_INVALID_ADDR Invalid pointer supplied."]
#[doc = " @retval ::NRF_ERROR_INVALID_STATE No link has been established."]
#[doc = " @retval ::BLE_ERROR_INVALID_CONN_HANDLE Invalid connection handle supplied."]
#[doc = " @retval ::BLE_ERROR_INVALID_ROLE Operation is not supported in the Peripheral role."]
#[doc = " @retval ::NRF_ERROR_BUSY Procedure already in progress or not allowed at this time, wait for pending procedures to complete and retry."]
#[inline(always)]
pub unsafe fn sd_ble_gap_encrypt(
    conn_handle: u16,
    p_master_id: *const ble_gap_master_id_t,
    p_enc_info: *const ble_gap_enc_info_t,
) -> u32 {
    let ret: u32;
    core::arch::asm!("svc 133",
        inout("r0") to_asm(conn_handle) => ret,
        inout("r1") to_asm(p_master_id) => _,
        inout("r2") to_asm(p_enc_info) => _,
        lateout("r3") _,
        lateout("r12") _,
    );
    ret
}

#[doc = "@brief Reply with GAP security information."]
#[doc = ""]
#[doc = " @details This function is only used to reply to a @ref BLE_GAP_EVT_SEC_INFO_REQUEST, calling it at other times will result in @ref NRF_ERROR_INVALID_STATE."]
#[doc = " @note    If the call returns an error code, the request is still pending, and the reply call may be repeated with corrected parameters."]
#[doc = " @note    Data signing is not yet supported, and p_sign_info must therefore be NULL."]
#[doc = ""]
#[doc = " @mscs"]
#[doc = " @mmsc{@ref BLE_GAP_PERIPH_ENC_MSC}"]
#[doc = " @endmscs"]
#[doc = ""]
#[doc = " @param[in] conn_handle Connection handle."]
#[doc = " @param[in] p_enc_info Pointer to a @ref ble_gap_enc_info_t encryption information structure. May be NULL to signal none is available."]
#[doc = " @param[in] p_id_info Pointer to a @ref ble_gap_irk_t identity information structure. May be NULL to signal none is available."]
#[doc = " @param[in] p_sign_info Pointer to a @ref ble_gap_sign_info_t signing information structure. May be NULL to signal none is available."]
#[doc = ""]
#[doc = " @retval ::NRF_SUCCESS Successfully accepted security information."]
#[doc = " @retval ::NRF_ERROR_INVALID_PARAM Invalid parameter(s) supplied."]
#[doc = " @retval ::NRF_ERROR_INVALID_STATE Invalid state to perform operation. Either:"]
#[doc = "                                   - No link has been established."]
#[doc = "                                   - No @ref BLE_GAP_EVT_SEC_REQUEST pending."]
#[doc = "                                   - Encryption information provided by the app without being requested. See @ref ble_gap_evt_sec_info_request_t::enc_info."]
#[doc = " @retval ::BLE_ERROR_INVALID_CONN_HANDLE Invalid connection handle supplied."]
#[inline(always)]
pub unsafe fn sd_ble_gap_sec_info_reply(
    conn_handle: u16,
    p_enc_info: *const ble_gap_enc_info_t,
    p_id_info: *const ble_gap_irk_t,
    p_sign_info: *const ble_gap_sign_info_t,
) -> u32 {
    let ret: u32;
    core::arch::asm!("svc 134",
        inout("r0") to_asm(conn_handle) => ret,
        inout("r1") to_asm(p_enc_info) => _,
        inout("r2") to_asm(p_id_info) => _,
        inout("r3") to_asm(p_sign_info) => _,
        lateout("r12") _,
    );
    ret
}

#[doc = "@brief Get the current connection security."]
#[doc = ""]
#[doc = " @param[in]  conn_handle Connection handle."]
#[doc = " @param[out] p_conn_sec  Pointer to a @ref ble_gap_conn_sec_t structure to be filled in."]
#[doc = ""]
#[doc = " @retval ::NRF_SUCCESS Current connection security successfully retrieved."]
#[doc = " @retval ::NRF_ERROR_INVALID_ADDR Invalid pointer supplied."]
#[doc = " @retval ::BLE_ERROR_INVALID_CONN_HANDLE Invalid connection handle supplied."]
#[inline(always)]
pub unsafe fn sd_ble_gap_conn_sec_get(conn_handle: u16, p_conn_sec: *mut ble_gap_conn_sec_t) -> u32 {
    let ret: u32;
    core::arch::asm!("svc 135",
        inout("r0") to_asm(conn_handle) => ret,
        inout("r1") to_asm(p_conn_sec) => _,
        lateout("r2") _,
        lateout("r3") _,
        lateout("r12") _,
    );
    ret
}

#[doc = "@brief Start reporting the received signal strength to the application."]
#[doc = ""]
#[doc = "        A new event is reported whenever the RSSI value changes, until @ref sd_ble_gap_rssi_stop is called."]
#[doc = ""]
#[doc = " @events"]
#[doc = " @event{@ref BLE_GAP_EVT_RSSI_CHANGED, New RSSI data available. How often the event is generated is"]
#[doc = "                                       dependent on the settings of the <code>threshold_dbm</code>"]
#[doc = "                                       and <code>skip_count</code> input parameters.}"]
#[doc = " @endevents"]
#[doc = ""]
#[doc = " @mscs"]
#[doc = " @mmsc{@ref BLE_GAP_CENTRAL_RSSI_READ_MSC}"]
#[doc = " @mmsc{@ref BLE_GAP_RSSI_FILT_MSC}"]
#[doc = " @endmscs"]
#[doc = ""]
#[doc = " @param[in] conn_handle        Connection handle."]
#[doc = " @param[in] threshold_dbm      Minimum change in dBm before triggering the @ref BLE_GAP_EVT_RSSI_CHANGED event. Events are disabled if threshold_dbm equals @ref BLE_GAP_RSSI_THRESHOLD_INVALID."]
#[doc = " @param[in] skip_count         Number of RSSI samples with a change of threshold_dbm or more before sending a new @ref BLE_GAP_EVT_RSSI_CHANGED event."]
#[doc = ""]
#[doc = " @retval ::NRF_SUCCESS                   Successfully activated RSSI reporting."]
#[doc = " @retval ::NRF_ERROR_INVALID_STATE       RSSI reporting is already ongoing."]
#[doc = " @retval ::BLE_ERROR_INVALID_CONN_HANDLE Invalid connection handle supplied."]
#[inline(always)]
pub unsafe fn sd_ble_gap_rssi_start(conn_handle: u16, threshold_dbm: u8, skip_count: u8) -> u32 {
    let ret: u32;
    core::arch::asm!("svc 136",
        inout("r0") to_asm(conn_handle) => ret,
        inout("r1") to_asm(threshold_dbm) => _,
        inout("r2") to_asm(skip_count) => _,
        lateout("r3") _,
        lateout("r12") _,
    );
    ret
}

#[doc = "@brief Stop reporting the received signal strength."]
#[doc = ""]
#[doc = " @note  An RSSI change detected before the call but not yet received by the application"]
#[doc = "        may be reported after @ref sd_ble_gap_rssi_stop has been called."]
#[doc = ""]
#[doc = " @mscs"]
#[doc = " @mmsc{@ref BLE_GAP_CENTRAL_RSSI_READ_MSC}"]
#[doc = " @mmsc{@ref BLE_GAP_RSSI_FILT_MSC}"]
#[doc = " @endmscs"]
#[doc = ""]
#[doc = " @param[in] conn_handle Connection handle."]
#[doc = ""]
#[doc = " @retval ::NRF_SUCCESS                   Successfully deactivated RSSI reporting."]
#[doc = " @retval ::NRF_ERROR_INVALID_STATE       RSSI reporting is not ongoing."]
#[doc = " @retval ::BLE_ERROR_INVALID_CONN_HANDLE Invalid connection handle supplied."]
#[inline(always)]
pub unsafe fn sd_ble_gap_rssi_stop(conn_handle: u16) -> u32 {
    let ret: u32;
    core::arch::asm!("svc 137",
        inout("r0") to_asm(conn_handle) => ret,
        lateout("r1") _,
        lateout("r2") _,
        lateout("r3") _,
        lateout("r12") _,
    );
    ret
}

#[doc = "@brief Get the received signal strength for the last connection event."]
#[doc = ""]
#[doc = "        @ref sd_ble_gap_rssi_start must be called to start reporting RSSI before using this function. @ref NRF_ERROR_NOT_FOUND"]
#[doc = "        will be returned until RSSI was sampled for the first time after calling @ref sd_ble_gap_rssi_start."]
#[doc = " @note ERRATA-153 requires the rssi sample to be compensated based on a temperature measurement."]
#[doc = " @mscs"]
#[doc = " @mmsc{@ref BLE_GAP_CENTRAL_RSSI_READ_MSC}"]
#[doc = " @endmscs"]
#[doc = ""]
#[doc = " @param[in]  conn_handle Connection handle."]
#[doc = " @param[out] p_rssi      Pointer to the location where the RSSI measurement shall be stored."]
#[doc = " @param[out] p_ch_index  Pointer to the location where Channel Index for the RSSI measurement shall be stored."]
#[doc = ""]
#[doc = " @retval ::NRF_SUCCESS                   Successfully read the RSSI."]
#[doc = " @retval ::NRF_ERROR_NOT_FOUND           No sample is available."]
#[doc = " @retval ::NRF_ERROR_INVALID_ADDR        Invalid pointer supplied."]
#[doc = " @retval ::BLE_ERROR_INVALID_CONN_HANDLE Invalid connection handle supplied."]
#[doc = " @retval ::NRF_ERROR_INVALID_STATE       RSSI reporting is not ongoing."]
#[inline(always)]
pub unsafe fn sd_ble_gap_rssi_get(conn_handle: u16, p_rssi: *mut i8, p_ch_index: *mut u8) -> u32 {
    let ret: u32;
    core::arch::asm!("svc 142",
        inout("r0") to_asm(conn_handle) => ret,
        inout("r1") to_asm(p_rssi) => _,
        inout("r2") to_asm(p_ch_index) => _,
        lateout("r3") _,
        lateout("r12") _,
    );
    ret
}

#[doc = "@brief Start or continue scanning (GAP Discovery procedure, Observer Procedure)."]
#[doc = ""]
#[doc = " @note    A call to this function will require the application to keep the memory pointed by"]
#[doc = "          p_adv_report_buffer alive until the buffer is released. The buffer is released when the scanner is stopped"]
#[doc = "          or when this function is called with another buffer."]
#[doc = ""]
#[doc = " @note    The scanner will automatically stop in the following cases:"]
#[doc = "           - @ref sd_ble_gap_scan_stop is called."]
#[doc = "           - @ref sd_ble_gap_connect is called."]
#[doc = "           - A @ref BLE_GAP_EVT_TIMEOUT with source set to @ref BLE_GAP_TIMEOUT_SRC_SCAN is received."]
#[doc = "           - When a @ref BLE_GAP_EVT_ADV_REPORT event is received and @ref ble_gap_adv_report_type_t::status is not set to"]
#[doc = "             @ref BLE_GAP_ADV_DATA_STATUS_INCOMPLETE_MORE_DATA. In this case scanning is only paused to let the application"]
#[doc = "             access received data. The application must call this function to continue scanning, or call @ref sd_ble_gap_scan_stop"]
#[doc = "             to stop scanning."]
#[doc = ""]
#[doc = " @note    If a @ref BLE_GAP_EVT_ADV_REPORT event is received with @ref ble_gap_adv_report_type_t::status set to"]
#[doc = "          @ref BLE_GAP_ADV_DATA_STATUS_INCOMPLETE_MORE_DATA, the scanner will continue scanning, and the application will"]
#[doc = "          receive more reports from this advertising event. The following reports will include the old and new received data."]
#[doc = ""]
#[doc = " @events"]
#[doc = " @event{@ref BLE_GAP_EVT_ADV_REPORT, An advertising or scan response packet has been received.}"]
#[doc = " @event{@ref BLE_GAP_EVT_TIMEOUT, Scanner has timed out.}"]
#[doc = " @endevents"]
#[doc = ""]
#[doc = " @mscs"]
#[doc = " @mmsc{@ref BLE_GAP_SCAN_MSC}"]
#[doc = " @mmsc{@ref BLE_GAP_WL_SHARE_MSC}"]
#[doc = " @endmscs"]
#[doc = ""]
#[doc = " @param[in] p_scan_params       Pointer to scan parameters structure. When this function is used to continue"]
#[doc = "                                scanning, this parameter must be NULL."]
#[doc = " @param[in] p_adv_report_buffer Pointer to buffer used to store incoming advertising data."]
#[doc = "                                The memory pointed to should be kept alive until the scanning is stopped."]
#[doc = "                                See @ref BLE_GAP_SCAN_BUFFER_SIZE for minimum and maximum buffer size."]
#[doc = "                                If the scanner receives advertising data larger than can be stored in the buffer,"]
#[doc = "                                a @ref BLE_GAP_EVT_ADV_REPORT will be raised with @ref ble_gap_adv_report_type_t::status"]
#[doc = "                                set to @ref BLE_GAP_ADV_DATA_STATUS_INCOMPLETE_TRUNCATED."]
#[doc = ""]
#[doc = " @retval ::NRF_SUCCESS Successfully initiated scanning procedure."]
#[doc = " @retval ::NRF_ERROR_INVALID_ADDR Invalid pointer supplied."]
#[doc = " @retval ::NRF_ERROR_INVALID_STATE Invalid state to perform operation. Either:"]
#[doc = "                                   - Scanning is already ongoing and p_scan_params was not NULL"]
#[doc = "                                   - Scanning is not running and p_scan_params was NULL."]
#[doc = "                                   - The scanner has timed out when this function is called to continue scanning."]
#[doc = " @retval ::NRF_ERROR_INVALID_PARAM Invalid parameter(s) supplied. See @ref ble_gap_scan_params_t."]
#[doc = " @retval ::NRF_ERROR_NOT_SUPPORTED Unsupported parameters supplied. See @ref ble_gap_scan_params_t."]
#[doc = " @retval ::NRF_ERROR_INVALID_LENGTH The provided buffer length is invalid. See @ref BLE_GAP_SCAN_BUFFER_MIN."]
#[doc = " @retval ::NRF_ERROR_RESOURCES Not enough BLE role slots available."]
#[doc = "                               Stop one or more currently active roles (Central, Peripheral or Broadcaster) and try again"]
#[inline(always)]
pub unsafe fn sd_ble_gap_scan_start(
    p_scan_params: *const ble_gap_scan_params_t,
    p_adv_report_buffer: *const ble_data_t,
) -> u32 {
    let ret: u32;
    core::arch::asm!("svc 138",
        inout("r0") to_asm(p_scan_params) => ret,
        inout("r1") to_asm(p_adv_report_buffer) => _,
        lateout("r2") _,
        lateout("r3") _,
        lateout("r12") _,
    );
    ret
}

#[doc = "@brief Stop scanning (GAP Discovery procedure, Observer Procedure)."]
#[doc = ""]
#[doc = " @note The buffer provided in @ref sd_ble_gap_scan_start is released."]
#[doc = ""]
#[doc = " @mscs"]
#[doc = " @mmsc{@ref BLE_GAP_SCAN_MSC}"]
#[doc = " @mmsc{@ref BLE_GAP_WL_SHARE_MSC}"]
#[doc = " @endmscs"]
#[doc = ""]
#[doc = " @retval ::NRF_SUCCESS Successfully stopped scanning procedure."]
#[doc = " @retval ::NRF_ERROR_INVALID_STATE Not in the scanning state."]
#[inline(always)]
pub unsafe fn sd_ble_gap_scan_stop() -> u32 {
    let ret: u32;
    core::arch::asm!("svc 139",
        lateout("r0") ret,
        lateout("r1") _,
        lateout("r2") _,
        lateout("r3") _,
        lateout("r12") _,
    );
    ret
}

#[doc = "@brief Create a connection (GAP Link Establishment)."]
#[doc = ""]
#[doc = " @note If a scanning procedure is currently in progress it will be automatically stopped when calling this function."]
#[doc = "       The scanning procedure will be stopped even if the function returns an error."]
#[doc = ""]
#[doc = " @events"]
#[doc = " @event{@ref BLE_GAP_EVT_CONNECTED, A connection was established.}"]
#[doc = " @event{@ref BLE_GAP_EVT_TIMEOUT, Failed to establish a connection.}"]
#[doc = " @endevents"]
#[doc = ""]
#[doc = " @mscs"]
#[doc = " @mmsc{@ref BLE_GAP_WL_SHARE_MSC}"]
#[doc = " @mmsc{@ref BLE_GAP_CENTRAL_CONN_PRIV_MSC}"]
#[doc = " @mmsc{@ref BLE_GAP_CENTRAL_CONN_MSC}"]
#[doc = " @endmscs"]
#[doc = ""]
#[doc = " @param[in] p_peer_addr   Pointer to peer identity address. If @ref ble_gap_scan_params_t::filter_policy is set to use"]
#[doc = "                          whitelist, then p_peer_addr is ignored."]
#[doc = " @param[in] p_scan_params Pointer to scan parameters structure."]
#[doc = " @param[in] p_conn_params Pointer to desired connection parameters."]
#[doc = " @param[in] conn_cfg_tag  Tag identifying a configuration set by @ref sd_ble_cfg_set or"]
#[doc = "                          @ref BLE_CONN_CFG_TAG_DEFAULT to use the default connection configuration."]
#[doc = ""]
#[doc = " @retval ::NRF_SUCCESS Successfully initiated connection procedure."]
#[doc = " @retval ::NRF_ERROR_INVALID_ADDR Invalid parameter(s) pointer supplied."]
#[doc = " @retval ::NRF_ERROR_INVALID_PARAM Invalid parameter(s) supplied."]
#[doc = "                                   - Invalid parameter(s) in p_scan_params or p_conn_params."]
#[doc = "                                   - Use of whitelist requested but whitelist has not been set, see @ref sd_ble_gap_whitelist_set."]
#[doc = "                                   - Peer address was not present in the device identity list, see @ref sd_ble_gap_device_identities_set."]
#[doc = " @retval ::NRF_ERROR_NOT_FOUND conn_cfg_tag not found."]
#[doc = " @retval ::NRF_ERROR_INVALID_STATE The SoftDevice is in an invalid state to perform this operation. This may be due to an"]
#[doc = "                                   existing locally initiated connect procedure, which must complete before initiating again."]
#[doc = " @retval ::BLE_ERROR_GAP_INVALID_BLE_ADDR Invalid Peer address."]
#[doc = " @retval ::NRF_ERROR_CONN_COUNT The limit of available connections for this connection configuration tag has been reached."]
#[doc = "                                To increase the number of available connections,"]
#[doc = "                                use @ref sd_ble_cfg_set with @ref BLE_GAP_CFG_ROLE_COUNT or @ref BLE_CONN_CFG_GAP."]
#[doc = " @retval ::NRF_ERROR_RESOURCES Either:"]
#[doc = "                                 - Not enough BLE role slots available."]
#[doc = "                                   Stop one or more currently active roles (Central, Peripheral or Observer) and try again."]
#[doc = "                                 - The event_length parameter associated with conn_cfg_tag is too small to be able to"]
#[doc = "                                   establish a connection on the selected @ref ble_gap_scan_params_t::scan_phys."]
#[doc = "                                   Use @ref sd_ble_cfg_set to increase the event length."]
#[inline(always)]
pub unsafe fn sd_ble_gap_connect(
    p_peer_addr: *const ble_gap_addr_t,
    p_scan_params: *const ble_gap_scan_params_t,
    p_conn_params: *const ble_gap_conn_params_t,
    conn_cfg_tag: u8,
) -> u32 {
    let ret: u32;
    core::arch::asm!("svc 140",
        inout("r0") to_asm(p_peer_addr) => ret,
        inout("r1") to_asm(p_scan_params) => _,
        inout("r2") to_asm(p_conn_params) => _,
        inout("r3") to_asm(conn_cfg_tag) => _,
        lateout("r12") _,
    );
    ret
}

#[doc = "@brief Cancel a connection establishment."]
#[doc = ""]
#[doc = " @mscs"]
#[doc = " @mmsc{@ref BLE_GAP_CENTRAL_CONN_MSC}"]
#[doc = " @endmscs"]
#[doc = ""]
#[doc = " @retval ::NRF_SUCCESS Successfully canceled an ongoing connection procedure."]
#[doc = " @retval ::NRF_ERROR_INVALID_STATE No locally initiated connect procedure started or connection"]
#[doc = "                                   completed occurred."]
#[inline(always)]
pub unsafe fn sd_ble_gap_connect_cancel() -> u32 {
    let ret: u32;
    core::arch::asm!("svc 141",
        lateout("r0") ret,
        lateout("r1") _,
        lateout("r2") _,
        lateout("r3") _,
        lateout("r12") _,
    );
    ret
}

#[doc = "@brief Initiate or respond to a PHY Update Procedure"]
#[doc = ""]
#[doc = " @details   This function is used to initiate or respond to a PHY Update Procedure. It will always"]
#[doc = "            generate a @ref BLE_GAP_EVT_PHY_UPDATE event if successfully executed."]
#[doc = "            If this function is used to initiate a PHY Update procedure and the only option"]
#[doc = "            provided in @ref ble_gap_phys_t::tx_phys and @ref ble_gap_phys_t::rx_phys is the"]
#[doc = "            currently active PHYs in the respective directions, the SoftDevice will generate a"]
#[doc = "            @ref BLE_GAP_EVT_PHY_UPDATE with the current PHYs set and will not initiate the"]
#[doc = "            procedure in the Link Layer."]
#[doc = ""]
#[doc = "            If @ref ble_gap_phys_t::tx_phys or @ref ble_gap_phys_t::rx_phys is @ref BLE_GAP_PHY_AUTO,"]
#[doc = "            then the stack will select PHYs based on the peer's PHY preferences and the local link"]
#[doc = "            configuration. The PHY Update procedure will for this case result in a PHY combination"]
#[doc = "            that respects the time constraints configured with @ref sd_ble_cfg_set and the current"]
#[doc = "            link layer data length."]
#[doc = ""]
#[doc = "            When acting as a central, the SoftDevice will select the fastest common PHY in each direction."]
#[doc = ""]
#[doc = "            If the peer does not support the PHY Update Procedure, then the resulting"]
#[doc = "            @ref BLE_GAP_EVT_PHY_UPDATE event will have a status set to"]
#[doc = "            @ref BLE_HCI_UNSUPPORTED_REMOTE_FEATURE."]
#[doc = ""]
#[doc = "            If the PHY Update procedure was rejected by the peer due to a procedure collision, the status"]
#[doc = "            will be @ref BLE_HCI_STATUS_CODE_LMP_ERROR_TRANSACTION_COLLISION or"]
#[doc = "            @ref BLE_HCI_DIFFERENT_TRANSACTION_COLLISION."]
#[doc = "            If the peer responds to the PHY Update procedure with invalid parameters, the status"]
#[doc = "            will be @ref BLE_HCI_STATUS_CODE_INVALID_LMP_PARAMETERS."]
#[doc = "            If the PHY Update procedure was rejected by the peer for a different reason, the status will"]
#[doc = "            contain the reason as specified by the peer."]
#[doc = ""]
#[doc = " @events"]
#[doc = " @event{@ref BLE_GAP_EVT_PHY_UPDATE, Result of the PHY Update Procedure.}"]
#[doc = " @endevents"]
#[doc = ""]
#[doc = " @mscs"]
#[doc = " @mmsc{@ref BLE_GAP_CENTRAL_PHY_UPDATE}"]
#[doc = " @mmsc{@ref BLE_GAP_PERIPHERAL_PHY_UPDATE}"]
#[doc = " @endmscs"]
#[doc = ""]
#[doc = " @param[in] conn_handle   Connection handle to indicate the connection for which the PHY Update is requested."]
#[doc = " @param[in] p_gap_phys    Pointer to PHY structure."]
#[doc = ""]
#[doc = " @retval ::NRF_SUCCESS Successfully requested a PHY Update."]
#[doc = " @retval ::NRF_ERROR_INVALID_ADDR Invalid pointer supplied."]
#[doc = " @retval ::BLE_ERROR_INVALID_CONN_HANDLE Invalid connection handle supplied."]
#[doc = " @retval ::NRF_ERROR_INVALID_PARAM Invalid parameter(s) supplied."]
#[doc = " @retval ::NRF_ERROR_INVALID_STATE No link has been established."]
#[doc = " @retval ::NRF_ERROR_RESOURCES The connection event length configured for this link is not sufficient for the combination of"]
#[doc = "                               @ref ble_gap_phys_t::tx_phys, @ref ble_gap_phys_t::rx_phys, and @ref ble_gap_data_length_params_t."]
#[doc = "                               The connection event length is configured with @ref BLE_CONN_CFG_GAP using @ref sd_ble_cfg_set."]
#[doc = " @retval ::NRF_ERROR_BUSY Procedure is already in progress or not allowed at this time. Process pending events and wait for the pending procedure to complete and retry."]
#[doc = ""]
#[inline(always)]
pub unsafe fn sd_ble_gap_phy_update(conn_handle: u16, p_gap_phys: *const ble_gap_phys_t) -> u32 {
    let ret: u32;
    core::arch::asm!("svc 143",
        inout("r0") to_asm(conn_handle) => ret,
        inout("r1") to_asm(p_gap_phys) => _,
        lateout("r2") _,
        lateout("r3") _,
        lateout("r12") _,
    );
    ret
}

#[doc = "@brief Initiate or respond to a Data Length Update Procedure."]
#[doc = ""]
#[doc = " @note If the application uses @ref BLE_GAP_DATA_LENGTH_AUTO for one or more members of"]
#[doc = "       p_dl_params, the SoftDevice will choose the highest value supported in current"]
#[doc = "       configuration and connection parameters."]
#[doc = " @note  If the link PHY is Coded, the SoftDevice will ensure that the MaxTxTime and/or MaxRxTime"]
#[doc = "        used in the Data Length Update procedure is at least 2704 us. Otherwise, MaxTxTime and"]
#[doc = "        MaxRxTime will be limited to maximum 2120 us."]
#[doc = ""]
#[doc = " @param[in]   conn_handle       Connection handle."]
#[doc = " @param[in]   p_dl_params       Pointer to local parameters to be used in Data Length Update"]
#[doc = "                                Procedure. Set any member to @ref BLE_GAP_DATA_LENGTH_AUTO to let"]
#[doc = "                                the SoftDevice automatically decide the value for that member."]
#[doc = "                                Set to NULL to use automatic values for all members."]
#[doc = " @param[out]  p_dl_limitation   Pointer to limitation to be written when local device does not"]
#[doc = "                                have enough resources or does not support the requested Data Length"]
#[doc = "                                Update parameters. Ignored if NULL."]
#[doc = ""]
#[doc = " @mscs"]
#[doc = " @mmsc{@ref BLE_GAP_DATA_LENGTH_UPDATE_PROCEDURE_MSC}"]
#[doc = " @endmscs"]
#[doc = ""]
#[doc = " @retval ::NRF_SUCCESS Successfully set Data Length Extension initiation/response parameters."]
#[doc = " @retval ::NRF_ERROR_INVALID_ADDR Invalid pointer supplied."]
#[doc = " @retval ::BLE_ERROR_INVALID_CONN_HANDLE Invalid connection handle parameter supplied."]
#[doc = " @retval ::NRF_ERROR_INVALID_STATE No link has been established."]
#[doc = " @retval ::NRF_ERROR_INVALID_PARAM Invalid parameters supplied."]
#[doc = " @retval ::NRF_ERROR_NOT_SUPPORTED The requested parameters are not supported by the SoftDevice. Inspect"]
#[doc = "                                   p_dl_limitation to see which parameter is not supported."]
#[doc = " @retval ::NRF_ERROR_RESOURCES The connection event length configured for this link is not sufficient for the requested parameters."]
#[doc = "                               Use @ref sd_ble_cfg_set with @ref BLE_CONN_CFG_GAP to increase the connection event length."]
#[doc = "                               Inspect p_dl_limitation to see where the limitation is."]
#[doc = " @retval ::NRF_ERROR_BUSY Peer has already initiated a Data Length Update Procedure. Process the"]
#[doc = "                          pending @ref BLE_GAP_EVT_DATA_LENGTH_UPDATE_REQUEST event to respond."]
#[inline(always)]
pub unsafe fn sd_ble_gap_data_length_update(
    conn_handle: u16,
    p_dl_params: *const ble_gap_data_length_params_t,
    p_dl_limitation: *mut ble_gap_data_length_limitation_t,
) -> u32 {
    let ret: u32;
    core::arch::asm!("svc 144",
        inout("r0") to_asm(conn_handle) => ret,
        inout("r1") to_asm(p_dl_params) => _,
        inout("r2") to_asm(p_dl_limitation) => _,
        lateout("r3") _,
        lateout("r12") _,
    );
    ret
}

#[doc = "@brief   Start the Quality of Service (QoS) channel survey module."]
#[doc = ""]
#[doc = " @details The channel survey module provides measurements of the energy levels on"]
#[doc = "          the Bluetooth Low Energy channels. When the module is enabled, @ref BLE_GAP_EVT_QOS_CHANNEL_SURVEY_REPORT"]
#[doc = "          events will periodically report the measured energy levels for each channel."]
#[doc = ""]
#[doc = " @note    The measurements are scheduled with lower priority than other Bluetooth Low Energy roles,"]
#[doc = "          Radio Timeslot API events and Flash API events."]
#[doc = ""]
#[doc = " @note    The channel survey module will attempt to do measurements so that the average interval"]
#[doc = "          between measurements will be interval_us. However due to the channel survey module"]
#[doc = "          having the lowest priority of all roles and modules, this may not be possible. In that"]
#[doc = "          case fewer than expected channel survey reports may be given."]
#[doc = ""]
#[doc = " @note    In order to use the channel survey module, @ref ble_gap_cfg_role_count_t::qos_channel_survey_role_available"]
#[doc = "          must be set. This is done using @ref sd_ble_cfg_set."]
#[doc = ""]
#[doc = " @param[in]   interval_us      Requested average interval for the measurements and reports. See"]
#[doc = "                               @ref BLE_GAP_QOS_CHANNEL_SURVEY_INTERVALS for valid ranges. If set"]
#[doc = "                               to @ref BLE_GAP_QOS_CHANNEL_SURVEY_INTERVAL_CONTINUOUS, the channel"]
#[doc = "                               survey role will be scheduled at every available opportunity."]
#[doc = ""]
#[doc = " @retval ::NRF_SUCCESS             The module is successfully started."]
#[doc = " @retval ::NRF_ERROR_INVALID_PARAM Invalid parameter supplied. interval_us is out of the"]
#[doc = "                                   allowed range."]
#[doc = " @retval ::NRF_ERROR_INVALID_STATE Trying to start the module when already running."]
#[doc = " @retval ::NRF_ERROR_RESOURCES     The channel survey module is not available to the application."]
#[doc = "                                   Set @ref ble_gap_cfg_role_count_t::qos_channel_survey_role_available using"]
#[doc = "                                   @ref sd_ble_cfg_set."]
#[inline(always)]
pub unsafe fn sd_ble_gap_qos_channel_survey_start(interval_us: u32) -> u32 {
    let ret: u32;
    core::arch::asm!("svc 145",
        inout("r0") to_asm(interval_us) => ret,
        lateout("r1") _,
        lateout("r2") _,
        lateout("r3") _,
        lateout("r12") _,
    );
    ret
}

#[doc = "@brief   Stop the Quality of Service (QoS) channel survey module."]
#[doc = ""]
#[doc = " @note    The SoftDevice may generate one @ref BLE_GAP_EVT_QOS_CHANNEL_SURVEY_REPORT event after this"]
#[doc = "          function is called."]
#[doc = ""]
#[doc = " @retval ::NRF_SUCCESS             The module is successfully stopped."]
#[doc = " @retval ::NRF_ERROR_INVALID_STATE Trying to stop the module when it is not running."]
#[inline(always)]
pub unsafe fn sd_ble_gap_qos_channel_survey_stop() -> u32 {
    let ret: u32;
    core::arch::asm!("svc 146",
        lateout("r0") ret,
        lateout("r1") _,
        lateout("r2") _,
        lateout("r3") _,
        lateout("r12") _,
    );
    ret
}

#[doc = "@brief   Obtain the next connection event counter value."]
#[doc = ""]
#[doc = " @details The connection event counter is initialized to zero on the first connection event. The value is incremented"]
#[doc = "          by one for each connection event. For more information see Bluetooth Core Specification v5.0, Vol 6, Part B,"]
#[doc = "          Section 4.5.1."]
#[doc = ""]
#[doc = " @note    The connection event counter obtained through this API will be outdated if this API is called"]
#[doc = "          at the same time as the connection event counter is incremented."]
#[doc = ""]
#[doc = " @note    This API will always return the last connection event counter + 1."]
#[doc = "          The actual connection event may be multiple connection events later if:"]
#[doc = "           - Slave latency is enabled and there is no data to transmit or receive."]
#[doc = "           - Another role is scheduled with a higher priority at the same time as the next connection event."]
#[doc = ""]
#[doc = " @param[in]   conn_handle       Connection handle."]
#[doc = " @param[out]  p_counter         Pointer to the variable where the next connection event counter will be written."]
#[doc = ""]
#[doc = " @retval ::NRF_SUCCESS                   The connection event counter was successfully retrieved."]
#[doc = " @retval ::BLE_ERROR_INVALID_CONN_HANDLE Invalid connection handle parameter supplied."]
#[doc = " @retval ::NRF_ERROR_INVALID_ADDR        Invalid pointer supplied."]
#[inline(always)]
pub unsafe fn sd_ble_gap_next_conn_evt_counter_get(conn_handle: u16, p_counter: *mut u16) -> u32 {
    let ret: u32;
    core::arch::asm!("svc 148",
        inout("r0") to_asm(conn_handle) => ret,
        inout("r1") to_asm(p_counter) => _,
        lateout("r2") _,
        lateout("r3") _,
        lateout("r12") _,
    );
    ret
}

#[doc = "@brief   Start triggering a given task on connection event start."]
#[doc = ""]
#[doc = " @details When enabled, this feature will trigger a PPI task at the start of connection events."]
#[doc = "          The application can configure the SoftDevice to trigger every N connection events starting from"]
#[doc = "          a given connection event counter. See also @ref ble_gap_conn_event_trigger_t."]
#[doc = ""]
#[doc = " @param[in]   conn_handle   Connection handle."]
#[doc = " @param[in]   p_params      Connection event trigger parameters."]
#[doc = ""]
#[doc = " @retval ::NRF_SUCCESS                   Success."]
#[doc = " @retval ::BLE_ERROR_INVALID_CONN_HANDLE Invalid connection handle supplied."]
#[doc = " @retval ::NRF_ERROR_INVALID_ADDR        Invalid pointer supplied."]
#[doc = " @retval ::NRF_ERROR_INVALID_PARAM       Invalid parameter supplied. See @ref ble_gap_conn_event_trigger_t."]
#[doc = " @retval ::NRF_ERROR_INVALID_STATE       Either:"]
#[doc = "                                         - Trying to start connection event triggering when it is already ongoing."]
#[doc = "                                         - @ref ble_gap_conn_event_trigger_t::conn_evt_counter_start is in the past."]
#[doc = "                                           Use @ref sd_ble_gap_next_conn_evt_counter_get to find a new value"]
#[doc = "to be used as ble_gap_conn_event_trigger_t::conn_evt_counter_start."]
#[inline(always)]
pub unsafe fn sd_ble_gap_conn_evt_trigger_start(
    conn_handle: u16,
    p_params: *const ble_gap_conn_event_trigger_t,
) -> u32 {
    let ret: u32;
    core::arch::asm!("svc 149",
        inout("r0") to_asm(conn_handle) => ret,
        inout("r1") to_asm(p_params) => _,
        lateout("r2") _,
        lateout("r3") _,
        lateout("r12") _,
    );
    ret
}

#[doc = "@brief   Stop triggering the task configured using @ref sd_ble_gap_conn_evt_trigger_start."]
#[doc = ""]
#[doc = " @param[in]   conn_handle   Connection handle."]
#[doc = ""]
#[doc = " @retval ::NRF_SUCCESS                   Success."]
#[doc = " @retval ::BLE_ERROR_INVALID_CONN_HANDLE Invalid connection handle supplied."]
#[doc = " @retval ::NRF_ERROR_INVALID_STATE       Trying to stop connection event triggering when it is not enabled."]
#[inline(always)]
pub unsafe fn sd_ble_gap_conn_evt_trigger_stop(conn_handle: u16) -> u32 {
    let ret: u32;
    core::arch::asm!("svc 150",
        inout("r0") to_asm(conn_handle) => ret,
        lateout("r1") _,
        lateout("r2") _,
        lateout("r3") _,
        lateout("r12") _,
    );
    ret
}

#[doc = "< Set up an L2CAP channel."]
pub const BLE_L2CAP_SVCS_SD_BLE_L2CAP_CH_SETUP: BLE_L2CAP_SVCS = 184;
#[doc = "< Release an L2CAP channel."]
pub const BLE_L2CAP_SVCS_SD_BLE_L2CAP_CH_RELEASE: BLE_L2CAP_SVCS = 185;
#[doc = "< Receive an SDU on an L2CAP channel."]
pub const BLE_L2CAP_SVCS_SD_BLE_L2CAP_CH_RX: BLE_L2CAP_SVCS = 186;
#[doc = "< Transmit an SDU on an L2CAP channel."]
pub const BLE_L2CAP_SVCS_SD_BLE_L2CAP_CH_TX: BLE_L2CAP_SVCS = 187;
#[doc = "< Advanced SDU reception flow control."]
pub const BLE_L2CAP_SVCS_SD_BLE_L2CAP_CH_FLOW_CONTROL: BLE_L2CAP_SVCS = 188;
#[doc = "@brief L2CAP API SVC numbers."]
pub type BLE_L2CAP_SVCS = self::c_uint;
#[doc = "< L2CAP Channel Setup Request event."]
#[doc = "\\n See @ref ble_l2cap_evt_ch_setup_request_t."]
pub const BLE_L2CAP_EVTS_BLE_L2CAP_EVT_CH_SETUP_REQUEST: BLE_L2CAP_EVTS = 112;
#[doc = "< L2CAP Channel Setup Refused event."]
#[doc = "\\n See @ref ble_l2cap_evt_ch_setup_refused_t."]
pub const BLE_L2CAP_EVTS_BLE_L2CAP_EVT_CH_SETUP_REFUSED: BLE_L2CAP_EVTS = 113;
#[doc = "< L2CAP Channel Setup Completed event."]
#[doc = "\\n See @ref ble_l2cap_evt_ch_setup_t."]
pub const BLE_L2CAP_EVTS_BLE_L2CAP_EVT_CH_SETUP: BLE_L2CAP_EVTS = 114;
#[doc = "< L2CAP Channel Released event."]
#[doc = "\\n No additional event structure applies."]
pub const BLE_L2CAP_EVTS_BLE_L2CAP_EVT_CH_RELEASED: BLE_L2CAP_EVTS = 115;
#[doc = "< L2CAP Channel SDU data buffer released event."]
#[doc = "\\n See @ref ble_l2cap_evt_ch_sdu_buf_released_t."]
pub const BLE_L2CAP_EVTS_BLE_L2CAP_EVT_CH_SDU_BUF_RELEASED: BLE_L2CAP_EVTS = 116;
#[doc = "< L2CAP Channel Credit received."]
#[doc = "\\n See @ref ble_l2cap_evt_ch_credit_t."]
pub const BLE_L2CAP_EVTS_BLE_L2CAP_EVT_CH_CREDIT: BLE_L2CAP_EVTS = 117;
#[doc = "< L2CAP Channel SDU received."]
#[doc = "\\n See @ref ble_l2cap_evt_ch_rx_t."]
pub const BLE_L2CAP_EVTS_BLE_L2CAP_EVT_CH_RX: BLE_L2CAP_EVTS = 118;
#[doc = "< L2CAP Channel SDU transmitted."]
#[doc = "\\n See @ref ble_l2cap_evt_ch_tx_t."]
pub const BLE_L2CAP_EVTS_BLE_L2CAP_EVT_CH_TX: BLE_L2CAP_EVTS = 119;
#[doc = "@brief L2CAP Event IDs."]
pub type BLE_L2CAP_EVTS = self::c_uint;
#[doc = " @brief BLE L2CAP connection configuration parameters, set with @ref sd_ble_cfg_set."]
#[doc = ""]
#[doc = " @note  These parameters are set per connection, so all L2CAP channels created on this connection"]
#[doc = "        will have the same parameters."]
#[doc = ""]
#[doc = " @retval ::NRF_ERROR_INVALID_PARAM  One or more of the following is true:"]
#[doc = "                                    - rx_mps is smaller than @ref BLE_L2CAP_MPS_MIN."]
#[doc = "                                    - tx_mps is smaller than @ref BLE_L2CAP_MPS_MIN."]
#[doc = "                                    - ch_count is greater than @ref BLE_L2CAP_CH_COUNT_MAX."]
#[doc = " @retval ::NRF_ERROR_NO_MEM         rx_mps or tx_mps is set too high."]
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct ble_l2cap_conn_cfg_t {
    #[doc = "< The maximum L2CAP PDU payload size, in bytes, that L2CAP shall"]
    #[doc = "be able to receive on L2CAP channels on connections with this"]
    #[doc = "configuration. The minimum value is @ref BLE_L2CAP_MPS_MIN."]
    pub rx_mps: u16,
    #[doc = "< The maximum L2CAP PDU payload size, in bytes, that L2CAP shall"]
    #[doc = "be able to transmit on L2CAP channels on connections with this"]
    #[doc = "configuration. The minimum value is @ref BLE_L2CAP_MPS_MIN."]
    pub tx_mps: u16,
    #[doc = "< Number of SDU data buffers that can be queued for reception per"]
    #[doc = "L2CAP channel. The minimum value is one."]
    pub rx_queue_size: u8,
    #[doc = "< Number of SDU data buffers that can be queued for transmission"]
    #[doc = "per L2CAP channel. The minimum value is one."]
    pub tx_queue_size: u8,
    #[doc = "< Number of L2CAP channels the application can create per connection"]
    #[doc = "with this configuration. The default value is zero, the maximum"]
    #[doc = "value is @ref BLE_L2CAP_CH_COUNT_MAX."]
    #[doc = "@note if this parameter is set to zero, all other parameters in"]
    #[doc = "@ref ble_l2cap_conn_cfg_t are ignored."]
    pub ch_count: u8,
}
#[test]
fn bindgen_test_layout_ble_l2cap_conn_cfg_t() {
    assert_eq!(
        ::core::mem::size_of::<ble_l2cap_conn_cfg_t>(),
        8usize,
        concat!("Size of: ", stringify!(ble_l2cap_conn_cfg_t))
    );
    assert_eq!(
        ::core::mem::align_of::<ble_l2cap_conn_cfg_t>(),
        2usize,
        concat!("Alignment of ", stringify!(ble_l2cap_conn_cfg_t))
    );
    assert_eq!(
        unsafe { &(*(::core::ptr::null::<ble_l2cap_conn_cfg_t>())).rx_mps as *const _ as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(ble_l2cap_conn_cfg_t),
            "::",
            stringify!(rx_mps)
        )
    );
    assert_eq!(
        unsafe { &(*(::core::ptr::null::<ble_l2cap_conn_cfg_t>())).tx_mps as *const _ as usize },
        2usize,
        concat!(
            "Offset of field: ",
            stringify!(ble_l2cap_conn_cfg_t),
            "::",
            stringify!(tx_mps)
        )
    );
    assert_eq!(
        unsafe { &(*(::core::ptr::null::<ble_l2cap_conn_cfg_t>())).rx_queue_size as *const _ as usize },
        4usize,
        concat!(
            "Offset of field: ",
            stringify!(ble_l2cap_conn_cfg_t),
            "::",
            stringify!(rx_queue_size)
        )
    );
    assert_eq!(
        unsafe { &(*(::core::ptr::null::<ble_l2cap_conn_cfg_t>())).tx_queue_size as *const _ as usize },
        5usize,
        concat!(
            "Offset of field: ",
            stringify!(ble_l2cap_conn_cfg_t),
            "::",
            stringify!(tx_queue_size)
        )
    );
    assert_eq!(
        unsafe { &(*(::core::ptr::null::<ble_l2cap_conn_cfg_t>())).ch_count as *const _ as usize },
        6usize,
        concat!(
            "Offset of field: ",
            stringify!(ble_l2cap_conn_cfg_t),
            "::",
            stringify!(ch_count)
        )
    );
}
#[doc = "@brief L2CAP channel RX parameters."]
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct ble_l2cap_ch_rx_params_t {
    #[doc = "< The maximum L2CAP SDU size, in bytes, that L2CAP shall be able to"]
    #[doc = "receive on this L2CAP channel."]
    #[doc = "- Must be equal to or greater than @ref BLE_L2CAP_MTU_MIN."]
    pub rx_mtu: u16,
    #[doc = "< The maximum L2CAP PDU payload size, in bytes, that L2CAP shall be"]
    #[doc = "able to receive on this L2CAP channel."]
    #[doc = "- Must be equal to or greater than @ref BLE_L2CAP_MPS_MIN."]
    #[doc = "- Must be equal to or less than @ref ble_l2cap_conn_cfg_t::rx_mps."]
    pub rx_mps: u16,
    #[doc = "< SDU data buffer for reception."]
    #[doc = "- If @ref ble_data_t::p_data is non-NULL, initial credits are"]
    #[doc = "issued to the peer."]
    #[doc = "- If @ref ble_data_t::p_data is NULL, no initial credits are"]
    #[doc = "issued to the peer."]
    pub sdu_buf: ble_data_t,
}
#[test]
fn bindgen_test_layout_ble_l2cap_ch_rx_params_t() {
    assert_eq!(
        ::core::mem::size_of::<ble_l2cap_ch_rx_params_t>(),
        12usize,
        concat!("Size of: ", stringify!(ble_l2cap_ch_rx_params_t))
    );
    assert_eq!(
        ::core::mem::align_of::<ble_l2cap_ch_rx_params_t>(),
        4usize,
        concat!("Alignment of ", stringify!(ble_l2cap_ch_rx_params_t))
    );
    assert_eq!(
        unsafe { &(*(::core::ptr::null::<ble_l2cap_ch_rx_params_t>())).rx_mtu as *const _ as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(ble_l2cap_ch_rx_params_t),
            "::",
            stringify!(rx_mtu)
        )
    );
    assert_eq!(
        unsafe { &(*(::core::ptr::null::<ble_l2cap_ch_rx_params_t>())).rx_mps as *const _ as usize },
        2usize,
        concat!(
            "Offset of field: ",
            stringify!(ble_l2cap_ch_rx_params_t),
            "::",
            stringify!(rx_mps)
        )
    );
    assert_eq!(
        unsafe { &(*(::core::ptr::null::<ble_l2cap_ch_rx_params_t>())).sdu_buf as *const _ as usize },
        4usize,
        concat!(
            "Offset of field: ",
            stringify!(ble_l2cap_ch_rx_params_t),
            "::",
            stringify!(sdu_buf)
        )
    );
}
#[doc = "@brief L2CAP channel setup parameters."]
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct ble_l2cap_ch_setup_params_t {
    #[doc = "< L2CAP channel RX parameters."]
    pub rx_params: ble_l2cap_ch_rx_params_t,
    #[doc = "< LE Protocol/Service Multiplexer. Used when requesting"]
    #[doc = "setup of an L2CAP channel, ignored otherwise."]
    pub le_psm: u16,
    #[doc = "< Status code, see @ref BLE_L2CAP_CH_STATUS_CODES."]
    #[doc = "Used when replying to a setup request of an L2CAP"]
    #[doc = "channel, ignored otherwise."]
    pub status: u16,
}
#[test]
fn bindgen_test_layout_ble_l2cap_ch_setup_params_t() {
    assert_eq!(
        ::core::mem::size_of::<ble_l2cap_ch_setup_params_t>(),
        16usize,
        concat!("Size of: ", stringify!(ble_l2cap_ch_setup_params_t))
    );
    assert_eq!(
        ::core::mem::align_of::<ble_l2cap_ch_setup_params_t>(),
        4usize,
        concat!("Alignment of ", stringify!(ble_l2cap_ch_setup_params_t))
    );
    assert_eq!(
        unsafe { &(*(::core::ptr::null::<ble_l2cap_ch_setup_params_t>())).rx_params as *const _ as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(ble_l2cap_ch_setup_params_t),
            "::",
            stringify!(rx_params)
        )
    );
    assert_eq!(
        unsafe { &(*(::core::ptr::null::<ble_l2cap_ch_setup_params_t>())).le_psm as *const _ as usize },
        12usize,
        concat!(
            "Offset of field: ",
            stringify!(ble_l2cap_ch_setup_params_t),
            "::",
            stringify!(le_psm)
        )
    );
    assert_eq!(
        unsafe { &(*(::core::ptr::null::<ble_l2cap_ch_setup_params_t>())).status as *const _ as usize },
        14usize,
        concat!(
            "Offset of field: ",
            stringify!(ble_l2cap_ch_setup_params_t),
            "::",
            stringify!(status)
        )
    );
}
#[doc = "@brief L2CAP channel TX parameters."]
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct ble_l2cap_ch_tx_params_t {
    #[doc = "< The maximum L2CAP SDU size, in bytes, that L2CAP is able to"]
    #[doc = "transmit on this L2CAP channel."]
    pub tx_mtu: u16,
    #[doc = "< The maximum L2CAP PDU payload size, in bytes, that the peer is"]
    #[doc = "able to receive on this L2CAP channel."]
    pub peer_mps: u16,
    #[doc = "< The maximum L2CAP PDU payload size, in bytes, that L2CAP is able"]
    #[doc = "to transmit on this L2CAP channel. This is effective tx_mps,"]
    #[doc = "selected by the SoftDevice as"]
    #[doc = "MIN( @ref ble_l2cap_ch_tx_params_t::peer_mps, @ref ble_l2cap_conn_cfg_t::tx_mps )"]
    pub tx_mps: u16,
    #[doc = "< Initial credits given by the peer."]
    pub credits: u16,
}
#[test]
fn bindgen_test_layout_ble_l2cap_ch_tx_params_t() {
    assert_eq!(
        ::core::mem::size_of::<ble_l2cap_ch_tx_params_t>(),
        8usize,
        concat!("Size of: ", stringify!(ble_l2cap_ch_tx_params_t))
    );
    assert_eq!(
        ::core::mem::align_of::<ble_l2cap_ch_tx_params_t>(),
        2usize,
        concat!("Alignment of ", stringify!(ble_l2cap_ch_tx_params_t))
    );
    assert_eq!(
        unsafe { &(*(::core::ptr::null::<ble_l2cap_ch_tx_params_t>())).tx_mtu as *const _ as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(ble_l2cap_ch_tx_params_t),
            "::",
            stringify!(tx_mtu)
        )
    );
    assert_eq!(
        unsafe { &(*(::core::ptr::null::<ble_l2cap_ch_tx_params_t>())).peer_mps as *const _ as usize },
        2usize,
        concat!(
            "Offset of field: ",
            stringify!(ble_l2cap_ch_tx_params_t),
            "::",
            stringify!(peer_mps)
        )
    );
    assert_eq!(
        unsafe { &(*(::core::ptr::null::<ble_l2cap_ch_tx_params_t>())).tx_mps as *const _ as usize },
        4usize,
        concat!(
            "Offset of field: ",
            stringify!(ble_l2cap_ch_tx_params_t),
            "::",
            stringify!(tx_mps)
        )
    );
    assert_eq!(
        unsafe { &(*(::core::ptr::null::<ble_l2cap_ch_tx_params_t>())).credits as *const _ as usize },
        6usize,
        concat!(
            "Offset of field: ",
            stringify!(ble_l2cap_ch_tx_params_t),
            "::",
            stringify!(credits)
        )
    );
}
#[doc = "@brief L2CAP Channel Setup Request event."]
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct ble_l2cap_evt_ch_setup_request_t {
    #[doc = "< L2CAP channel TX parameters."]
    pub tx_params: ble_l2cap_ch_tx_params_t,
    #[doc = "< LE Protocol/Service Multiplexer."]
    pub le_psm: u16,
}
#[test]
fn bindgen_test_layout_ble_l2cap_evt_ch_setup_request_t() {
    assert_eq!(
        ::core::mem::size_of::<ble_l2cap_evt_ch_setup_request_t>(),
        10usize,
        concat!("Size of: ", stringify!(ble_l2cap_evt_ch_setup_request_t))
    );
    assert_eq!(
        ::core::mem::align_of::<ble_l2cap_evt_ch_setup_request_t>(),
        2usize,
        concat!("Alignment of ", stringify!(ble_l2cap_evt_ch_setup_request_t))
    );
    assert_eq!(
        unsafe { &(*(::core::ptr::null::<ble_l2cap_evt_ch_setup_request_t>())).tx_params as *const _ as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(ble_l2cap_evt_ch_setup_request_t),
            "::",
            stringify!(tx_params)
        )
    );
    assert_eq!(
        unsafe { &(*(::core::ptr::null::<ble_l2cap_evt_ch_setup_request_t>())).le_psm as *const _ as usize },
        8usize,
        concat!(
            "Offset of field: ",
            stringify!(ble_l2cap_evt_ch_setup_request_t),
            "::",
            stringify!(le_psm)
        )
    );
}
#[doc = "@brief L2CAP Channel Setup Refused event."]
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct ble_l2cap_evt_ch_setup_refused_t {
    #[doc = "< Source, see @ref BLE_L2CAP_CH_SETUP_REFUSED_SRCS"]
    pub source: u8,
    #[doc = "< Status code, see @ref BLE_L2CAP_CH_STATUS_CODES"]
    pub status: u16,
}
#[test]
fn bindgen_test_layout_ble_l2cap_evt_ch_setup_refused_t() {
    assert_eq!(
        ::core::mem::size_of::<ble_l2cap_evt_ch_setup_refused_t>(),
        4usize,
        concat!("Size of: ", stringify!(ble_l2cap_evt_ch_setup_refused_t))
    );
    assert_eq!(
        ::core::mem::align_of::<ble_l2cap_evt_ch_setup_refused_t>(),
        2usize,
        concat!("Alignment of ", stringify!(ble_l2cap_evt_ch_setup_refused_t))
    );
    assert_eq!(
        unsafe { &(*(::core::ptr::null::<ble_l2cap_evt_ch_setup_refused_t>())).source as *const _ as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(ble_l2cap_evt_ch_setup_refused_t),
            "::",
            stringify!(source)
        )
    );
    assert_eq!(
        unsafe { &(*(::core::ptr::null::<ble_l2cap_evt_ch_setup_refused_t>())).status as *const _ as usize },
        2usize,
        concat!(
            "Offset of field: ",
            stringify!(ble_l2cap_evt_ch_setup_refused_t),
            "::",
            stringify!(status)
        )
    );
}
#[doc = "@brief L2CAP Channel Setup Completed event."]
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct ble_l2cap_evt_ch_setup_t {
    #[doc = "< L2CAP channel TX parameters."]
    pub tx_params: ble_l2cap_ch_tx_params_t,
}
#[test]
fn bindgen_test_layout_ble_l2cap_evt_ch_setup_t() {
    assert_eq!(
        ::core::mem::size_of::<ble_l2cap_evt_ch_setup_t>(),
        8usize,
        concat!("Size of: ", stringify!(ble_l2cap_evt_ch_setup_t))
    );
    assert_eq!(
        ::core::mem::align_of::<ble_l2cap_evt_ch_setup_t>(),
        2usize,
        concat!("Alignment of ", stringify!(ble_l2cap_evt_ch_setup_t))
    );
    assert_eq!(
        unsafe { &(*(::core::ptr::null::<ble_l2cap_evt_ch_setup_t>())).tx_params as *const _ as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(ble_l2cap_evt_ch_setup_t),
            "::",
            stringify!(tx_params)
        )
    );
}
#[doc = "@brief L2CAP Channel SDU Data Buffer Released event."]
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct ble_l2cap_evt_ch_sdu_buf_released_t {
    #[doc = "< Returned reception or transmission SDU data buffer. The SoftDevice"]
    #[doc = "returns SDU data buffers supplied by the application, which have"]
    #[doc = "not yet been returned previously via a @ref BLE_L2CAP_EVT_CH_RX or"]
    #[doc = "@ref BLE_L2CAP_EVT_CH_TX event."]
    pub sdu_buf: ble_data_t,
}
#[test]
fn bindgen_test_layout_ble_l2cap_evt_ch_sdu_buf_released_t() {
    assert_eq!(
        ::core::mem::size_of::<ble_l2cap_evt_ch_sdu_buf_released_t>(),
        8usize,
        concat!("Size of: ", stringify!(ble_l2cap_evt_ch_sdu_buf_released_t))
    );
    assert_eq!(
        ::core::mem::align_of::<ble_l2cap_evt_ch_sdu_buf_released_t>(),
        4usize,
        concat!("Alignment of ", stringify!(ble_l2cap_evt_ch_sdu_buf_released_t))
    );
    assert_eq!(
        unsafe { &(*(::core::ptr::null::<ble_l2cap_evt_ch_sdu_buf_released_t>())).sdu_buf as *const _ as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(ble_l2cap_evt_ch_sdu_buf_released_t),
            "::",
            stringify!(sdu_buf)
        )
    );
}
#[doc = "@brief L2CAP Channel Credit received event."]
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct ble_l2cap_evt_ch_credit_t {
    #[doc = "< Additional credits given by the peer."]
    pub credits: u16,
}
#[test]
fn bindgen_test_layout_ble_l2cap_evt_ch_credit_t() {
    assert_eq!(
        ::core::mem::size_of::<ble_l2cap_evt_ch_credit_t>(),
        2usize,
        concat!("Size of: ", stringify!(ble_l2cap_evt_ch_credit_t))
    );
    assert_eq!(
        ::core::mem::align_of::<ble_l2cap_evt_ch_credit_t>(),
        2usize,
        concat!("Alignment of ", stringify!(ble_l2cap_evt_ch_credit_t))
    );
    assert_eq!(
        unsafe { &(*(::core::ptr::null::<ble_l2cap_evt_ch_credit_t>())).credits as *const _ as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(ble_l2cap_evt_ch_credit_t),
            "::",
            stringify!(credits)
        )
    );
}
#[doc = "@brief L2CAP Channel received SDU event."]
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct ble_l2cap_evt_ch_rx_t {
    #[doc = "< Total SDU length, in bytes."]
    pub sdu_len: u16,
    #[doc = "< SDU data buffer."]
    #[doc = "@note If there is not enough space in the buffer"]
    #[doc = "(sdu_buf.len < sdu_len) then the rest of the SDU will be"]
    #[doc = "silently discarded by the SoftDevice."]
    pub sdu_buf: ble_data_t,
}
#[test]
fn bindgen_test_layout_ble_l2cap_evt_ch_rx_t() {
    assert_eq!(
        ::core::mem::size_of::<ble_l2cap_evt_ch_rx_t>(),
        12usize,
        concat!("Size of: ", stringify!(ble_l2cap_evt_ch_rx_t))
    );
    assert_eq!(
        ::core::mem::align_of::<ble_l2cap_evt_ch_rx_t>(),
        4usize,
        concat!("Alignment of ", stringify!(ble_l2cap_evt_ch_rx_t))
    );
    assert_eq!(
        unsafe { &(*(::core::ptr::null::<ble_l2cap_evt_ch_rx_t>())).sdu_len as *const _ as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(ble_l2cap_evt_ch_rx_t),
            "::",
            stringify!(sdu_len)
        )
    );
    assert_eq!(
        unsafe { &(*(::core::ptr::null::<ble_l2cap_evt_ch_rx_t>())).sdu_buf as *const _ as usize },
        4usize,
        concat!(
            "Offset of field: ",
            stringify!(ble_l2cap_evt_ch_rx_t),
            "::",
            stringify!(sdu_buf)
        )
    );
}
#[doc = "@brief L2CAP Channel transmitted SDU event."]
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct ble_l2cap_evt_ch_tx_t {
    #[doc = "< SDU data buffer."]
    pub sdu_buf: ble_data_t,
}
#[test]
fn bindgen_test_layout_ble_l2cap_evt_ch_tx_t() {
    assert_eq!(
        ::core::mem::size_of::<ble_l2cap_evt_ch_tx_t>(),
        8usize,
        concat!("Size of: ", stringify!(ble_l2cap_evt_ch_tx_t))
    );
    assert_eq!(
        ::core::mem::align_of::<ble_l2cap_evt_ch_tx_t>(),
        4usize,
        concat!("Alignment of ", stringify!(ble_l2cap_evt_ch_tx_t))
    );
    assert_eq!(
        unsafe { &(*(::core::ptr::null::<ble_l2cap_evt_ch_tx_t>())).sdu_buf as *const _ as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(ble_l2cap_evt_ch_tx_t),
            "::",
            stringify!(sdu_buf)
        )
    );
}
#[doc = "@brief L2CAP event structure."]
#[repr(C)]
#[derive(Copy, Clone)]
pub struct ble_l2cap_evt_t {
    #[doc = "< Connection Handle on which the event occured."]
    pub conn_handle: u16,
    #[doc = "< Local Channel ID of the L2CAP channel, or"]
    #[doc = "@ref BLE_L2CAP_CID_INVALID if not present."]
    pub local_cid: u16,
    #[doc = "< Event Parameters."]
    pub params: ble_l2cap_evt_t__bindgen_ty_1,
}
#[repr(C)]
#[derive(Copy, Clone)]
pub union ble_l2cap_evt_t__bindgen_ty_1 {
    #[doc = "< L2CAP Channel Setup Request Event Parameters."]
    pub ch_setup_request: ble_l2cap_evt_ch_setup_request_t,
    #[doc = "< L2CAP Channel Setup Refused Event Parameters."]
    pub ch_setup_refused: ble_l2cap_evt_ch_setup_refused_t,
    #[doc = "< L2CAP Channel Setup Completed Event Parameters."]
    pub ch_setup: ble_l2cap_evt_ch_setup_t,
    #[doc = "< L2CAP Channel SDU Data Buffer Released Event Parameters."]
    pub ch_sdu_buf_released: ble_l2cap_evt_ch_sdu_buf_released_t,
    #[doc = "< L2CAP Channel Credit Received Event Parameters."]
    pub credit: ble_l2cap_evt_ch_credit_t,
    #[doc = "< L2CAP Channel SDU Received Event Parameters."]
    pub rx: ble_l2cap_evt_ch_rx_t,
    #[doc = "< L2CAP Channel SDU Transmitted Event Parameters."]
    pub tx: ble_l2cap_evt_ch_tx_t,
    _bindgen_union_align: [u32; 3usize],
}
#[test]
fn bindgen_test_layout_ble_l2cap_evt_t__bindgen_ty_1() {
    assert_eq!(
        ::core::mem::size_of::<ble_l2cap_evt_t__bindgen_ty_1>(),
        12usize,
        concat!("Size of: ", stringify!(ble_l2cap_evt_t__bindgen_ty_1))
    );
    assert_eq!(
        ::core::mem::align_of::<ble_l2cap_evt_t__bindgen_ty_1>(),
        4usize,
        concat!("Alignment of ", stringify!(ble_l2cap_evt_t__bindgen_ty_1))
    );
    assert_eq!(
        unsafe { &(*(::core::ptr::null::<ble_l2cap_evt_t__bindgen_ty_1>())).ch_setup_request as *const _ as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(ble_l2cap_evt_t__bindgen_ty_1),
            "::",
            stringify!(ch_setup_request)
        )
    );
    assert_eq!(
        unsafe { &(*(::core::ptr::null::<ble_l2cap_evt_t__bindgen_ty_1>())).ch_setup_refused as *const _ as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(ble_l2cap_evt_t__bindgen_ty_1),
            "::",
            stringify!(ch_setup_refused)
        )
    );
    assert_eq!(
        unsafe { &(*(::core::ptr::null::<ble_l2cap_evt_t__bindgen_ty_1>())).ch_setup as *const _ as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(ble_l2cap_evt_t__bindgen_ty_1),
            "::",
            stringify!(ch_setup)
        )
    );
    assert_eq!(
        unsafe { &(*(::core::ptr::null::<ble_l2cap_evt_t__bindgen_ty_1>())).ch_sdu_buf_released as *const _ as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(ble_l2cap_evt_t__bindgen_ty_1),
            "::",
            stringify!(ch_sdu_buf_released)
        )
    );
    assert_eq!(
        unsafe { &(*(::core::ptr::null::<ble_l2cap_evt_t__bindgen_ty_1>())).credit as *const _ as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(ble_l2cap_evt_t__bindgen_ty_1),
            "::",
            stringify!(credit)
        )
    );
    assert_eq!(
        unsafe { &(*(::core::ptr::null::<ble_l2cap_evt_t__bindgen_ty_1>())).rx as *const _ as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(ble_l2cap_evt_t__bindgen_ty_1),
            "::",
            stringify!(rx)
        )
    );
    assert_eq!(
        unsafe { &(*(::core::ptr::null::<ble_l2cap_evt_t__bindgen_ty_1>())).tx as *const _ as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(ble_l2cap_evt_t__bindgen_ty_1),
            "::",
            stringify!(tx)
        )
    );
}
#[test]
fn bindgen_test_layout_ble_l2cap_evt_t() {
    assert_eq!(
        ::core::mem::size_of::<ble_l2cap_evt_t>(),
        16usize,
        concat!("Size of: ", stringify!(ble_l2cap_evt_t))
    );
    assert_eq!(
        ::core::mem::align_of::<ble_l2cap_evt_t>(),
        4usize,
        concat!("Alignment of ", stringify!(ble_l2cap_evt_t))
    );
    assert_eq!(
        unsafe { &(*(::core::ptr::null::<ble_l2cap_evt_t>())).conn_handle as *const _ as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(ble_l2cap_evt_t),
            "::",
            stringify!(conn_handle)
        )
    );
    assert_eq!(
        unsafe { &(*(::core::ptr::null::<ble_l2cap_evt_t>())).local_cid as *const _ as usize },
        2usize,
        concat!(
            "Offset of field: ",
            stringify!(ble_l2cap_evt_t),
            "::",
            stringify!(local_cid)
        )
    );
    assert_eq!(
        unsafe { &(*(::core::ptr::null::<ble_l2cap_evt_t>())).params as *const _ as usize },
        4usize,
        concat!(
            "Offset of field: ",
            stringify!(ble_l2cap_evt_t),
            "::",
