/*
 * Copyright (c) 2012 - 2019, Nordic Semiconductor ASA
 * All rights reserved.
 *
 * Redistribution and use in source and binary forms, with or without modification,
 * are permitted provided that the following conditions are met:
 *
 * 1. Redistributions of source code must retain the above copyright notice, this
 *    list of conditions and the following disclaimer.
 *
 * 2. Redistributions in binary form, except as embedded into a Nordic
 *    Semiconductor ASA integrated circuit in a product or a software update for
 *    such product, must reproduce the above copyright notice, this list of
 *    conditions and the following disclaimer in the documentation and/or other
 *    materials provided with the distribution.
 *
 * 3. Neither the name of Nordic Semiconductor ASA nor the names of its
 *    contributors may be used to endorse or promote products derived from this
 *    software without specific prior written permission.
 *
 * 4. This software, with or without modification, must only be used with a
 *    Nordic Semiconductor ASA integrated circuit.
 *
 * 5. Any software provided in binary form under this license must not be reverse
 *    engineered, decompiled, modified and/or disassembled.
 *
 * THIS SOFTWARE IS PROVIDED BY NORDIC SEMICONDUCTOR ASA "AS IS" AND ANY EXPRESS
 * OR IMPLIED WARRANTIES, INCLUDING, BUT NOT LIMITED TO, THE IMPLIED WARRANTIES
 * OF MERCHANTABILITY, NONINFRINGEMENT, AND FITNESS FOR A PARTICULAR PURPOSE ARE

pub const BLE_GAP_CHAR_INCL_CONFIG_EXCLUDE_WITH_SPACE: u32 = 1;
pub const BLE_GAP_CHAR_INCL_CONFIG_EXCLUDE_WITHOUT_SPACE: u32 = 2;
pub const BLE_GAP_PPCP_INCL_CONFIG_DEFAULT: u32 = 0;
pub const BLE_GAP_CAR_INCL_CONFIG_DEFAULT: u32 = 0;
pub const BLE_ERROR_GATTS_INVALID_ATTR_TYPE: u32 = 13312;
pub const BLE_ERROR_GATTS_SYS_ATTR_MISSING: u32 = 13313;
pub const BLE_GATTS_FIX_ATTR_LEN_MAX: u32 = 510;
pub const BLE_GATTS_VAR_ATTR_LEN_MAX: u32 = 512;
pub const BLE_GATTS_SRVC_TYPE_INVALID: u32 = 0;
pub const BLE_GATTS_SRVC_TYPE_PRIMARY: u32 = 1;
pub const BLE_GATTS_SRVC_TYPE_SECONDARY: u32 = 2;
pub const BLE_GATTS_ATTR_TYPE_INVALID: u32 = 0;
pub const BLE_GATTS_ATTR_TYPE_PRIM_SRVC_DECL: u32 = 1;
pub const BLE_GATTS_ATTR_TYPE_SEC_SRVC_DECL: u32 = 2;
pub const BLE_GATTS_ATTR_TYPE_INC_DECL: u32 = 3;
pub const BLE_GATTS_ATTR_TYPE_CHAR_DECL: u32 = 4;
pub const BLE_GATTS_ATTR_TYPE_CHAR_VAL: u32 = 5;
pub const BLE_GATTS_ATTR_TYPE_DESC: u32 = 6;
pub const BLE_GATTS_ATTR_TYPE_OTHER: u32 = 7;
pub const BLE_GATTS_OP_INVALID: u32 = 0;
pub const BLE_GATTS_OP_WRITE_REQ: u32 = 1;
pub const BLE_GATTS_OP_WRITE_CMD: u32 = 2;
pub const BLE_GATTS_OP_SIGN_WRITE_CMD: u32 = 3;
pub const BLE_GATTS_OP_PREP_WRITE_REQ: u32 = 4;
pub const BLE_GATTS_OP_EXEC_WRITE_REQ_CANCEL: u32 = 5;
pub const BLE_GATTS_OP_EXEC_WRITE_REQ_NOW: u32 = 6;
pub const BLE_GATTS_VLOC_INVALID: u32 = 0;
pub const BLE_GATTS_VLOC_STACK: u32 = 1;
pub const BLE_GATTS_VLOC_USER: u32 = 2;
pub const BLE_GATTS_AUTHORIZE_TYPE_INVALID: u32 = 0;
pub const BLE_GATTS_AUTHORIZE_TYPE_READ: u32 = 1;
pub const BLE_GATTS_AUTHORIZE_TYPE_WRITE: u32 = 2;
pub const BLE_GATTS_SYS_ATTR_FLAG_SYS_SRVCS: u32 = 1;
pub const BLE_GATTS_SYS_ATTR_FLAG_USR_SRVCS: u32 = 2;
pub const BLE_GATTS_SERVICE_CHANGED_DEFAULT: u32 = 1;
pub const BLE_GATTS_ATTR_TAB_SIZE_MIN: u32 = 248;
pub const BLE_GATTS_ATTR_TAB_SIZE_DEFAULT: u32 = 1408;
pub const BLE_GATTS_HVN_TX_QUEUE_SIZE_DEFAULT: u32 = 1;
pub const BLE_EVT_PTR_ALIGNMENT: u32 = 4;
pub const BLE_USER_MEM_TYPE_INVALID: u32 = 0;
pub const BLE_USER_MEM_TYPE_GATTS_QUEUED_WRITES: u32 = 1;
pub const BLE_UUID_VS_COUNT_DEFAULT: u32 = 10;
pub const BLE_UUID_VS_COUNT_MAX: u32 = 254;
pub const BLE_CONN_CFG_TAG_DEFAULT: u32 = 0;
pub type int_least64_t = i64;
pub type uint_least64_t = u64;
pub type int_fast64_t = i64;
pub type uint_fast64_t = u64;
pub type int_least32_t = i32;
pub type uint_least32_t = u32;
pub type int_fast32_t = i32;
pub type uint_fast32_t = u32;
pub type int_least16_t = i16;
pub type uint_least16_t = u16;
pub type int_fast16_t = i16;
pub type uint_fast16_t = u16;
pub type int_least8_t = i8;
pub type uint_least8_t = u8;
pub type int_fast8_t = i8;
pub type uint_fast8_t = u8;
pub type intmax_t = self::c_longlong;
pub type uintmax_t = self::c_ulonglong;
#[doc = " @brief 128 bit UUID values."]
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct ble_uuid128_t {
    #[doc = "< Little-Endian UUID bytes."]
    pub uuid128: [u8; 16usize],
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of ble_uuid128_t"][::core::mem::size_of::<ble_uuid128_t>() - 16usize];
    ["Alignment of ble_uuid128_t"][::core::mem::align_of::<ble_uuid128_t>() - 1usize];
    ["Offset of field: ble_uuid128_t::uuid128"][::core::mem::offset_of!(ble_uuid128_t, uuid128) - 0usize];
};
#[doc = " @brief  Bluetooth Low Energy UUID type, encapsulates both 16-bit and 128-bit UUIDs."]
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct ble_uuid_t {
    #[doc = "< 16-bit UUID value or octets 12-13 of 128-bit UUID."]
    pub uuid: u16,
    #[doc = "< UUID type, see @ref BLE_UUID_TYPES. If type is @ref BLE_UUID_TYPE_UNKNOWN, the value of uuid is undefined."]
    pub type_: u8,
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of ble_uuid_t"][::core::mem::size_of::<ble_uuid_t>() - 4usize];
    ["Alignment of ble_uuid_t"][::core::mem::align_of::<ble_uuid_t>() - 2usize];
    ["Offset of field: ble_uuid_t::uuid"][::core::mem::offset_of!(ble_uuid_t, uuid) - 0usize];
    ["Offset of field: ble_uuid_t::type_"][::core::mem::offset_of!(ble_uuid_t, type_) - 2usize];
};
#[doc = "@brief Data structure."]
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct ble_data_t {
    #[doc = "< Pointer to the data buffer provided to/from the application."]
    pub p_data: *mut u8,
    #[doc = "< Length of the data buffer, in bytes."]
    pub len: u16,
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of ble_data_t"][::core::mem::size_of::<ble_data_t>() - 8usize];
    ["Alignment of ble_data_t"][::core::mem::align_of::<ble_data_t>() - 4usize];
    ["Offset of field: ble_data_t::p_data"][::core::mem::offset_of!(ble_data_t, p_data) - 0usize];
    ["Offset of field: ble_data_t::len"][::core::mem::offset_of!(ble_data_t, len) - 4usize];
};
pub const NRF_SOC_SVCS_SD_PPI_CHANNEL_ENABLE_GET: NRF_SOC_SVCS = 32;
pub const NRF_SOC_SVCS_SD_PPI_CHANNEL_ENABLE_SET: NRF_SOC_SVCS = 33;
pub const NRF_SOC_SVCS_SD_PPI_CHANNEL_ENABLE_CLR: NRF_SOC_SVCS = 34;
pub const NRF_SOC_SVCS_SD_PPI_CHANNEL_ASSIGN: NRF_SOC_SVCS = 35;
pub const NRF_SOC_SVCS_SD_PPI_GROUP_TASK_ENABLE: NRF_SOC_SVCS = 36;
pub const NRF_SOC_SVCS_SD_PPI_GROUP_TASK_DISABLE: NRF_SOC_SVCS = 37;
pub const NRF_SOC_SVCS_SD_PPI_GROUP_ASSIGN: NRF_SOC_SVCS = 38;
pub const NRF_SOC_SVCS_SD_PPI_GROUP_GET: NRF_SOC_SVCS = 39;
pub const NRF_SOC_SVCS_SD_FLASH_PAGE_ERASE: NRF_SOC_SVCS = 40;
pub const NRF_SOC_SVCS_SD_FLASH_WRITE: NRF_SOC_SVCS = 41;
pub const NRF_SOC_SVCS_SD_PROTECTED_REGISTER_WRITE: NRF_SOC_SVCS = 43;
pub const NRF_SOC_SVCS_SD_MUTEX_NEW: NRF_SOC_SVCS = 44;
pub const NRF_SOC_SVCS_SD_MUTEX_ACQUIRE: NRF_SOC_SVCS = 45;
pub const NRF_SOC_SVCS_SD_MUTEX_RELEASE: NRF_SOC_SVCS = 46;
pub const NRF_SOC_SVCS_SD_RAND_APPLICATION_POOL_CAPACITY_GET: NRF_SOC_SVCS = 47;
pub const NRF_SOC_SVCS_SD_RAND_APPLICATION_BYTES_AVAILABLE_GET: NRF_SOC_SVCS = 48;
pub const NRF_SOC_SVCS_SD_RAND_APPLICATION_VECTOR_GET: NRF_SOC_SVCS = 49;
pub const NRF_SOC_SVCS_SD_POWER_MODE_SET: NRF_SOC_SVCS = 50;
pub const NRF_SOC_SVCS_SD_POWER_SYSTEM_OFF: NRF_SOC_SVCS = 51;
pub const NRF_SOC_SVCS_SD_POWER_RESET_REASON_GET: NRF_SOC_SVCS = 52;
pub const NRF_SOC_SVCS_SD_POWER_RESET_REASON_CLR: NRF_SOC_SVCS = 53;
pub const NRF_SOC_SVCS_SD_POWER_POF_ENABLE: NRF_SOC_SVCS = 54;
pub const NRF_SOC_SVCS_SD_POWER_POF_THRESHOLD_SET: NRF_SOC_SVCS = 55;
pub const NRF_SOC_SVCS_SD_POWER_POF_THRESHOLDVDDH_SET: NRF_SOC_SVCS = 56;
pub const NRF_SOC_SVCS_SD_POWER_RAM_POWER_SET: NRF_SOC_SVCS = 57;
pub const NRF_SOC_SVCS_SD_POWER_RAM_POWER_CLR: NRF_SOC_SVCS = 58;
pub const NRF_SOC_SVCS_SD_POWER_RAM_POWER_GET: NRF_SOC_SVCS = 59;
pub const NRF_SOC_SVCS_SD_POWER_GPREGRET_SET: NRF_SOC_SVCS = 60;
pub const NRF_SOC_SVCS_SD_POWER_GPREGRET_CLR: NRF_SOC_SVCS = 61;
pub const NRF_SOC_SVCS_SD_POWER_GPREGRET_GET: NRF_SOC_SVCS = 62;
pub const NRF_SOC_SVCS_SD_POWER_DCDC_MODE_SET: NRF_SOC_SVCS = 63;
pub const NRF_SOC_SVCS_SD_POWER_DCDC0_MODE_SET: NRF_SOC_SVCS = 64;
pub const NRF_SOC_SVCS_SD_APP_EVT_WAIT: NRF_SOC_SVCS = 65;
pub const NRF_SOC_SVCS_SD_CLOCK_HFCLK_REQUEST: NRF_SOC_SVCS = 66;
pub const NRF_SOC_SVCS_SD_CLOCK_HFCLK_RELEASE: NRF_SOC_SVCS = 67;
pub const NRF_SOC_SVCS_SD_CLOCK_HFCLK_IS_RUNNING: NRF_SOC_SVCS = 68;
pub const NRF_SOC_SVCS_SD_RADIO_NOTIFICATION_CFG_SET: NRF_SOC_SVCS = 69;
pub const NRF_SOC_SVCS_SD_ECB_BLOCK_ENCRYPT: NRF_SOC_SVCS = 70;
pub const NRF_SOC_SVCS_SD_ECB_BLOCKS_ENCRYPT: NRF_SOC_SVCS = 71;
pub const NRF_SOC_SVCS_SD_RADIO_SESSION_OPEN: NRF_SOC_SVCS = 72;
pub const NRF_SOC_SVCS_SD_RADIO_SESSION_CLOSE: NRF_SOC_SVCS = 73;
pub const NRF_SOC_SVCS_SD_RADIO_REQUEST: NRF_SOC_SVCS = 74;
pub const NRF_SOC_SVCS_SD_EVT_GET: NRF_SOC_SVCS = 75;
pub const NRF_SOC_SVCS_SD_TEMP_GET: NRF_SOC_SVCS = 76;
pub const NRF_SOC_SVCS_SD_POWER_USBPWRRDY_ENABLE: NRF_SOC_SVCS = 77;
pub const NRF_SOC_SVCS_SD_POWER_USBDETECTED_ENABLE: NRF_SOC_SVCS = 78;
pub const NRF_SOC_SVCS_SD_POWER_USBREMOVED_ENABLE: NRF_SOC_SVCS = 79;
pub const NRF_SOC_SVCS_SD_POWER_USBREGSTATUS_GET: NRF_SOC_SVCS = 80;
pub const NRF_SOC_SVCS_SVC_SOC_LAST: NRF_SOC_SVCS = 81;
#[doc = "@brief The SVC numbers used by the SVC functions in the SoC library."]
pub type NRF_SOC_SVCS = self::c_uint;
pub const NRF_MUTEX_VALUES_NRF_MUTEX_FREE: NRF_MUTEX_VALUES = 0;
pub const NRF_MUTEX_VALUES_NRF_MUTEX_TAKEN: NRF_MUTEX_VALUES = 1;
#[doc = "@brief Possible values of a ::nrf_mutex_t."]
pub type NRF_MUTEX_VALUES = self::c_uint;
#[doc = "< Constant latency mode. See power management in the reference manual."]
pub const NRF_POWER_MODES_NRF_POWER_MODE_CONSTLAT: NRF_POWER_MODES = 0;
#[doc = "< Low power mode. See power management in the reference manual."]
pub const NRF_POWER_MODES_NRF_POWER_MODE_LOWPWR: NRF_POWER_MODES = 1;
#[doc = "@brief Power modes."]
pub type NRF_POWER_MODES = self::c_uint;
#[doc = "< 1.7 Volts power failure threshold."]
pub const NRF_POWER_THRESHOLDS_NRF_POWER_THRESHOLD_V17: NRF_POWER_THRESHOLDS = 4;
#[doc = "< 1.8 Volts power failure threshold."]
pub const NRF_POWER_THRESHOLDS_NRF_POWER_THRESHOLD_V18: NRF_POWER_THRESHOLDS = 5;
#[doc = "< 1.9 Volts power failure threshold."]
pub const NRF_POWER_THRESHOLDS_NRF_POWER_THRESHOLD_V19: NRF_POWER_THRESHOLDS = 6;
#[doc = "< 2.0 Volts power failure threshold."]
pub const NRF_POWER_THRESHOLDS_NRF_POWER_THRESHOLD_V20: NRF_POWER_THRESHOLDS = 7;
#[doc = "< 2.1 Volts power failure threshold."]
pub const NRF_POWER_THRESHOLDS_NRF_POWER_THRESHOLD_V21: NRF_POWER_THRESHOLDS = 8;
#[doc = "< 2.2 Volts power failure threshold."]
pub const NRF_POWER_THRESHOLDS_NRF_POWER_THRESHOLD_V22: NRF_POWER_THRESHOLDS = 9;
#[doc = "< 2.3 Volts power failure threshold."]
pub const NRF_POWER_THRESHOLDS_NRF_POWER_THRESHOLD_V23: NRF_POWER_THRESHOLDS = 10;
#[doc = "< 2.4 Volts power failure threshold."]
pub const NRF_POWER_THRESHOLDS_NRF_POWER_THRESHOLD_V24: NRF_POWER_THRESHOLDS = 11;
#[doc = "< 2.5 Volts power failure threshold."]
pub const NRF_POWER_THRESHOLDS_NRF_POWER_THRESHOLD_V25: NRF_POWER_THRESHOLDS = 12;
#[doc = "< 2.6 Volts power failure threshold."]
pub const NRF_POWER_THRESHOLDS_NRF_POWER_THRESHOLD_V26: NRF_POWER_THRESHOLDS = 13;
#[doc = "< 2.7 Volts power failure threshold."]
pub const NRF_POWER_THRESHOLDS_NRF_POWER_THRESHOLD_V27: NRF_POWER_THRESHOLDS = 14;
#[doc = "< 2.8 Volts power failure threshold."]
pub const NRF_POWER_THRESHOLDS_NRF_POWER_THRESHOLD_V28: NRF_POWER_THRESHOLDS = 15;
#[doc = "@brief Power failure thresholds"]
pub type NRF_POWER_THRESHOLDS = self::c_uint;
#[doc = "< 2.7 Volts power failure threshold."]
pub const NRF_POWER_THRESHOLDVDDHS_NRF_POWER_THRESHOLDVDDH_V27: NRF_POWER_THRESHOLDVDDHS = 0;
#[doc = "< 2.8 Volts power failure threshold."]
pub const NRF_POWER_THRESHOLDVDDHS_NRF_POWER_THRESHOLDVDDH_V28: NRF_POWER_THRESHOLDVDDHS = 1;
#[doc = "< 2.9 Volts power failure threshold."]
pub const NRF_POWER_THRESHOLDVDDHS_NRF_POWER_THRESHOLDVDDH_V29: NRF_POWER_THRESHOLDVDDHS = 2;
#[doc = "< 3.0 Volts power failure threshold."]
pub const NRF_POWER_THRESHOLDVDDHS_NRF_POWER_THRESHOLDVDDH_V30: NRF_POWER_THRESHOLDVDDHS = 3;
#[doc = "< 3.1 Volts power failure threshold."]
pub const NRF_POWER_THRESHOLDVDDHS_NRF_POWER_THRESHOLDVDDH_V31: NRF_POWER_THRESHOLDVDDHS = 4;
#[doc = "< 3.2 Volts power failure threshold."]
pub const NRF_POWER_THRESHOLDVDDHS_NRF_POWER_THRESHOLDVDDH_V32: NRF_POWER_THRESHOLDVDDHS = 5;
#[doc = "< 3.3 Volts power failure threshold."]
pub const NRF_POWER_THRESHOLDVDDHS_NRF_POWER_THRESHOLDVDDH_V33: NRF_POWER_THRESHOLDVDDHS = 6;
#[doc = "< 3.4 Volts power failure threshold."]
pub const NRF_POWER_THRESHOLDVDDHS_NRF_POWER_THRESHOLDVDDH_V34: NRF_POWER_THRESHOLDVDDHS = 7;
#[doc = "< 3.5 Volts power failure threshold."]
pub const NRF_POWER_THRESHOLDVDDHS_NRF_POWER_THRESHOLDVDDH_V35: NRF_POWER_THRESHOLDVDDHS = 8;
#[doc = "< 3.6 Volts power failure threshold."]
pub const NRF_POWER_THRESHOLDVDDHS_NRF_POWER_THRESHOLDVDDH_V36: NRF_POWER_THRESHOLDVDDHS = 9;
#[doc = "< 3.7 Volts power failure threshold."]
pub const NRF_POWER_THRESHOLDVDDHS_NRF_POWER_THRESHOLDVDDH_V37: NRF_POWER_THRESHOLDVDDHS = 10;
#[doc = "< 3.8 Volts power failure threshold."]
pub const NRF_POWER_THRESHOLDVDDHS_NRF_POWER_THRESHOLDVDDH_V38: NRF_POWER_THRESHOLDVDDHS = 11;
#[doc = "< 3.9 Volts power failure threshold."]
pub const NRF_POWER_THRESHOLDVDDHS_NRF_POWER_THRESHOLDVDDH_V39: NRF_POWER_THRESHOLDVDDHS = 12;
#[doc = "< 4.0 Volts power failure threshold."]
pub const NRF_POWER_THRESHOLDVDDHS_NRF_POWER_THRESHOLDVDDH_V40: NRF_POWER_THRESHOLDVDDHS = 13;
#[doc = "< 4.1 Volts power failure threshold."]
pub const NRF_POWER_THRESHOLDVDDHS_NRF_POWER_THRESHOLDVDDH_V41: NRF_POWER_THRESHOLDVDDHS = 14;
#[doc = "< 4.2 Volts power failure threshold."]
pub const NRF_POWER_THRESHOLDVDDHS_NRF_POWER_THRESHOLDVDDH_V42: NRF_POWER_THRESHOLDVDDHS = 15;
#[doc = "@brief Power failure thresholds for high voltage"]
pub type NRF_POWER_THRESHOLDVDDHS = self::c_uint;
#[doc = "< The DCDC is disabled."]
pub const NRF_POWER_DCDC_MODES_NRF_POWER_DCDC_DISABLE: NRF_POWER_DCDC_MODES = 0;
#[doc = "< The DCDC is enabled."]
pub const NRF_POWER_DCDC_MODES_NRF_POWER_DCDC_ENABLE: NRF_POWER_DCDC_MODES = 1;
#[doc = "@brief DC/DC converter modes."]
pub type NRF_POWER_DCDC_MODES = self::c_uint;
#[doc = "< The event does not have a notification."]
pub const NRF_RADIO_NOTIFICATION_DISTANCES_NRF_RADIO_NOTIFICATION_DISTANCE_NONE: NRF_RADIO_NOTIFICATION_DISTANCES = 0;
#[doc = "< The distance from the active notification to start of radio activity."]
pub const NRF_RADIO_NOTIFICATION_DISTANCES_NRF_RADIO_NOTIFICATION_DISTANCE_800US: NRF_RADIO_NOTIFICATION_DISTANCES = 1;
#[doc = "< The distance from the active notification to start of radio activity."]
pub const NRF_RADIO_NOTIFICATION_DISTANCES_NRF_RADIO_NOTIFICATION_DISTANCE_1740US: NRF_RADIO_NOTIFICATION_DISTANCES = 2;
#[doc = "< The distance from the active notification to start of radio activity."]
pub const NRF_RADIO_NOTIFICATION_DISTANCES_NRF_RADIO_NOTIFICATION_DISTANCE_2680US: NRF_RADIO_NOTIFICATION_DISTANCES = 3;
#[doc = "< The distance from the active notification to start of radio activity."]
pub const NRF_RADIO_NOTIFICATION_DISTANCES_NRF_RADIO_NOTIFICATION_DISTANCE_3620US: NRF_RADIO_NOTIFICATION_DISTANCES = 4;
#[doc = "< The distance from the active notification to start of radio activity."]
pub const NRF_RADIO_NOTIFICATION_DISTANCES_NRF_RADIO_NOTIFICATION_DISTANCE_4560US: NRF_RADIO_NOTIFICATION_DISTANCES = 5;
#[doc = "< The distance from the active notification to start of radio activity."]
pub const NRF_RADIO_NOTIFICATION_DISTANCES_NRF_RADIO_NOTIFICATION_DISTANCE_5500US: NRF_RADIO_NOTIFICATION_DISTANCES = 6;
#[doc = "@brief Radio notification distances."]
pub type NRF_RADIO_NOTIFICATION_DISTANCES = self::c_uint;
#[doc = "< The event does not have a radio notification signal."]
pub const NRF_RADIO_NOTIFICATION_TYPES_NRF_RADIO_NOTIFICATION_TYPE_NONE: NRF_RADIO_NOTIFICATION_TYPES = 0;
#[doc = "< Using interrupt for notification when the radio will be enabled."]
pub const NRF_RADIO_NOTIFICATION_TYPES_NRF_RADIO_NOTIFICATION_TYPE_INT_ON_ACTIVE: NRF_RADIO_NOTIFICATION_TYPES = 1;
#[doc = "< Using interrupt for notification when the radio has been disabled."]
pub const NRF_RADIO_NOTIFICATION_TYPES_NRF_RADIO_NOTIFICATION_TYPE_INT_ON_INACTIVE: NRF_RADIO_NOTIFICATION_TYPES = 2;
#[doc = "< Using interrupt for notification both when the radio will be enabled and disabled."]
pub const NRF_RADIO_NOTIFICATION_TYPES_NRF_RADIO_NOTIFICATION_TYPE_INT_ON_BOTH: NRF_RADIO_NOTIFICATION_TYPES = 3;
#[doc = "@brief Radio notification types."]
pub type NRF_RADIO_NOTIFICATION_TYPES = self::c_uint;
#[doc = "< This signal indicates the start of the radio timeslot."]
pub const NRF_RADIO_CALLBACK_SIGNAL_TYPE_NRF_RADIO_CALLBACK_SIGNAL_TYPE_START: NRF_RADIO_CALLBACK_SIGNAL_TYPE = 0;
#[doc = "< This signal indicates the NRF_TIMER0 interrupt."]
pub const NRF_RADIO_CALLBACK_SIGNAL_TYPE_NRF_RADIO_CALLBACK_SIGNAL_TYPE_TIMER0: NRF_RADIO_CALLBACK_SIGNAL_TYPE = 1;
#[doc = "< This signal indicates the NRF_RADIO interrupt."]
pub const NRF_RADIO_CALLBACK_SIGNAL_TYPE_NRF_RADIO_CALLBACK_SIGNAL_TYPE_RADIO: NRF_RADIO_CALLBACK_SIGNAL_TYPE = 2;
#[doc = "< This signal indicates extend action failed."]
pub const NRF_RADIO_CALLBACK_SIGNAL_TYPE_NRF_RADIO_CALLBACK_SIGNAL_TYPE_EXTEND_FAILED: NRF_RADIO_CALLBACK_SIGNAL_TYPE =
    3;
#[doc = "< This signal indicates extend action succeeded."]
pub const NRF_RADIO_CALLBACK_SIGNAL_TYPE_NRF_RADIO_CALLBACK_SIGNAL_TYPE_EXTEND_SUCCEEDED:
    NRF_RADIO_CALLBACK_SIGNAL_TYPE = 4;
#[doc = "@brief The Radio signal callback types."]
pub type NRF_RADIO_CALLBACK_SIGNAL_TYPE = self::c_uint;
#[doc = "< Return without action."]
pub const NRF_RADIO_SIGNAL_CALLBACK_ACTION_NRF_RADIO_SIGNAL_CALLBACK_ACTION_NONE: NRF_RADIO_SIGNAL_CALLBACK_ACTION = 0;
#[doc = "< Request an extension of the current\ntimeslot. Maximum execution time for this action:\n@ref NRF_RADIO_MAX_EXTENSION_PROCESSING_TIME_US.\nThis action must be started at least\n@ref NRF_RADIO_MIN_EXTENSION_MARGIN_US before\nthe end of the timeslot."]
pub const NRF_RADIO_SIGNAL_CALLBACK_ACTION_NRF_RADIO_SIGNAL_CALLBACK_ACTION_EXTEND: NRF_RADIO_SIGNAL_CALLBACK_ACTION =
    1;
#[doc = "< End the current radio timeslot."]
pub const NRF_RADIO_SIGNAL_CALLBACK_ACTION_NRF_RADIO_SIGNAL_CALLBACK_ACTION_END: NRF_RADIO_SIGNAL_CALLBACK_ACTION = 2;
#[doc = "< Request a new radio timeslot and end the current timeslot."]
pub const NRF_RADIO_SIGNAL_CALLBACK_ACTION_NRF_RADIO_SIGNAL_CALLBACK_ACTION_REQUEST_AND_END:
    NRF_RADIO_SIGNAL_CALLBACK_ACTION = 3;
#[doc = "@brief The actions requested by the signal callback.\n\n  This code gives the SOC instructions about what action to take when the signal callback has\n  returned."]
pub type NRF_RADIO_SIGNAL_CALLBACK_ACTION = self::c_uint;
#[doc = "< The SoftDevice will guarantee that the high frequency clock source is the\nexternal crystal for the whole duration of the timeslot. This should be the\npreferred option for events that use the radio or require high timing accuracy.\n@note The SoftDevice will automatically turn on and off the external crystal,\nat the beginning and end of the timeslot, respectively. The crystal may also\nintentionally be left running after the timeslot, in cases where it is needed\nby the SoftDevice shortly after the end of the timeslot."]
pub const NRF_RADIO_HFCLK_CFG_NRF_RADIO_HFCLK_CFG_XTAL_GUARANTEED: NRF_RADIO_HFCLK_CFG = 0;
#[doc = "< This configuration allows for earlier and tighter scheduling of timeslots.\nThe RC oscillator may be the clock source in part or for the whole duration of the timeslot.\nThe RC oscillator's accuracy must therefore be taken into consideration.\n@note If the application will use the radio peripheral in timeslots with this configuration,\nit must make sure that the crystal is running and stable before starting the radio."]
pub const NRF_RADIO_HFCLK_CFG_NRF_RADIO_HFCLK_CFG_NO_GUARANTEE: NRF_RADIO_HFCLK_CFG = 1;
#[doc = "@brief Radio timeslot high frequency clock source configuration."]
pub type NRF_RADIO_HFCLK_CFG = self::c_uint;
#[doc = "< High (equal priority as the normal connection priority of the SoftDevice stack(s))."]
pub const NRF_RADIO_PRIORITY_NRF_RADIO_PRIORITY_HIGH: NRF_RADIO_PRIORITY = 0;
#[doc = "< Normal (equal priority as the priority of secondary activities of the SoftDevice stack(s))."]
pub const NRF_RADIO_PRIORITY_NRF_RADIO_PRIORITY_NORMAL: NRF_RADIO_PRIORITY = 1;
#[doc = "@brief Radio timeslot priorities."]
pub type NRF_RADIO_PRIORITY = self::c_uint;
#[doc = "< Request radio timeslot as early as possible. This should always be used for the first request in a session."]
pub const NRF_RADIO_REQUEST_TYPE_NRF_RADIO_REQ_TYPE_EARLIEST: NRF_RADIO_REQUEST_TYPE = 0;
#[doc = "< Normal radio timeslot request."]
pub const NRF_RADIO_REQUEST_TYPE_NRF_RADIO_REQ_TYPE_NORMAL: NRF_RADIO_REQUEST_TYPE = 1;
#[doc = "@brief Radio timeslot request type."]
pub type NRF_RADIO_REQUEST_TYPE = self::c_uint;
#[doc = "< Event indicating that the HFCLK has started."]
pub const NRF_SOC_EVTS_NRF_EVT_HFCLKSTARTED: NRF_SOC_EVTS = 0;
#[doc = "< Event indicating that a power failure warning has occurred."]
pub const NRF_SOC_EVTS_NRF_EVT_POWER_FAILURE_WARNING: NRF_SOC_EVTS = 1;
#[doc = "< Event indicating that the ongoing flash operation has completed successfully."]
pub const NRF_SOC_EVTS_NRF_EVT_FLASH_OPERATION_SUCCESS: NRF_SOC_EVTS = 2;
#[doc = "< Event indicating that the ongoing flash operation has timed out with an error."]
pub const NRF_SOC_EVTS_NRF_EVT_FLASH_OPERATION_ERROR: NRF_SOC_EVTS = 3;
#[doc = "< Event indicating that a radio timeslot was blocked."]
pub const NRF_SOC_EVTS_NRF_EVT_RADIO_BLOCKED: NRF_SOC_EVTS = 4;
#[doc = "< Event indicating that a radio timeslot was canceled by SoftDevice."]
pub const NRF_SOC_EVTS_NRF_EVT_RADIO_CANCELED: NRF_SOC_EVTS = 5;
#[doc = "< Event indicating that a radio timeslot signal callback handler return was invalid."]
pub const NRF_SOC_EVTS_NRF_EVT_RADIO_SIGNAL_CALLBACK_INVALID_RETURN: NRF_SOC_EVTS = 6;
#[doc = "< Event indicating that a radio timeslot session is idle."]
pub const NRF_SOC_EVTS_NRF_EVT_RADIO_SESSION_IDLE: NRF_SOC_EVTS = 7;
#[doc = "< Event indicating that a radio timeslot session is closed."]
pub const NRF_SOC_EVTS_NRF_EVT_RADIO_SESSION_CLOSED: NRF_SOC_EVTS = 8;
#[doc = "< Event indicating that a USB 3.3 V supply is ready."]
pub const NRF_SOC_EVTS_NRF_EVT_POWER_USB_POWER_READY: NRF_SOC_EVTS = 9;
#[doc = "< Event indicating that voltage supply is detected on VBUS."]
pub const NRF_SOC_EVTS_NRF_EVT_POWER_USB_DETECTED: NRF_SOC_EVTS = 10;
#[doc = "< Event indicating that voltage supply is removed from VBUS."]
pub const NRF_SOC_EVTS_NRF_EVT_POWER_USB_REMOVED: NRF_SOC_EVTS = 11;
pub const NRF_SOC_EVTS_NRF_EVT_NUMBER_OF_EVTS: NRF_SOC_EVTS = 12;
#[doc = "@brief SoC Events."]
pub type NRF_SOC_EVTS = self::c_uint;
#[doc = "@brief Represents a mutex for use with the nrf_mutex functions.\n @note Accessing the value directly is not safe, use the mutex functions!"]
pub type nrf_mutex_t = u8;
#[doc = "@brief Parameters for a request for a timeslot as early as possible."]
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct nrf_radio_request_earliest_t {
    #[doc = "< High frequency clock source, see @ref NRF_RADIO_HFCLK_CFG."]
    pub hfclk: u8,
    #[doc = "< The radio timeslot priority, see @ref NRF_RADIO_PRIORITY."]
    pub priority: u8,
    #[doc = "< The radio timeslot length (in the range 100 to 100,000] microseconds)."]
    pub length_us: u32,
    #[doc = "< Longest acceptable delay until the start of the requested timeslot (up to @ref NRF_RADIO_EARLIEST_TIMEOUT_MAX_US microseconds)."]
    pub timeout_us: u32,
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of nrf_radio_request_earliest_t"][::core::mem::size_of::<nrf_radio_request_earliest_t>() - 12usize];
    ["Alignment of nrf_radio_request_earliest_t"][::core::mem::align_of::<nrf_radio_request_earliest_t>() - 4usize];
    ["Offset of field: nrf_radio_request_earliest_t::hfclk"]
        [::core::mem::offset_of!(nrf_radio_request_earliest_t, hfclk) - 0usize];
    ["Offset of field: nrf_radio_request_earliest_t::priority"]
        [::core::mem::offset_of!(nrf_radio_request_earliest_t, priority) - 1usize];
    ["Offset of field: nrf_radio_request_earliest_t::length_us"]
        [::core::mem::offset_of!(nrf_radio_request_earliest_t, length_us) - 4usize];
    ["Offset of field: nrf_radio_request_earliest_t::timeout_us"]
        [::core::mem::offset_of!(nrf_radio_request_earliest_t, timeout_us) - 8usize];
};
#[doc = "@brief Parameters for a normal radio timeslot request."]
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct nrf_radio_request_normal_t {
    #[doc = "< High frequency clock source, see @ref NRF_RADIO_HFCLK_CFG."]
    pub hfclk: u8,
    #[doc = "< The radio timeslot priority, see @ref NRF_RADIO_PRIORITY."]
    pub priority: u8,
    #[doc = "< Distance from the start of the previous radio timeslot (up to @ref NRF_RADIO_DISTANCE_MAX_US microseconds)."]
    pub distance_us: u32,
    #[doc = "< The radio timeslot length (in the range [100..100,000] microseconds)."]
    pub length_us: u32,
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of nrf_radio_request_normal_t"][::core::mem::size_of::<nrf_radio_request_normal_t>() - 12usize];
    ["Alignment of nrf_radio_request_normal_t"][::core::mem::align_of::<nrf_radio_request_normal_t>() - 4usize];
    ["Offset of field: nrf_radio_request_normal_t::hfclk"]
        [::core::mem::offset_of!(nrf_radio_request_normal_t, hfclk) - 0usize];
    ["Offset of field: nrf_radio_request_normal_t::priority"]
        [::core::mem::offset_of!(nrf_radio_request_normal_t, priority) - 1usize];
    ["Offset of field: nrf_radio_request_normal_t::distance_us"]
        [::core::mem::offset_of!(nrf_radio_request_normal_t, distance_us) - 4usize];
    ["Offset of field: nrf_radio_request_normal_t::length_us"]
        [::core::mem::offset_of!(nrf_radio_request_normal_t, length_us) - 8usize];
};
#[doc = "@brief Radio timeslot request parameters."]
#[repr(C)]
#[derive(Copy, Clone)]
pub struct nrf_radio_request_t {
    #[doc = "< Type of request, see @ref NRF_RADIO_REQUEST_TYPE."]
    pub request_type: u8,
    #[doc = "< Parameter union."]
    pub params: nrf_radio_request_t__bindgen_ty_1,
}
#[repr(C)]
#[derive(Copy, Clone)]
pub union nrf_radio_request_t__bindgen_ty_1 {
    #[doc = "< Parameters for requesting a radio timeslot as early as possible."]
    pub earliest: nrf_radio_request_earliest_t,
    #[doc = "< Parameters for requesting a normal radio timeslot."]
    pub normal: nrf_radio_request_normal_t,
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of nrf_radio_request_t__bindgen_ty_1"]
        [::core::mem::size_of::<nrf_radio_request_t__bindgen_ty_1>() - 12usize];
    ["Alignment of nrf_radio_request_t__bindgen_ty_1"]
        [::core::mem::align_of::<nrf_radio_request_t__bindgen_ty_1>() - 4usize];
    ["Offset of field: nrf_radio_request_t__bindgen_ty_1::earliest"]
        [::core::mem::offset_of!(nrf_radio_request_t__bindgen_ty_1, earliest) - 0usize];
    ["Offset of field: nrf_radio_request_t__bindgen_ty_1::normal"]
        [::core::mem::offset_of!(nrf_radio_request_t__bindgen_ty_1, normal) - 0usize];
};
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of nrf_radio_request_t"][::core::mem::size_of::<nrf_radio_request_t>() - 16usize];
    ["Alignment of nrf_radio_request_t"][::core::mem::align_of::<nrf_radio_request_t>() - 4usize];
    ["Offset of field: nrf_radio_request_t::request_type"]
        [::core::mem::offset_of!(nrf_radio_request_t, request_type) - 0usize];
    ["Offset of field: nrf_radio_request_t::params"][::core::mem::offset_of!(nrf_radio_request_t, params) - 4usize];
};
#[doc = "@brief Return parameters of the radio timeslot signal callback."]
#[repr(C)]
#[derive(Copy, Clone)]
pub struct nrf_radio_signal_callback_return_param_t {
    #[doc = "< The action requested by the application when returning from the signal callback, see @ref NRF_RADIO_SIGNAL_CALLBACK_ACTION."]
    pub callback_action: u8,
    #[doc = "< Parameter union."]
    pub params: nrf_radio_signal_callback_return_param_t__bindgen_ty_1,
}
#[repr(C)]
#[derive(Copy, Clone)]
pub union nrf_radio_signal_callback_return_param_t__bindgen_ty_1 {
    #[doc = "< Additional parameters for return_code @ref NRF_RADIO_SIGNAL_CALLBACK_ACTION_REQUEST_AND_END."]
    pub request: nrf_radio_signal_callback_return_param_t__bindgen_ty_1__bindgen_ty_1,
    #[doc = "< Additional parameters for return_code @ref NRF_RADIO_SIGNAL_CALLBACK_ACTION_EXTEND."]
    pub extend: nrf_radio_signal_callback_return_param_t__bindgen_ty_1__bindgen_ty_2,
}
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct nrf_radio_signal_callback_return_param_t__bindgen_ty_1__bindgen_ty_1 {
    #[doc = "< The request parameters for the next radio timeslot."]
    pub p_next: *mut nrf_radio_request_t,
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of nrf_radio_signal_callback_return_param_t__bindgen_ty_1__bindgen_ty_1"]
        [::core::mem::size_of::<nrf_radio_signal_callback_return_param_t__bindgen_ty_1__bindgen_ty_1>() - 4usize];
    ["Alignment of nrf_radio_signal_callback_return_param_t__bindgen_ty_1__bindgen_ty_1"]
        [::core::mem::align_of::<nrf_radio_signal_callback_return_param_t__bindgen_ty_1__bindgen_ty_1>() - 4usize];
    ["Offset of field: nrf_radio_signal_callback_return_param_t__bindgen_ty_1__bindgen_ty_1::p_next"][::core::mem::offset_of!(
        nrf_radio_signal_callback_return_param_t__bindgen_ty_1__bindgen_ty_1,
        p_next
    ) - 0usize];
};
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct nrf_radio_signal_callback_return_param_t__bindgen_ty_1__bindgen_ty_2 {
    #[doc = "< Requested extension of the radio timeslot duration (microseconds) (for minimum time see @ref NRF_RADIO_MINIMUM_TIMESLOT_LENGTH_EXTENSION_TIME_US)."]
    pub length_us: u32,
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of nrf_radio_signal_callback_return_param_t__bindgen_ty_1__bindgen_ty_2"]
        [::core::mem::size_of::<nrf_radio_signal_callback_return_param_t__bindgen_ty_1__bindgen_ty_2>() - 4usize];
    ["Alignment of nrf_radio_signal_callback_return_param_t__bindgen_ty_1__bindgen_ty_2"]
        [::core::mem::align_of::<nrf_radio_signal_callback_return_param_t__bindgen_ty_1__bindgen_ty_2>() - 4usize];
    ["Offset of field: nrf_radio_signal_callback_return_param_t__bindgen_ty_1__bindgen_ty_2::length_us"][::core::mem::offset_of!(
        nrf_radio_signal_callback_return_param_t__bindgen_ty_1__bindgen_ty_2,
        length_us
    ) - 0usize];
};
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of nrf_radio_signal_callback_return_param_t__bindgen_ty_1"]
        [::core::mem::size_of::<nrf_radio_signal_callback_return_param_t__bindgen_ty_1>() - 4usize];
    ["Alignment of nrf_radio_signal_callback_return_param_t__bindgen_ty_1"]
        [::core::mem::align_of::<nrf_radio_signal_callback_return_param_t__bindgen_ty_1>() - 4usize];
    ["Offset of field: nrf_radio_signal_callback_return_param_t__bindgen_ty_1::request"]
        [::core::mem::offset_of!(nrf_radio_signal_callback_return_param_t__bindgen_ty_1, request) - 0usize];
    ["Offset of field: nrf_radio_signal_callback_return_param_t__bindgen_ty_1::extend"]
        [::core::mem::offset_of!(nrf_radio_signal_callback_return_param_t__bindgen_ty_1, extend) - 0usize];
};
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of nrf_radio_signal_callback_return_param_t"]
        [::core::mem::size_of::<nrf_radio_signal_callback_return_param_t>() - 8usize];
    ["Alignment of nrf_radio_signal_callback_return_param_t"]
        [::core::mem::align_of::<nrf_radio_signal_callback_return_param_t>() - 4usize];
    ["Offset of field: nrf_radio_signal_callback_return_param_t::callback_action"]
        [::core::mem::offset_of!(nrf_radio_signal_callback_return_param_t, callback_action) - 0usize];
    ["Offset of field: nrf_radio_signal_callback_return_param_t::params"]
        [::core::mem::offset_of!(nrf_radio_signal_callback_return_param_t, params) - 4usize];
};
#[doc = "@brief The radio timeslot signal callback type.\n\n @note In case of invalid return parameters, the radio timeslot will automatically end\n       immediately after returning from the signal callback and the\n       @ref NRF_EVT_RADIO_SIGNAL_CALLBACK_INVALID_RETURN event will be sent.\n @note The returned struct pointer must remain valid after the signal callback\n       function returns. For instance, this means that it must not point to a stack variable.\n\n @param[in] signal_type Type of signal, see @ref NRF_RADIO_CALLBACK_SIGNAL_TYPE.\n\n @return Pointer to structure containing action requested by the application."]
pub type nrf_radio_signal_callback_t =
    ::core::option::Option<unsafe extern "C" fn(signal_type: u8) -> *mut nrf_radio_signal_callback_return_param_t>;
#[doc = "@brief AES ECB parameter typedefs"]
pub type soc_ecb_key_t = [u8; 16usize];
pub type soc_ecb_cleartext_t = [u8; 16usize];
pub type soc_ecb_ciphertext_t = [u8; 16usize];
#[doc = "@brief AES ECB data structure"]
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct nrf_ecb_hal_data_t {
    #[doc = "< Encryption key."]
    pub key: soc_ecb_key_t,
    #[doc = "< Cleartext data."]
    pub cleartext: soc_ecb_cleartext_t,
    #[doc = "< Ciphertext data."]
    pub ciphertext: soc_ecb_ciphertext_t,
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of nrf_ecb_hal_data_t"][::core::mem::size_of::<nrf_ecb_hal_data_t>() - 48usize];
    ["Alignment of nrf_ecb_hal_data_t"][::core::mem::align_of::<nrf_ecb_hal_data_t>() - 1usize];
    ["Offset of field: nrf_ecb_hal_data_t::key"][::core::mem::offset_of!(nrf_ecb_hal_data_t, key) - 0usize];
    ["Offset of field: nrf_ecb_hal_data_t::cleartext"]
        [::core::mem::offset_of!(nrf_ecb_hal_data_t, cleartext) - 16usize];
    ["Offset of field: nrf_ecb_hal_data_t::ciphertext"]
        [::core::mem::offset_of!(nrf_ecb_hal_data_t, ciphertext) - 32usize];
};
#[doc = "@brief AES ECB block. Used to provide multiple blocks in a single call\nto @ref sd_ecb_blocks_encrypt."]
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct nrf_ecb_hal_data_block_t {
    #[doc = "< Pointer to the Encryption key."]
    pub p_key: *const soc_ecb_key_t,
    #[doc = "< Pointer to the Cleartext data."]
    pub p_cleartext: *const soc_ecb_cleartext_t,
    #[doc = "< Pointer to the Ciphertext data."]
    pub p_ciphertext: *mut soc_ecb_ciphertext_t,
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of nrf_ecb_hal_data_block_t"][::core::mem::size_of::<nrf_ecb_hal_data_block_t>() - 12usize];
    ["Alignment of nrf_ecb_hal_data_block_t"][::core::mem::align_of::<nrf_ecb_hal_data_block_t>() - 4usize];
    ["Offset of field: nrf_ecb_hal_data_block_t::p_key"]
        [::core::mem::offset_of!(nrf_ecb_hal_data_block_t, p_key) - 0usize];
    ["Offset of field: nrf_ecb_hal_data_block_t::p_cleartext"]
        [::core::mem::offset_of!(nrf_ecb_hal_data_block_t, p_cleartext) - 4usize];
    ["Offset of field: nrf_ecb_hal_data_block_t::p_ciphertext"]
        [::core::mem::offset_of!(nrf_ecb_hal_data_block_t, p_ciphertext) - 8usize];
};

#[doc = "@brief Initialize a mutex.\n\n @param[in] p_mutex Pointer to the mutex to initialize.\n\n @retval ::NRF_SUCCESS"]
#[inline(always)]
pub unsafe fn sd_mutex_new(p_mutex: *mut nrf_mutex_t) -> u32 {
    let ret: u32;
    core::arch::asm!("svc 44",
        inout("r0") to_asm(p_mutex) => ret,
        lateout("r1") _,
        lateout("r2") _,
        lateout("r3") _,
        lateout("r12") _,
    );
    ret
}

#[doc = "@brief Attempt to acquire a mutex.\n\n @param[in] p_mutex Pointer to the mutex to acquire.\n\n @retval ::NRF_SUCCESS The mutex was successfully acquired.\n @retval ::NRF_ERROR_SOC_MUTEX_ALREADY_TAKEN The mutex could not be acquired."]
#[inline(always)]
pub unsafe fn sd_mutex_acquire(p_mutex: *mut nrf_mutex_t) -> u32 {
    let ret: u32;
    core::arch::asm!("svc 45",
        inout("r0") to_asm(p_mutex) => ret,
        lateout("r1") _,
        lateout("r2") _,
        lateout("r3") _,
        lateout("r12") _,
    );
    ret
}

#[doc = "@brief Release a mutex.\n\n @param[in] p_mutex Pointer to the mutex to release.\n\n @retval ::NRF_SUCCESS"]
#[inline(always)]
pub unsafe fn sd_mutex_release(p_mutex: *mut nrf_mutex_t) -> u32 {
    let ret: u32;
    core::arch::asm!("svc 46",
        inout("r0") to_asm(p_mutex) => ret,
        lateout("r1") _,
        lateout("r2") _,
        lateout("r3") _,
        lateout("r12") _,
    );
    ret
}

#[doc = "@brief Query the capacity of the application random pool.\n\n @param[out] p_pool_capacity The capacity of the pool.\n\n @retval ::NRF_SUCCESS"]
#[inline(always)]
pub unsafe fn sd_rand_application_pool_capacity_get(p_pool_capacity: *mut u8) -> u32 {
    let ret: u32;
    core::arch::asm!("svc 47",
        inout("r0") to_asm(p_pool_capacity) => ret,
        lateout("r1") _,
        lateout("r2") _,
        lateout("r3") _,
        lateout("r12") _,
    );
    ret
}

#[doc = "@brief Get number of random bytes available to the application.\n\n @param[out] p_bytes_available The number of bytes currently available in the pool.\n\n @retval ::NRF_SUCCESS"]
#[inline(always)]
pub unsafe fn sd_rand_application_bytes_available_get(p_bytes_available: *mut u8) -> u32 {
    let ret: u32;
    core::arch::asm!("svc 48",
        inout("r0") to_asm(p_bytes_available) => ret,
        lateout("r1") _,
        lateout("r2") _,
        lateout("r3") _,
        lateout("r12") _,
    );
    ret
}

#[doc = "@brief Get random bytes from the application pool.\n\n @param[out]  p_buff  Pointer to unit8_t buffer for storing the bytes.\n @param[in]   length  Number of bytes to take from pool and place in p_buff.\n\n @retval ::NRF_SUCCESS The requested bytes were written to p_buff.\n @retval ::NRF_ERROR_SOC_RAND_NOT_ENOUGH_VALUES No bytes were written to the buffer, because there were not enough bytes available."]
#[inline(always)]
pub unsafe fn sd_rand_application_vector_get(p_buff: *mut u8, length: u8) -> u32 {
    let ret: u32;
    core::arch::asm!("svc 49",
        inout("r0") to_asm(p_buff) => ret,
        inout("r1") to_asm(length) => _,
        lateout("r2") _,
        lateout("r3") _,
        lateout("r12") _,
    );
    ret
}

#[doc = "@brief Gets the reset reason register.\n\n @param[out]  p_reset_reason  Contents of the NRF_POWER->RESETREAS register.\n\n @retval ::NRF_SUCCESS"]
#[inline(always)]
pub unsafe fn sd_power_reset_reason_get(p_reset_reason: *mut u32) -> u32 {
    let ret: u32;
    core::arch::asm!("svc 52",
        inout("r0") to_asm(p_reset_reason) => ret,
        lateout("r1") _,
        lateout("r2") _,
        lateout("r3") _,
        lateout("r12") _,
    );
    ret
}

#[doc = "@brief Clears the bits of the reset reason register.\n\n @param[in] reset_reason_clr_msk Contains the bits to clear from the reset reason register.\n\n @retval ::NRF_SUCCESS"]
#[inline(always)]
pub unsafe fn sd_power_reset_reason_clr(reset_reason_clr_msk: u32) -> u32 {
    let ret: u32;
    core::arch::asm!("svc 53",
        inout("r0") to_asm(reset_reason_clr_msk) => ret,
        lateout("r1") _,
        lateout("r2") _,
        lateout("r3") _,
        lateout("r12") _,
    );
    ret
}

#[doc = "@brief Sets the power mode when in CPU sleep.\n\n @param[in] power_mode The power mode to use when in CPU sleep, see @ref NRF_POWER_MODES. @sa sd_app_evt_wait\n\n @retval ::NRF_SUCCESS The power mode was set.\n @retval ::NRF_ERROR_SOC_POWER_MODE_UNKNOWN The power mode was unknown."]
#[inline(always)]
pub unsafe fn sd_power_mode_set(power_mode: u8) -> u32 {
    let ret: u32;
    core::arch::asm!("svc 50",
        inout("r0") to_asm(power_mode) => ret,
        lateout("r1") _,
        lateout("r2") _,
        lateout("r3") _,
        lateout("r12") _,
    );
    ret
}

#[doc = "@brief Puts the chip in System OFF mode.\n\n @retval ::NRF_ERROR_SOC_POWER_OFF_SHOULD_NOT_RETURN"]
#[inline(always)]
pub unsafe fn sd_power_system_off() -> u32 {
    let ret: u32;
    core::arch::asm!("svc 51",
        lateout("r0") ret,
        lateout("r1") _,
        lateout("r2") _,
        lateout("r3") _,
        lateout("r12") _,
    );
    ret
}

#[doc = "@brief Enables or disables the power-fail comparator.\n\n Enabling this will give a SoftDevice event (NRF_EVT_POWER_FAILURE_WARNING) when the power failure warning occurs.\n The event can be retrieved with sd_evt_get();\n\n @param[in] pof_enable    True if the power-fail comparator should be enabled, false if it should be disabled.\n\n @retval ::NRF_SUCCESS"]
#[inline(always)]
pub unsafe fn sd_power_pof_enable(pof_enable: u8) -> u32 {
    let ret: u32;
    core::arch::asm!("svc 54",
        inout("r0") to_asm(pof_enable) => ret,
        lateout("r1") _,
        lateout("r2") _,
        lateout("r3") _,
        lateout("r12") _,
    );
    ret
}

#[doc = "@brief Enables or disables the USB power ready event.\n\n Enabling this will give a SoftDevice event (NRF_EVT_POWER_USB_POWER_READY) when a USB 3.3 V supply is ready.\n The event can be retrieved with sd_evt_get();\n\n @param[in] usbpwrrdy_enable    True if the power ready event should be enabled, false if it should be disabled.\n\n @note Calling this function on a chip without USBD peripheral will result in undefined behaviour.\n\n @retval ::NRF_SUCCESS"]
#[inline(always)]
pub unsafe fn sd_power_usbpwrrdy_enable(usbpwrrdy_enable: u8) -> u32 {
    let ret: u32;
    core::arch::asm!("svc 77",
        inout("r0") to_asm(usbpwrrdy_enable) => ret,
        lateout("r1") _,
        lateout("r2") _,
        lateout("r3") _,
        lateout("r12") _,
    );
    ret
}

#[doc = "@brief Enables or disables the power USB-detected event.\n\n Enabling this will give a SoftDevice event (NRF_EVT_POWER_USB_DETECTED) when a voltage supply is detected on VBUS.\n The event can be retrieved with sd_evt_get();\n\n @param[in] usbdetected_enable    True if the power ready event should be enabled, false if it should be disabled.\n\n @note Calling this function on a chip without USBD peripheral will result in undefined behaviour.\n\n @retval ::NRF_SUCCESS"]
#[inline(always)]
pub unsafe fn sd_power_usbdetected_enable(usbdetected_enable: u8) -> u32 {
    let ret: u32;
    core::arch::asm!("svc 78",
        inout("r0") to_asm(usbdetected_enable) => ret,
        lateout("r1") _,
        lateout("r2") _,
        lateout("r3") _,
        lateout("r12") _,
    );
    ret
}

#[doc = "@brief Enables or disables the power USB-removed event.\n\n Enabling this will give a SoftDevice event (NRF_EVT_POWER_USB_REMOVED) when a voltage supply is removed from VBUS.\n The event can be retrieved with sd_evt_get();\n\n @param[in] usbremoved_enable    True if the power ready event should be enabled, false if it should be disabled.\n\n @note Calling this function on a chip without USBD peripheral will result in undefined behaviour.\n\n @retval ::NRF_SUCCESS"]
#[inline(always)]
pub unsafe fn sd_power_usbremoved_enable(usbremoved_enable: u8) -> u32 {
    let ret: u32;
    core::arch::asm!("svc 79",
        inout("r0") to_asm(usbremoved_enable) => ret,
        lateout("r1") _,
        lateout("r2") _,
        lateout("r3") _,
        lateout("r12") _,
    );
    ret
}

#[doc = "@brief Get USB supply status register content.\n\n @param[out] usbregstatus    The content of USBREGSTATUS register.\n\n @note Calling this function on a chip without USBD peripheral will result in undefined behaviour.\n\n @retval ::NRF_SUCCESS"]
#[inline(always)]
pub unsafe fn sd_power_usbregstatus_get(usbregstatus: *mut u32) -> u32 {
    let ret: u32;
    core::arch::asm!("svc 80",
        inout("r0") to_asm(usbregstatus) => ret,
        lateout("r1") _,
        lateout("r2") _,
        lateout("r3") _,
        lateout("r12") _,
    );
    ret
}

#[doc = "@brief Sets the power failure comparator threshold value.\n\n @note: Power failure comparator threshold setting. This setting applies both for normal voltage\n        mode (supply connected to both VDD and VDDH) and high voltage mode (supply connected to\n        VDDH only).\n\n @param[in] threshold The power-fail threshold value to use, see @ref NRF_POWER_THRESHOLDS.\n\n @retval ::NRF_SUCCESS The power failure threshold was set.\n @retval ::NRF_ERROR_SOC_POWER_POF_THRESHOLD_UNKNOWN The power failure threshold is unknown."]
#[inline(always)]
pub unsafe fn sd_power_pof_threshold_set(threshold: u8) -> u32 {
    let ret: u32;
    core::arch::asm!("svc 55",
        inout("r0") to_asm(threshold) => ret,
        lateout("r1") _,
        lateout("r2") _,
        lateout("r3") _,
        lateout("r12") _,
    );
    ret
}

#[doc = "@brief Sets the power failure comparator threshold value for high voltage.\n\n @note: Power failure comparator threshold setting for high voltage mode (supply connected to\n        VDDH only). This setting does not apply for normal voltage mode (supply connected to both\n        VDD and VDDH).\n\n @param[in] threshold The power-fail threshold value to use, see @ref NRF_POWER_THRESHOLDVDDHS.\n\n @retval ::NRF_SUCCESS The power failure threshold was set.\n @retval ::NRF_ERROR_SOC_POWER_POF_THRESHOLD_UNKNOWN The power failure threshold is unknown."]
#[inline(always)]
pub unsafe fn sd_power_pof_thresholdvddh_set(threshold: u8) -> u32 {
    let ret: u32;
    core::arch::asm!("svc 56",
        inout("r0") to_asm(threshold) => ret,
        lateout("r1") _,
        lateout("r2") _,
        lateout("r3") _,
        lateout("r12") _,
    );
    ret
}

#[doc = "@brief Writes the NRF_POWER->RAM[index].POWERSET register.\n\n @param[in] index Contains the index in the NRF_POWER->RAM[index].POWERSET register to write to.\n @param[in] ram_powerset Contains the word to write to the NRF_POWER->RAM[index].POWERSET register.\n\n @retval ::NRF_SUCCESS"]
#[inline(always)]
pub unsafe fn sd_power_ram_power_set(index: u8, ram_powerset: u32) -> u32 {
    let ret: u32;
    core::arch::asm!("svc 57",
        inout("r0") to_asm(index) => ret,
        inout("r1") to_asm(ram_powerset) => _,
        lateout("r2") _,
        lateout("r3") _,
        lateout("r12") _,
    );
    ret
}

#[doc = "@brief Writes the NRF_POWER->RAM[index].POWERCLR register.\n\n @param[in] index Contains the index in the NRF_POWER->RAM[index].POWERCLR register to write to.\n @param[in] ram_powerclr Contains the word to write to the NRF_POWER->RAM[index].POWERCLR register.\n\n @retval ::NRF_SUCCESS"]
#[inline(always)]
pub unsafe fn sd_power_ram_power_clr(index: u8, ram_powerclr: u32) -> u32 {
    let ret: u32;
    core::arch::asm!("svc 58",
        inout("r0") to_asm(index) => ret,
        inout("r1") to_asm(ram_powerclr) => _,
        lateout("r2") _,
        lateout("r3") _,
        lateout("r12") _,
    );
    ret
}

#[doc = "@brief Get contents of NRF_POWER->RAM[index].POWER register, indicates power status of RAM[index] blocks.\n\n @param[in] index Contains the index in the NRF_POWER->RAM[index].POWER register to read from.\n @param[out] p_ram_power Content of NRF_POWER->RAM[index].POWER register.\n\n @retval ::NRF_SUCCESS"]
#[inline(always)]
pub unsafe fn sd_power_ram_power_get(index: u8, p_ram_power: *mut u32) -> u32 {
    let ret: u32;
    core::arch::asm!("svc 59",
        inout("r0") to_asm(index) => ret,
        inout("r1") to_asm(p_ram_power) => _,
        lateout("r2") _,
        lateout("r3") _,
        lateout("r12") _,
    );
    ret
}

#[doc = "@brief Set bits in the general purpose retention registers (NRF_POWER->GPREGRET*).\n\n @param[in] gpregret_id 0 for GPREGRET, 1 for GPREGRET2.\n @param[in] gpregret_msk Bits to be set in the GPREGRET register.\n\n @retval ::NRF_SUCCESS"]
#[inline(always)]
pub unsafe fn sd_power_gpregret_set(gpregret_id: u32, gpregret_msk: u32) -> u32 {
    let ret: u32;
    core::arch::asm!("svc 60",
        inout("r0") to_asm(gpregret_id) => ret,
        inout("r1") to_asm(gpregret_msk) => _,
        lateout("r2") _,
        lateout("r3") _,
        lateout("r12") _,
    );
    ret
}

#[doc = "@brief Clear bits in the general purpose retention registers (NRF_POWER->GPREGRET*).\n\n @param[in] gpregret_id 0 for GPREGRET, 1 for GPREGRET2.\n @param[in] gpregret_msk Bits to be clear in the GPREGRET register.\n\n @retval ::NRF_SUCCESS"]
#[inline(always)]
pub unsafe fn sd_power_gpregret_clr(gpregret_id: u32, gpregret_msk: u32) -> u32 {
    let ret: u32;
    core::arch::asm!("svc 61",
        inout("r0") to_asm(gpregret_id) => ret,
        inout("r1") to_asm(gpregret_msk) => _,
        lateout("r2") _,
        lateout("r3") _,
        lateout("r12") _,
    );
    ret
}

#[doc = "@brief Get contents of the general purpose retention registers (NRF_POWER->GPREGRET*).\n\n @param[in] gpregret_id 0 for GPREGRET, 1 for GPREGRET2.\n @param[out] p_gpregret Contents of the GPREGRET register.\n\n @retval ::NRF_SUCCESS"]
#[inline(always)]
pub unsafe fn sd_power_gpregret_get(gpregret_id: u32, p_gpregret: *mut u32) -> u32 {
    let ret: u32;
    core::arch::asm!("svc 62",
        inout("r0") to_asm(gpregret_id) => ret,
        inout("r1") to_asm(p_gpregret) => _,
        lateout("r2") _,
        lateout("r3") _,
        lateout("r12") _,
    );
    ret
}

#[doc = "@brief Enable or disable the DC/DC regulator for the regulator stage 1 (REG1).\n\n @param[in] dcdc_mode The mode of the DCDC, see @ref NRF_POWER_DCDC_MODES.\n\n @retval ::NRF_SUCCESS\n @retval ::NRF_ERROR_INVALID_PARAM The DCDC mode is invalid."]
#[inline(always)]
pub unsafe fn sd_power_dcdc_mode_set(dcdc_mode: u8) -> u32 {
    let ret: u32;
    core::arch::asm!("svc 63",
        inout("r0") to_asm(dcdc_mode) => ret,
        lateout("r1") _,
        lateout("r2") _,
        lateout("r3") _,
        lateout("r12") _,
    );
    ret
}

#[doc = "@brief Enable or disable the DC/DC regulator for the regulator stage 0 (REG0).\n\n For more details on the REG0 stage, please see product specification.\n\n @param[in] dcdc_mode The mode of the DCDC0, see @ref NRF_POWER_DCDC_MODES.\n\n @retval ::NRF_SUCCESS\n @retval ::NRF_ERROR_INVALID_PARAM The dcdc_mode is invalid."]
#[inline(always)]
pub unsafe fn sd_power_dcdc0_mode_set(dcdc_mode: u8) -> u32 {
    let ret: u32;
    core::arch::asm!("svc 64",
        inout("r0") to_asm(dcdc_mode) => ret,
        lateout("r1") _,
        lateout("r2") _,
        lateout("r3") _,
        lateout("r12") _,
    );
    ret
}

#[doc = "@brief Request the high frequency crystal oscillator.\n\n Will start the high frequency crystal oscillator, the startup time of the crystal varies\n and the ::sd_clock_hfclk_is_running function can be polled to check if it has started.\n\n @see sd_clock_hfclk_is_running\n @see sd_clock_hfclk_release\n\n @retval ::NRF_SUCCESS"]
#[inline(always)]
pub unsafe fn sd_clock_hfclk_request() -> u32 {
    let ret: u32;
    core::arch::asm!("svc 66",
        lateout("r0") ret,
        lateout("r1") _,
        lateout("r2") _,
        lateout("r3") _,
        lateout("r12") _,
    );
    ret
}

#[doc = "@brief Releases the high frequency crystal oscillator.\n\n Will stop the high frequency crystal oscillator, this happens immediately.\n\n @see sd_clock_hfclk_is_running\n @see sd_clock_hfclk_request\n\n @retval ::NRF_SUCCESS"]
#[inline(always)]
pub unsafe fn sd_clock_hfclk_release() -> u32 {
    let ret: u32;
    core::arch::asm!("svc 67",
        lateout("r0") ret,
        lateout("r1") _,
        lateout("r2") _,
        lateout("r3") _,
        lateout("r12") _,
    );
    ret
}

#[doc = "@brief Checks if the high frequency crystal oscillator is running.\n\n @see sd_clock_hfclk_request\n @see sd_clock_hfclk_release\n\n @param[out] p_is_running 1 if the external crystal oscillator is running, 0 if not.\n\n @retval ::NRF_SUCCESS"]
#[inline(always)]
pub unsafe fn sd_clock_hfclk_is_running(p_is_running: *mut u32) -> u32 {
    let ret: u32;
    core::arch::asm!("svc 68",
        inout("r0") to_asm(p_is_running) => ret,
        lateout("r1") _,
        lateout("r2") _,
        lateout("r3") _,
        lateout("r12") _,
    );
    ret
}

#[doc = "@brief Waits for an application event.\n\n An application event is either an application interrupt or a pended interrupt when the interrupt\n is disabled.\n\n When the application waits for an application event by calling this function, an interrupt that\n is enabled will be taken immediately on pending since this function will wait in thread mode,\n then the execution will return in the application's main thread.\n\n In order to wake up from disabled interrupts, the SEVONPEND flag has to be set in the Cortex-M\n MCU's System Control Register (SCR), CMSIS_SCB. In that case, when a disabled interrupt gets\n pended, this function will return to the application's main thread.\n\n @note The application must ensure that the pended flag is cleared using ::sd_nvic_ClearPendingIRQ\n       in order to sleep using this function. This is only necessary for disabled interrupts, as\n       the interrupt handler will clear the pending flag automatically for enabled interrupts.\n\n @note If an application interrupt has happened since the last time sd_app_evt_wait was\n       called this function will return immediately and not go to sleep. This is to avoid race\n       conditions that can occur when a flag is updated in the interrupt handler and processed\n       in the main loop.\n\n @post An application interrupt has happened or a interrupt pending flag is set.\n\n @retval ::NRF_SUCCESS"]
#[inline(always)]
pub unsafe fn sd_app_evt_wait() -> u32 {
    let ret: u32;
    core::arch::asm!("svc 65",
        lateout("r0") ret,
        lateout("r1") _,
        lateout("r2") _,
        lateout("r3") _,
        lateout("r12") _,
    );
    ret
}

#[doc = "@brief Get PPI channel enable register contents.\n\n @param[out] p_channel_enable The contents of the PPI CHEN register.\n\n @retval ::NRF_SUCCESS"]
#[inline(always)]
pub unsafe fn sd_ppi_channel_enable_get(p_channel_enable: *mut u32) -> u32 {
    let ret: u32;
    core::arch::asm!("svc 32",
        inout("r0") to_asm(p_channel_enable) => ret,
        lateout("r1") _,
        lateout("r2") _,
        lateout("r3") _,
        lateout("r12") _,
    );
    ret
}

#[doc = "@brief Set PPI channel enable register.\n\n @param[in] channel_enable_set_msk Mask containing the bits to set in the PPI CHEN register.\n\n @retval ::NRF_SUCCESS"]
#[inline(always)]
pub unsafe fn sd_ppi_channel_enable_set(channel_enable_set_msk: u32) -> u32 {
    let ret: u32;
    core::arch::asm!("svc 33",
        inout("r0") to_asm(channel_enable_set_msk) => ret,
        lateout("r1") _,
        lateout("r2") _,
        lateout("r3") _,
        lateout("r12") _,
    );
    ret
}

#[doc = "@brief Clear PPI channel enable register.\n\n @param[in] channel_enable_clr_msk Mask containing the bits to clear in the PPI CHEN register.\n\n @retval ::NRF_SUCCESS"]
#[inline(always)]
pub unsafe fn sd_ppi_channel_enable_clr(channel_enable_clr_msk: u32) -> u32 {
    let ret: u32;
    core::arch::asm!("svc 34",
        inout("r0") to_asm(channel_enable_clr_msk) => ret,
        lateout("r1") _,
        lateout("r2") _,
        lateout("r3") _,
        lateout("r12") _,
    );
    ret
}

#[doc = "@brief Assign endpoints to a PPI channel.\n\n @param[in] channel_num Number of the PPI channel to assign.\n @param[in] evt_endpoint Event endpoint of the PPI channel.\n @param[in] task_endpoint Task endpoint of the PPI channel.\n\n @retval ::NRF_ERROR_SOC_PPI_INVALID_CHANNEL The channel number is invalid.\n @retval ::NRF_SUCCESS"]
#[inline(always)]
pub unsafe fn sd_ppi_channel_assign(
    channel_num: u8,
    evt_endpoint: *const self::c_void,
    task_endpoint: *const self::c_void,
) -> u32 {
    let ret: u32;
    core::arch::asm!("svc 35",
        inout("r0") to_asm(channel_num) => ret,
        inout("r1") to_asm(evt_endpoint) => _,
        inout("r2") to_asm(task_endpoint) => _,
        lateout("r3") _,
        lateout("r12") _,
    );
    ret
}

#[doc = "@brief Task to enable a channel group.\n\n @param[in] group_num Number of the channel group.\n\n @retval ::NRF_ERROR_SOC_PPI_INVALID_GROUP The group number is invalid\n @retval ::NRF_SUCCESS"]
#[inline(always)]
pub unsafe fn sd_ppi_group_task_enable(group_num: u8) -> u32 {
    let ret: u32;
    core::arch::asm!("svc 36",
        inout("r0") to_asm(group_num) => ret,
        lateout("r1") _,
        lateout("r2") _,
        lateout("r3") _,
        lateout("r12") _,
    );
    ret
}

#[doc = "@brief Task to disable a channel group.\n\n @param[in] group_num Number of the PPI group.\n\n @retval ::NRF_ERROR_SOC_PPI_INVALID_GROUP The group number is invalid.\n @retval ::NRF_SUCCESS"]
#[inline(always)]
pub unsafe fn sd_ppi_group_task_disable(group_num: u8) -> u32 {
    let ret: u32;
    core::arch::asm!("svc 37",
        inout("r0") to_asm(group_num) => ret,
        lateout("r1") _,
        lateout("r2") _,
        lateout("r3") _,
        lateout("r12") _,
    );
    ret
}

#[doc = "@brief Assign PPI channels to a channel group.\n\n @param[in] group_num Number of the channel group.\n @param[in] channel_msk Mask of the channels to assign to the group.\n\n @retval ::NRF_ERROR_SOC_PPI_INVALID_GROUP The group number is invalid.\n @retval ::NRF_SUCCESS"]
#[inline(always)]
pub unsafe fn sd_ppi_group_assign(group_num: u8, channel_msk: u32) -> u32 {
    let ret: u32;
    core::arch::asm!("svc 38",
        inout("r0") to_asm(group_num) => ret,
        inout("r1") to_asm(channel_msk) => _,
        lateout("r2") _,
        lateout("r3") _,
        lateout("r12") _,
    );
    ret
}

#[doc = "@brief Gets the PPI channels of a channel group.\n\n @param[in]   group_num Number of the channel group.\n @param[out]  p_channel_msk Mask of the channels assigned to the group.\n\n @retval ::NRF_ERROR_SOC_PPI_INVALID_GROUP The group number is invalid.\n @retval ::NRF_SUCCESS"]
#[inline(always)]
pub unsafe fn sd_ppi_group_get(group_num: u8, p_channel_msk: *mut u32) -> u32 {
    let ret: u32;
    core::arch::asm!("svc 39",
        inout("r0") to_asm(group_num) => ret,
        inout("r1") to_asm(p_channel_msk) => _,
        lateout("r2") _,
        lateout("r3") _,
        lateout("r12") _,
    );
    ret
}

#[doc = "@brief Configures the Radio Notification signal.\n\n @note\n      - The notification signal latency depends on the interrupt priority settings of SWI used\n        for notification signal.\n      - To ensure that the radio notification signal behaves in a consistent way, the radio\n        notifications must be configured when there is no protocol stack or other SoftDevice\n        activity in progress. It is recommended that the radio notification signal is\n        configured directly after the SoftDevice has been enabled.\n      - In the period between the ACTIVE signal and the start of the Radio Event, the SoftDevice\n        will interrupt the application to do Radio Event preparation.\n      - Using the Radio Notification feature may limit the bandwidth, as the SoftDevice may have\n        to shorten the connection events to have time for the Radio Notification signals.\n\n @param[in]  type      Type of notification signal, see @ref NRF_RADIO_NOTIFICATION_TYPES.\n                       @ref NRF_RADIO_NOTIFICATION_TYPE_NONE shall be used to turn off radio\n                       notification. Using @ref NRF_RADIO_NOTIFICATION_DISTANCE_NONE is\n                       recommended (but not required) to be used with\n                       @ref NRF_RADIO_NOTIFICATION_TYPE_NONE.\n\n @param[in]  distance  Distance between the notification signal and start of radio activity, see @ref NRF_RADIO_NOTIFICATION_DISTANCES.\n                       This parameter is ignored when @ref NRF_RADIO_NOTIFICATION_TYPE_NONE or\n                       @ref NRF_RADIO_NOTIFICATION_TYPE_INT_ON_INACTIVE is used.\n\n @retval ::NRF_ERROR_INVALID_PARAM The group number is invalid.\n @retval ::NRF_ERROR_INVALID_STATE A protocol stack or other SoftDevice is running. Stop all\n                                   running activities and retry.\n @retval ::NRF_SUCCESS"]
#[inline(always)]
pub unsafe fn sd_radio_notification_cfg_set(type_: u8, distance: u8) -> u32 {
    let ret: u32;
    core::arch::asm!("svc 69",
        inout("r0") to_asm(type_) => ret,
        inout("r1") to_asm(distance) => _,
        lateout("r2") _,
        lateout("r3") _,
        lateout("r12") _,
    );
    ret
}

#[doc = "@brief Encrypts a block according to the specified parameters.\n\n 128-bit AES encryption.\n\n @note:\n    - The application may set the SEVONPEND bit in the SCR to 1 to make the SoftDevice sleep while\n      the ECB is running. The SEVONPEND bit should only be cleared (set to 0) from application\n      main or low interrupt level.\n\n @param[in, out] p_ecb_data Pointer to the ECB parameters' struct (two input\n                            parameters and one output parameter).\n\n @retval ::NRF_SUCCESS"]
#[inline(always)]
pub unsafe fn sd_ecb_block_encrypt(p_ecb_data: *mut nrf_ecb_hal_data_t) -> u32 {
    let ret: u32;
    core::arch::asm!("svc 70",
        inout("r0") to_asm(p_ecb_data) => ret,
        lateout("r1") _,
        lateout("r2") _,
        lateout("r3") _,
        lateout("r12") _,
    );
    ret
}

#[doc = "@brief Encrypts multiple data blocks provided as an array of data block structures.\n\n @details: Performs 128-bit AES encryption on multiple data blocks\n\n @note:\n    - The application may set the SEVONPEND bit in the SCR to 1 to make the SoftDevice sleep while\n      the ECB is running. The SEVONPEND bit should only be cleared (set to 0) from application\n      main or low interrupt level.\n\n @param[in]     block_count     Count of blocks in the p_data_blocks array.\n @param[in,out] p_data_blocks   Pointer to the first entry in a contiguous array of\n                                @ref nrf_ecb_hal_data_block_t structures.\n\n @retval ::NRF_SUCCESS"]
#[inline(always)]
pub unsafe fn sd_ecb_blocks_encrypt(block_count: u8, p_data_blocks: *mut nrf_ecb_hal_data_block_t) -> u32 {
    let ret: u32;
    core::arch::asm!("svc 71",
        inout("r0") to_asm(block_count) => ret,
        inout("r1") to_asm(p_data_blocks) => _,
        lateout("r2") _,
        lateout("r3") _,
        lateout("r12") _,
    );
    ret
}

#[doc = "@brief Gets any pending events generated by the SoC API.\n\n The application should keep calling this function to get events, until ::NRF_ERROR_NOT_FOUND is returned.\n\n @param[out] p_evt_id Set to one of the values in @ref NRF_SOC_EVTS, if any events are pending.\n\n @retval ::NRF_SUCCESS An event was pending. The event id is written in the p_evt_id parameter.\n @retval ::NRF_ERROR_NOT_FOUND No pending events."]
#[inline(always)]
pub unsafe fn sd_evt_get(p_evt_id: *mut u32) -> u32 {
    let ret: u32;
    core::arch::asm!("svc 75",
        inout("r0") to_asm(p_evt_id) => ret,
        lateout("r1") _,
        lateout("r2") _,
        lateout("r3") _,
        lateout("r12") _,
    );
    ret
}

#[doc = "@brief Get the temperature measured on the chip\n\n This function will block until the temperature measurement is done.\n It takes around 50 us from call to return.\n\n @param[out] p_temp Result of temperature measurement. Die temperature in 0.25 degrees Celsius.\n\n @retval ::NRF_SUCCESS A temperature measurement was done, and the temperature was written to temp"]
#[inline(always)]
pub unsafe fn sd_temp_get(p_temp: *mut i32) -> u32 {
    let ret: u32;
    core::arch::asm!("svc 76",
        inout("r0") to_asm(p_temp) => ret,
        lateout("r1") _,
        lateout("r2") _,
        lateout("r3") _,
        lateout("r12") _,
    );
    ret
}

#[doc = "@brief Flash Write\n\n Commands to write a buffer to flash\n\n If the SoftDevice is enabled:\n  This call initiates the flash access command, and its completion will be communicated to the\n  application with exactly one of the following events:\n      - @ref NRF_EVT_FLASH_OPERATION_SUCCESS - The command was successfully completed.\n      - @ref NRF_EVT_FLASH_OPERATION_ERROR   - The command could not be started.\n\n If the SoftDevice is not enabled no event will be generated, and this call will return @ref NRF_SUCCESS when the\n write has been completed\n\n @note\n      - This call takes control over the radio and the CPU during flash erase and write to make sure that\n        they will not interfere with the flash access. This means that all interrupts will be blocked\n        for a predictable time (depending on the NVMC specification in the device's Product Specification\n        and the command parameters).\n      - The data in the p_src buffer should not be modified before the @ref NRF_EVT_FLASH_OPERATION_SUCCESS\n        or the @ref NRF_EVT_FLASH_OPERATION_ERROR have been received if the SoftDevice is enabled.\n      - This call will make the SoftDevice trigger a hardfault when the page is written, if it is\n        protected.\n\n\n @param[in]  p_dst Pointer to start of flash location to be written.\n @param[in]  p_src Pointer to buffer with data to be written.\n @param[in]  size  Number of 32-bit words to write. Maximum size is the number of words in one\n                   flash page. See the device's Product Specification for details.\n\n @retval ::NRF_ERROR_INVALID_ADDR   Tried to write to a non existing flash address, or p_dst or p_src was unaligned.\n @retval ::NRF_ERROR_BUSY           The previous command has not yet completed.\n @retval ::NRF_ERROR_INVALID_LENGTH Size was 0, or higher than the maximum allowed size.\n @retval ::NRF_ERROR_FORBIDDEN      Tried to write to an address outside the application flash area.\n @retval ::NRF_SUCCESS              The command was accepted."]
#[inline(always)]
pub unsafe fn sd_flash_write(p_dst: *mut u32, p_src: *const u32, size: u32) -> u32 {
    let ret: u32;
    core::arch::asm!("svc 41",
        inout("r0") to_asm(p_dst) => ret,
        inout("r1") to_asm(p_src) => _,
        inout("r2") to_asm(size) => _,
        lateout("r3") _,
        lateout("r12") _,
    );
    ret
}

#[doc = "@brief Flash Erase page\n\n Commands to erase a flash page\n If the SoftDevice is enabled:\n  This call initiates the flash access command, and its completion will be communicated to the\n  application with exactly one of the following events:\n      - @ref NRF_EVT_FLASH_OPERATION_SUCCESS - The command was successfully completed.\n      - @ref NRF_EVT_FLASH_OPERATION_ERROR   - The command could not be started.\n\n If the SoftDevice is not enabled no event will be generated, and this call will return @ref NRF_SUCCESS when the\n erase has been completed\n\n @note\n      - This call takes control over the radio and the CPU during flash erase and write to make sure that\n        they will not interfere with the flash access. This means that all interrupts will be blocked\n        for a predictable time (depending on the NVMC specification in the device's Product Specification\n        and the command parameters).\n      - This call will make the SoftDevice trigger a hardfault when the page is erased, if it is\n        protected.\n\n\n @param[in]  page_number           Page number of the page to erase\n\n @retval ::NRF_ERROR_INTERNAL      If a new session could not be opened due to an internal error.\n @retval ::NRF_ERROR_INVALID_ADDR  Tried to erase to a non existing flash page.\n @retval ::NRF_ERROR_BUSY          The previous command has not yet completed.\n @retval ::NRF_ERROR_FORBIDDEN     Tried to erase a page outside the application flash area.\n @retval ::NRF_SUCCESS             The command was accepted."]
#[inline(always)]
pub unsafe fn sd_flash_page_erase(page_number: u32) -> u32 {
    let ret: u32;
    core::arch::asm!("svc 40",
        inout("r0") to_asm(page_number) => ret,
        lateout("r1") _,
        lateout("r2") _,
        lateout("r3") _,
        lateout("r12") _,
    );
    ret
}

#[doc = "@brief Opens a session for radio timeslot requests.\n\n @note Only one session can be open at a time.\n @note p_radio_signal_callback(@ref NRF_RADIO_CALLBACK_SIGNAL_TYPE_START) will be called when the radio timeslot\n       starts. From this point the NRF_RADIO and NRF_TIMER0 peripherals can be freely accessed\n       by the application.\n @note p_radio_signal_callback(@ref NRF_RADIO_CALLBACK_SIGNAL_TYPE_TIMER0) is called whenever the NRF_TIMER0\n       interrupt occurs.\n @note p_radio_signal_callback(@ref NRF_RADIO_CALLBACK_SIGNAL_TYPE_RADIO) is called whenever the NRF_RADIO\n       interrupt occurs.\n @note p_radio_signal_callback() will be called at ARM interrupt priority level 0. This\n       implies that none of the sd_* API calls can be used from p_radio_signal_callback().\n\n @param[in] p_radio_signal_callback The signal callback.\n\n @retval ::NRF_ERROR_INVALID_ADDR p_radio_signal_callback is an invalid function pointer.\n @retval ::NRF_ERROR_BUSY If session cannot be opened.\n @retval ::NRF_ERROR_INTERNAL If a new session could not be opened due to an internal error.\n @retval ::NRF_SUCCESS Otherwise."]
#[inline(always)]
pub unsafe fn sd_radio_session_open(p_radio_signal_callback: nrf_radio_signal_callback_t) -> u32 {
    let ret: u32;
    core::arch::asm!("svc 72",
        inout("r0") to_asm(p_radio_signal_callback) => ret,
        lateout("r1") _,
        lateout("r2") _,
        lateout("r3") _,
        lateout("r12") _,
    );
    ret
}

#[doc = "@brief Closes a session for radio timeslot requests.\n\n @note Any current radio timeslot will be finished before the session is closed.\n @note If a radio timeslot is scheduled when the session is closed, it will be canceled.\n @note The application cannot consider the session closed until the @ref NRF_EVT_RADIO_SESSION_CLOSED\n       event is received.\n\n @retval ::NRF_ERROR_FORBIDDEN If session not opened.\n @retval ::NRF_ERROR_BUSY If session is currently being closed.\n @retval ::NRF_SUCCESS Otherwise."]
#[inline(always)]
pub unsafe fn sd_radio_session_close() -> u32 {
    let ret: u32;
    core::arch::asm!("svc 73",
        lateout("r0") ret,
        lateout("r1") _,
        lateout("r2") _,
        lateout("r3") _,
        lateout("r12") _,
    );
    ret
}

#[doc = "@brief Requests a radio timeslot.\n\n @note The request type is determined by p_request->request_type, and can be one of @ref NRF_RADIO_REQ_TYPE_EARLIEST\n       and @ref NRF_RADIO_REQ_TYPE_NORMAL. The first request in a session must always be of type @ref NRF_RADIO_REQ_TYPE_EARLIEST.\n @note For a normal request (@ref NRF_RADIO_REQ_TYPE_NORMAL), the start time of a radio timeslot is specified by\n       p_request->distance_us and is given relative to the start of the previous timeslot.\n @note A too small p_request->distance_us will lead to a @ref NRF_EVT_RADIO_BLOCKED event.\n @note Timeslots scheduled too close will lead to a @ref NRF_EVT_RADIO_BLOCKED event.\n @note See the SoftDevice Specification for more on radio timeslot scheduling, distances and lengths.\n @note If an opportunity for the first radio timeslot is not found before 100 ms after the call to this\n       function, it is not scheduled, and instead a @ref NRF_EVT_RADIO_BLOCKED event is sent.\n       The application may then try to schedule the first radio timeslot again.\n @note Successful requests will result in nrf_radio_signal_callback_t(@ref NRF_RADIO_CALLBACK_SIGNAL_TYPE_START).\n       Unsuccessful requests will result in a @ref NRF_EVT_RADIO_BLOCKED event, see @ref NRF_SOC_EVTS.\n @note The jitter in the start time of the radio timeslots is +/- @ref NRF_RADIO_START_JITTER_US us.\n @note The nrf_radio_signal_callback_t(@ref NRF_RADIO_CALLBACK_SIGNAL_TYPE_START) call has a latency relative to the\n       specified radio timeslot start, but this does not affect the actual start time of the timeslot.\n @note NRF_TIMER0 is reset at the start of the radio timeslot, and is clocked at 1MHz from the high frequency\n       (16 MHz) clock source. If p_request->hfclk_force_xtal is true, the high frequency clock is\n       guaranteed to be clocked from the external crystal.\n @note The SoftDevice will neither access the NRF_RADIO peripheral nor the NRF_TIMER0 peripheral\n       during the radio timeslot.\n\n @param[in] p_request Pointer to the request parameters.\n\n @retval ::NRF_ERROR_FORBIDDEN Either:\n                                - The session is not open.\n                                - The session is not IDLE.\n                                - This is the first request and its type is not @ref NRF_RADIO_REQ_TYPE_EARLIEST.\n                                - The request type was set to @ref NRF_RADIO_REQ_TYPE_NORMAL after a\n                                  @ref NRF_RADIO_REQ_TYPE_EARLIEST request was blocked.\n @retval ::NRF_ERROR_INVALID_ADDR If the p_request pointer is invalid.\n @retval ::NRF_ERROR_INVALID_PARAM If the parameters of p_request are not valid.\n @retval ::NRF_SUCCESS Otherwise."]
#[inline(always)]
pub unsafe fn sd_radio_request(p_request: *const nrf_radio_request_t) -> u32 {
    let ret: u32;
    core::arch::asm!("svc 74",
        inout("r0") to_asm(p_request) => ret,
        lateout("r1") _,
        lateout("r2") _,
        lateout("r3") _,
        lateout("r12") _,
    );
    ret
}

#[doc = "@brief Write register protected by the SoftDevice\n\n This function writes to a register that is write-protected by the SoftDevice. Please refer to your\n SoftDevice Specification for more details about which registers that are protected by SoftDevice.\n This function can write to the following protected peripheral:\n  - ACL\n\n @note Protected registers may be read directly.\n @note Register that are write-once will return @ref NRF_SUCCESS on second set, even the value in\n       the register has not changed. See the Product Specification for more details about register\n       properties.\n\n @param[in]  p_register Pointer to register to be written.\n @param[in]  value Value to be written to the register.\n\n @retval ::NRF_ERROR_INVALID_ADDR This function can not write to the reguested register.\n @retval ::NRF_SUCCESS Value successfully written to register.\n"]
#[inline(always)]
pub unsafe fn sd_protected_register_write(p_register: *mut u32, value: u32) -> u32 {
    let ret: u32;
    core::arch::asm!("svc 43",
        inout("r0") to_asm(p_register) => ret,
        inout("r1") to_asm(value) => _,
        lateout("r2") _,
        lateout("r3") _,
        lateout("r12") _,
    );
    ret
}

#[doc = "< ::sd_softdevice_enable"]
pub const NRF_SD_SVCS_SD_SOFTDEVICE_ENABLE: NRF_SD_SVCS = 16;
#[doc = "< ::sd_softdevice_disable"]
pub const NRF_SD_SVCS_SD_SOFTDEVICE_DISABLE: NRF_SD_SVCS = 17;
#[doc = "< ::sd_softdevice_is_enabled"]
pub const NRF_SD_SVCS_SD_SOFTDEVICE_IS_ENABLED: NRF_SD_SVCS = 18;
#[doc = "< ::sd_softdevice_vector_table_base_set"]
pub const NRF_SD_SVCS_SD_SOFTDEVICE_VECTOR_TABLE_BASE_SET: NRF_SD_SVCS = 19;
#[doc = "< Placeholder for last SDM SVC"]
pub const NRF_SD_SVCS_SVC_SDM_LAST: NRF_SD_SVCS = 20;
#[doc = "@brief nRF SoftDevice Manager API SVC numbers."]
pub type NRF_SD_SVCS = self::c_uint;
#[doc = "@brief Type representing LFCLK oscillator source."]
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct nrf_clock_lf_cfg_t {
    #[doc = "< LF oscillator clock source, see @ref NRF_CLOCK_LF_SRC."]
    pub source: u8,
    #[doc = "< Only for ::NRF_CLOCK_LF_SRC_RC: Calibration timer interval in 1/4 second\nunits (nRF52: 1-32).\n@note To avoid excessive clock drift, 0.5 degrees Celsius is the\nmaximum temperature change allowed in one calibration timer\ninterval. The interval should be selected to ensure this.\n\n@note Must be 0 if source is not ::NRF_CLOCK_LF_SRC_RC."]
    pub rc_ctiv: u8,
    #[doc = "<  Only for ::NRF_CLOCK_LF_SRC_RC: How often (in number of calibration\nintervals) the RC oscillator shall be calibrated if the temperature\nhasn't changed.\n0: Always calibrate even if the temperature hasn't changed.\n1: Only calibrate if the temperature has changed (legacy - nRF51 only).\n2-33: Check the temperature and only calibrate if it has changed,\nhowever calibration will take place every rc_temp_ctiv\nintervals in any case.\n\n@note Must be 0 if source is not ::NRF_CLOCK_LF_SRC_RC.\n\n@note For nRF52, the application must ensure calibration at least once\nevery 8 seconds to ensure +/-500 ppm clock stability. The\nrecommended configuration for ::NRF_CLOCK_LF_SRC_RC on nRF52 is\nrc_ctiv=16 and rc_temp_ctiv=2. This will ensure calibration at\nleast once every 8 seconds and for temperature changes of 0.5\ndegrees Celsius every 4 seconds. See the Product Specification\nfor the nRF52 device being used for more information."]
    pub rc_temp_ctiv: u8,
    #[doc = "< External clock accuracy used in the LL to compute timing\nwindows, see @ref NRF_CLOCK_LF_ACCURACY."]
    pub accuracy: u8,
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of nrf_clock_lf_cfg_t"][::core::mem::size_of::<nrf_clock_lf_cfg_t>() - 4usize];
    ["Alignment of nrf_clock_lf_cfg_t"][::core::mem::align_of::<nrf_clock_lf_cfg_t>() - 1usize];
    ["Offset of field: nrf_clock_lf_cfg_t::source"][::core::mem::offset_of!(nrf_clock_lf_cfg_t, source) - 0usize];
    ["Offset of field: nrf_clock_lf_cfg_t::rc_ctiv"][::core::mem::offset_of!(nrf_clock_lf_cfg_t, rc_ctiv) - 1usize];
    ["Offset of field: nrf_clock_lf_cfg_t::rc_temp_ctiv"]
        [::core::mem::offset_of!(nrf_clock_lf_cfg_t, rc_temp_ctiv) - 2usize];
    ["Offset of field: nrf_clock_lf_cfg_t::accuracy"][::core::mem::offset_of!(nrf_clock_lf_cfg_t, accuracy) - 3usize];
};
#[doc = "@brief Fault Handler type.\n\n When certain unrecoverable errors occur within the application or SoftDevice the fault handler will be called back.\n The protocol stack will be in an undefined state when this happens and the only way to recover will be to\n perform a reset, using e.g. CMSIS NVIC_SystemReset().\n If the application returns from the fault handler the SoftDevice will call NVIC_SystemReset().\n\n @note It is recommended to either perform a reset in the fault handler or to let the SoftDevice reset the device.\n       Otherwise SoC peripherals may behave in an undefined way. For example, the RADIO peripherial may\n       continously transmit packets.\n\n @note This callback is executed in HardFault context, thus SVC functions cannot be called from the fault callback.\n\n @param[in] id Fault identifier. See @ref NRF_FAULT_IDS.\n @param[in] pc The program counter of the instruction that triggered the fault.\n @param[in] info Optional additional information regarding the fault. Refer to each Fault identifier for details.\n\n @note When id is set to @ref NRF_FAULT_ID_APP_MEMACC, pc will contain the address of the instruction being executed at the time when\n the fault is detected by the CPU. The CPU program counter may have advanced up to 2 instructions (no branching) after the one that triggered the fault."]
pub type nrf_fault_handler_t = ::core::option::Option<unsafe extern "C" fn(id: u32, pc: u32, info: u32)>;

#[doc = "@brief Enables the SoftDevice and by extension the protocol stack.\n\n @note Some care must be taken if a low frequency clock source is already running when calling this function:\n       If the LF clock has a different source then the one currently running, it will be stopped. Then, the new\n       clock source will be started.\n\n @note This function has no effect when returning with an error.\n\n @post If return code is ::NRF_SUCCESS\n       - SoC library and protocol stack APIs are made available.\n       - A portion of RAM will be unavailable (see relevant SDS documentation).\n       - Some peripherals will be unavailable or available only through the SoC API (see relevant SDS documentation).\n       - Interrupts will not arrive from protected peripherals or interrupts.\n       - nrf_nvic_ functions must be used instead of CMSIS NVIC_ functions for reliable usage of the SoftDevice.\n       - Interrupt latency may be affected by the SoftDevice  (see relevant SDS documentation).\n       - Chosen low frequency clock source will be running.\n\n @param p_clock_lf_cfg Low frequency clock source and accuracy.\nIf NULL the clock will be configured as an RC source with rc_ctiv = 16 and .rc_temp_ctiv = 2\nIn the case of XTAL source, the PPM accuracy of the chosen clock source must be greater than or equal to the actual characteristics of your XTAL clock.\n @param fault_handler Callback to be invoked in case of fault, cannot be NULL.\n\n @retval ::NRF_SUCCESS\n @retval ::NRF_ERROR_INVALID_ADDR  Invalid or NULL pointer supplied.\n @retval ::NRF_ERROR_INVALID_STATE SoftDevice is already enabled, and the clock source and fault handler cannot be updated.\n @retval ::NRF_ERROR_SDM_INCORRECT_INTERRUPT_CONFIGURATION SoftDevice interrupt is already enabled, or an enabled interrupt has an illegal priority level.\n @retval ::NRF_ERROR_SDM_LFCLK_SOURCE_UNKNOWN Unknown low frequency clock source selected.\n @retval ::NRF_ERROR_INVALID_PARAM Invalid clock source configuration supplied in p_clock_lf_cfg."]
#[inline(always)]
pub unsafe fn sd_softdevice_enable(
    p_clock_lf_cfg: *const nrf_clock_lf_cfg_t,
    fault_handler: nrf_fault_handler_t,
) -> u32 {
    let ret: u32;
    core::arch::asm!("svc 16",
        inout("r0") to_asm(p_clock_lf_cfg) => ret,
        inout("r1") to_asm(fault_handler) => _,
        lateout("r2") _,
        lateout("r3") _,
        lateout("r12") _,
    );
    ret
}

#[doc = "@brief Disables the SoftDevice and by extension the protocol stack.\n\n Idempotent function to disable the SoftDevice.\n\n @post SoC library and protocol stack APIs are made unavailable.\n @post All interrupts that was protected by the SoftDevice will be disabled and initialized to priority 0 (highest).\n @post All peripherals used by the SoftDevice will be reset to default values.\n @post All of RAM become available.\n @post All interrupts are forwarded to the application.\n @post LFCLK source chosen in ::sd_softdevice_enable will be left running.\n\n @retval ::NRF_SUCCESS"]
#[inline(always)]
pub unsafe fn sd_softdevice_disable() -> u32 {
    let ret: u32;
    core::arch::asm!("svc 17",
        lateout("r0") ret,
        lateout("r1") _,
        lateout("r2") _,
        lateout("r3") _,
        lateout("r12") _,
    );
    ret
}

#[doc = "@brief Check if the SoftDevice is enabled.\n\n @param[out]  p_softdevice_enabled If the SoftDevice is enabled: 1 else 0.\n\n @retval ::NRF_SUCCESS"]
#[inline(always)]
pub unsafe fn sd_softdevice_is_enabled(p_softdevice_enabled: *mut u8) -> u32 {
    let ret: u32;
    core::arch::asm!("svc 18",
        inout("r0") to_asm(p_softdevice_enabled) => ret,
        lateout("r1") _,
        lateout("r2") _,
        lateout("r3") _,
        lateout("r12") _,
    );
    ret
}

#[doc = "@brief Sets the base address of the interrupt vector table for interrupts forwarded from the SoftDevice\n\n This function is only intended to be called when a bootloader is enabled.\n\n @param[in] address The base address of the interrupt vector table for forwarded interrupts.\n\n @retval ::NRF_SUCCESS"]
#[inline(always)]
pub unsafe fn sd_softdevice_vector_table_base_set(address: u32) -> u32 {
    let ret: u32;
    core::arch::asm!("svc 19",
        inout("r0") to_asm(address) => ret,
        lateout("r1") _,
        lateout("r2") _,
        lateout("r3") _,
        lateout("r12") _,
    );
    ret
}

#[doc = "< Set up an L2CAP channel."]
pub const BLE_L2CAP_SVCS_SD_BLE_L2CAP_CH_SETUP: BLE_L2CAP_SVCS = 184;
#[doc = "< Release an L2CAP channel."]
pub const BLE_L2CAP_SVCS_SD_BLE_L2CAP_CH_RELEASE: BLE_L2CAP_SVCS = 185;
#[doc = "< Receive an SDU on an L2CAP channel."]
pub const BLE_L2CAP_SVCS_SD_BLE_L2CAP_CH_RX: BLE_L2CAP_SVCS = 186;
#[doc = "< Transmit an SDU on an L2CAP channel."]
pub const BLE_L2CAP_SVCS_SD_BLE_L2CAP_CH_TX: BLE_L2CAP_SVCS = 187;
#[doc = "< Advanced SDU reception flow control."]
pub const BLE_L2CAP_SVCS_SD_BLE_L2CAP_CH_FLOW_CONTROL: BLE_L2CAP_SVCS = 188;
#[doc = "@brief L2CAP API SVC numbers."]
pub type BLE_L2CAP_SVCS = self::c_uint;
#[doc = "< L2CAP Channel Setup Request event.\n\\n See @ref ble_l2cap_evt_ch_setup_request_t."]
pub const BLE_L2CAP_EVTS_BLE_L2CAP_EVT_CH_SETUP_REQUEST: BLE_L2CAP_EVTS = 112;
#[doc = "< L2CAP Channel Setup Refused event.\n\\n See @ref ble_l2cap_evt_ch_setup_refused_t."]
pub const BLE_L2CAP_EVTS_BLE_L2CAP_EVT_CH_SETUP_REFUSED: BLE_L2CAP_EVTS = 113;
#[doc = "< L2CAP Channel Setup Completed event.\n\\n See @ref ble_l2cap_evt_ch_setup_t."]
pub const BLE_L2CAP_EVTS_BLE_L2CAP_EVT_CH_SETUP: BLE_L2CAP_EVTS = 114;
#[doc = "< L2CAP Channel Released event.\n\\n No additional event structure applies."]
pub const BLE_L2CAP_EVTS_BLE_L2CAP_EVT_CH_RELEASED: BLE_L2CAP_EVTS = 115;
#[doc = "< L2CAP Channel SDU data buffer released event.\n\\n See @ref ble_l2cap_evt_ch_sdu_buf_released_t."]
pub const BLE_L2CAP_EVTS_BLE_L2CAP_EVT_CH_SDU_BUF_RELEASED: BLE_L2CAP_EVTS = 116;
#[doc = "< L2CAP Channel Credit received.\n\\n See @ref ble_l2cap_evt_ch_credit_t."]
pub const BLE_L2CAP_EVTS_BLE_L2CAP_EVT_CH_CREDIT: BLE_L2CAP_EVTS = 117;
#[doc = "< L2CAP Channel SDU received.\n\\n See @ref ble_l2cap_evt_ch_rx_t."]
pub const BLE_L2CAP_EVTS_BLE_L2CAP_EVT_CH_RX: BLE_L2CAP_EVTS = 118;
#[doc = "< L2CAP Channel SDU transmitted.\n\\n See @ref ble_l2cap_evt_ch_tx_t."]
pub const BLE_L2CAP_EVTS_BLE_L2CAP_EVT_CH_TX: BLE_L2CAP_EVTS = 119;
#[doc = "@brief L2CAP Event IDs."]
pub type BLE_L2CAP_EVTS = self::c_uint;
#[doc = " @brief BLE L2CAP connection configuration parameters, set with @ref sd_ble_cfg_set.\n\n @note  These parameters are set per connection, so all L2CAP channels created on this connection\n        will have the same parameters.\n\n @retval ::NRF_ERROR_INVALID_PARAM  One or more of the following is true:\n                                    - rx_mps is smaller than @ref BLE_L2CAP_MPS_MIN.\n                                    - tx_mps is smaller than @ref BLE_L2CAP_MPS_MIN.\n                                    - ch_count is greater than @ref BLE_L2CAP_CH_COUNT_MAX.\n @retval ::NRF_ERROR_NO_MEM         rx_mps or tx_mps is set too high."]
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct ble_l2cap_conn_cfg_t {
    #[doc = "< The maximum L2CAP PDU payload size, in bytes, that L2CAP shall\nbe able to receive on L2CAP channels on connections with this\nconfiguration. The minimum value is @ref BLE_L2CAP_MPS_MIN."]
    pub rx_mps: u16,
    #[doc = "< The maximum L2CAP PDU payload size, in bytes, that L2CAP shall\nbe able to transmit on L2CAP channels on connections with this\nconfiguration. The minimum value is @ref BLE_L2CAP_MPS_MIN."]
    pub tx_mps: u16,
    #[doc = "< Number of SDU data buffers that can be queued for reception per\nL2CAP channel. The minimum value is one."]
    pub rx_queue_size: u8,
    #[doc = "< Number of SDU data buffers that can be queued for transmission\nper L2CAP channel. The minimum value is one."]
    pub tx_queue_size: u8,
    #[doc = "< Number of L2CAP channels the application can create per connection\nwith this configuration. The default value is zero, the maximum\nvalue is @ref BLE_L2CAP_CH_COUNT_MAX.\n@note if this parameter is set to zero, all other parameters in\n@ref ble_l2cap_conn_cfg_t are ignored."]
    pub ch_count: u8,
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of ble_l2cap_conn_cfg_t"][::core::mem::size_of::<ble_l2cap_conn_cfg_t>() - 8usize];
    ["Alignment of ble_l2cap_conn_cfg_t"][::core::mem::align_of::<ble_l2cap_conn_cfg_t>() - 2usize];
    ["Offset of field: ble_l2cap_conn_cfg_t::rx_mps"][::core::mem::offset_of!(ble_l2cap_conn_cfg_t, rx_mps) - 0usize];
    ["Offset of field: ble_l2cap_conn_cfg_t::tx_mps"][::core::mem::offset_of!(ble_l2cap_conn_cfg_t, tx_mps) - 2usize];
    ["Offset of field: ble_l2cap_conn_cfg_t::rx_queue_size"]
        [::core::mem::offset_of!(ble_l2cap_conn_cfg_t, rx_queue_size) - 4usize];
    ["Offset of field: ble_l2cap_conn_cfg_t::tx_queue_size"]
        [::core::mem::offset_of!(ble_l2cap_conn_cfg_t, tx_queue_size) - 5usize];
    ["Offset of field: ble_l2cap_conn_cfg_t::ch_count"]
        [::core::mem::offset_of!(ble_l2cap_conn_cfg_t, ch_count) - 6usize];
};
#[doc = "@brief L2CAP channel RX parameters."]
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct ble_l2cap_ch_rx_params_t {
    #[doc = "< The maximum L2CAP SDU size, in bytes, that L2CAP shall be able to\nreceive on this L2CAP channel.\n- Must be equal to or greater than @ref BLE_L2CAP_MTU_MIN."]
    pub rx_mtu: u16,
    #[doc = "< The maximum L2CAP PDU payload size, in bytes, that L2CAP shall be\nable to receive on this L2CAP channel.\n- Must be equal to or greater than @ref BLE_L2CAP_MPS_MIN.\n- Must be equal to or less than @ref ble_l2cap_conn_cfg_t::rx_mps."]
    pub rx_mps: u16,
    #[doc = "< SDU data buffer for reception.\n- If @ref ble_data_t::p_data is non-NULL, initial credits are\nissued to the peer.\n- If @ref ble_data_t::p_data is NULL, no initial credits are\nissued to the peer."]
    pub sdu_buf: ble_data_t,
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of ble_l2cap_ch_rx_params_t"][::core::mem::size_of::<ble_l2cap_ch_rx_params_t>() - 12usize];
    ["Alignment of ble_l2cap_ch_rx_params_t"][::core::mem::align_of::<ble_l2cap_ch_rx_params_t>() - 4usize];
    ["Offset of field: ble_l2cap_ch_rx_params_t::rx_mtu"]
        [::core::mem::offset_of!(ble_l2cap_ch_rx_params_t, rx_mtu) - 0usize];
    ["Offset of field: ble_l2cap_ch_rx_params_t::rx_mps"]
        [::core::mem::offset_of!(ble_l2cap_ch_rx_params_t, rx_mps) - 2usize];
    ["Offset of field: ble_l2cap_ch_rx_params_t::sdu_buf"]
        [::core::mem::offset_of!(ble_l2cap_ch_rx_params_t, sdu_buf) - 4usize];
};
#[doc = "@brief L2CAP channel setup parameters."]
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct ble_l2cap_ch_setup_params_t {
    #[doc = "< L2CAP channel RX parameters."]
    pub rx_params: ble_l2cap_ch_rx_params_t,
    #[doc = "< LE Protocol/Service Multiplexer. Used when requesting\nsetup of an L2CAP channel, ignored otherwise."]
    pub le_psm: u16,
    #[doc = "< Status code, see @ref BLE_L2CAP_CH_STATUS_CODES.\nUsed when replying to a setup request of an L2CAP\nchannel, ignored otherwise."]
    pub status: u16,
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of ble_l2cap_ch_setup_params_t"][::core::mem::size_of::<ble_l2cap_ch_setup_params_t>() - 16usize];
    ["Alignment of ble_l2cap_ch_setup_params_t"][::core::mem::align_of::<ble_l2cap_ch_setup_params_t>() - 4usize];
    ["Offset of field: ble_l2cap_ch_setup_params_t::rx_params"]
        [::core::mem::offset_of!(ble_l2cap_ch_setup_params_t, rx_params) - 0usize];
    ["Offset of field: ble_l2cap_ch_setup_params_t::le_psm"]
        [::core::mem::offset_of!(ble_l2cap_ch_setup_params_t, le_psm) - 12usize];
    ["Offset of field: ble_l2cap_ch_setup_params_t::status"]
        [::core::mem::offset_of!(ble_l2cap_ch_setup_params_t, status) - 14usize];
};
#[doc = "@brief L2CAP channel TX parameters."]
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct ble_l2cap_ch_tx_params_t {
    #[doc = "< The maximum L2CAP SDU size, in bytes, that L2CAP is able to\ntransmit on this L2CAP channel."]
    pub tx_mtu: u16,
    #[doc = "< The maximum L2CAP PDU payload size, in bytes, that the peer is\nable to receive on this L2CAP channel."]
    pub peer_mps: u16,
    #[doc = "< The maximum L2CAP PDU payload size, in bytes, that L2CAP is able\nto transmit on this L2CAP channel. This is effective tx_mps,\nselected by the SoftDevice as\nMIN( @ref ble_l2cap_ch_tx_params_t::peer_mps, @ref ble_l2cap_conn_cfg_t::tx_mps )"]
    pub tx_mps: u16,
    #[doc = "< Initial credits given by the peer."]
    pub credits: u16,
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of ble_l2cap_ch_tx_params_t"][::core::mem::size_of::<ble_l2cap_ch_tx_params_t>() - 8usize];
    ["Alignment of ble_l2cap_ch_tx_params_t"][::core::mem::align_of::<ble_l2cap_ch_tx_params_t>() - 2usize];
    ["Offset of field: ble_l2cap_ch_tx_params_t::tx_mtu"]
        [::core::mem::offset_of!(ble_l2cap_ch_tx_params_t, tx_mtu) - 0usize];
    ["Offset of field: ble_l2cap_ch_tx_params_t::peer_mps"]
        [::core::mem::offset_of!(ble_l2cap_ch_tx_params_t, peer_mps) - 2usize];
    ["Offset of field: ble_l2cap_ch_tx_params_t::tx_mps"]
        [::core::mem::offset_of!(ble_l2cap_ch_tx_params_t, tx_mps) - 4usize];
    ["Offset of field: ble_l2cap_ch_tx_params_t::credits"]
        [::core::mem::offset_of!(ble_l2cap_ch_tx_params_t, credits) - 6usize];
};
#[doc = "@brief L2CAP Channel Setup Request event."]
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct ble_l2cap_evt_ch_setup_request_t {
    #[doc = "< L2CAP channel TX parameters."]
    pub tx_params: ble_l2cap_ch_tx_params_t,
    #[doc = "< LE Protocol/Service Multiplexer."]
    pub le_psm: u16,
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of ble_l2cap_evt_ch_setup_request_t"][::core::mem::size_of::<ble_l2cap_evt_ch_setup_request_t>() - 10usize];
    ["Alignment of ble_l2cap_evt_ch_setup_request_t"]
        [::core::mem::align_of::<ble_l2cap_evt_ch_setup_request_t>() - 2usize];
    ["Offset of field: ble_l2cap_evt_ch_setup_request_t::tx_params"]
        [::core::mem::offset_of!(ble_l2cap_evt_ch_setup_request_t, tx_params) - 0usize];
    ["Offset of field: ble_l2cap_evt_ch_setup_request_t::le_psm"]
        [::core::mem::offset_of!(ble_l2cap_evt_ch_setup_request_t, le_psm) - 8usize];
};
#[doc = "@brief L2CAP Channel Setup Refused event."]
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct ble_l2cap_evt_ch_setup_refused_t {
    #[doc = "< Source, see @ref BLE_L2CAP_CH_SETUP_REFUSED_SRCS"]
    pub source: u8,
    #[doc = "< Status code, see @ref BLE_L2CAP_CH_STATUS_CODES"]
    pub status: u16,
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of ble_l2cap_evt_ch_setup_refused_t"][::core::mem::size_of::<ble_l2cap_evt_ch_setup_refused_t>() - 4usize];
    ["Alignment of ble_l2cap_evt_ch_setup_refused_t"]
        [::core::mem::align_of::<ble_l2cap_evt_ch_setup_refused_t>() - 2usize];
    ["Offset of field: ble_l2cap_evt_ch_setup_refused_t::source"]
        [::core::mem::offset_of!(ble_l2cap_evt_ch_setup_refused_t, source) - 0usize];
    ["Offset of field: ble_l2cap_evt_ch_setup_refused_t::status"]
        [::core::mem::offset_of!(ble_l2cap_evt_ch_setup_refused_t, status) - 2usize];
};
#[doc = "@brief L2CAP Channel Setup Completed event."]
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct ble_l2cap_evt_ch_setup_t {
    #[doc = "< L2CAP channel TX parameters."]
    pub tx_params: ble_l2cap_ch_tx_params_t,
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of ble_l2cap_evt_ch_setup_t"][::core::mem::size_of::<ble_l2cap_evt_ch_setup_t>() - 8usize];
    ["Alignment of ble_l2cap_evt_ch_setup_t"][::core::mem::align_of::<ble_l2cap_evt_ch_setup_t>() - 2usize];
    ["Offset of field: ble_l2cap_evt_ch_setup_t::tx_params"]
        [::core::mem::offset_of!(ble_l2cap_evt_ch_setup_t, tx_params) - 0usize];
};
#[doc = "@brief L2CAP Channel SDU Data Buffer Released event."]
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct ble_l2cap_evt_ch_sdu_buf_released_t {
    #[doc = "< Returned reception or transmission SDU data buffer. The SoftDevice\nreturns SDU data buffers supplied by the application, which have\nnot yet been returned previously via a @ref BLE_L2CAP_EVT_CH_RX or\n@ref BLE_L2CAP_EVT_CH_TX event."]
    pub sdu_buf: ble_data_t,
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of ble_l2cap_evt_ch_sdu_buf_released_t"]
        [::core::mem::size_of::<ble_l2cap_evt_ch_sdu_buf_released_t>() - 8usize];
    ["Alignment of ble_l2cap_evt_ch_sdu_buf_released_t"]
        [::core::mem::align_of::<ble_l2cap_evt_ch_sdu_buf_released_t>() - 4usize];
    ["Offset of field: ble_l2cap_evt_ch_sdu_buf_released_t::sdu_buf"]
        [::core::mem::offset_of!(ble_l2cap_evt_ch_sdu_buf_released_t, sdu_buf) - 0usize];
};
#[doc = "@brief L2CAP Channel Credit received event."]
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct ble_l2cap_evt_ch_credit_t {
    #[doc = "< Additional credits given by the peer."]
    pub credits: u16,
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of ble_l2cap_evt_ch_credit_t"][::core::mem::size_of::<ble_l2cap_evt_ch_credit_t>() - 2usize];
    ["Alignment of ble_l2cap_evt_ch_credit_t"][::core::mem::align_of::<ble_l2cap_evt_ch_credit_t>() - 2usize];
    ["Offset of field: ble_l2cap_evt_ch_credit_t::credits"]
        [::core::mem::offset_of!(ble_l2cap_evt_ch_credit_t, credits) - 0usize];
};
#[doc = "@brief L2CAP Channel received SDU event."]
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct ble_l2cap_evt_ch_rx_t {
    #[doc = "< Total SDU length, in bytes."]
    pub sdu_len: u16,
    #[doc = "< SDU data buffer.\n@note If there is not enough space in the buffer\n(sdu_buf.len < sdu_len) then the rest of the SDU will be\nsilently discarded by the SoftDevice."]
    pub sdu_buf: ble_data_t,
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of ble_l2cap_evt_ch_rx_t"][::core::mem::size_of::<ble_l2cap_evt_ch_rx_t>() - 12usize];
    ["Alignment of ble_l2cap_evt_ch_rx_t"][::core::mem::align_of::<ble_l2cap_evt_ch_rx_t>() - 4usize];
    ["Offset of field: ble_l2cap_evt_ch_rx_t::sdu_len"]
        [::core::mem::offset_of!(ble_l2cap_evt_ch_rx_t, sdu_len) - 0usize];
    ["Offset of field: ble_l2cap_evt_ch_rx_t::sdu_buf"]
        [::core::mem::offset_of!(ble_l2cap_evt_ch_rx_t, sdu_buf) - 4usize];
};
#[doc = "@brief L2CAP Channel transmitted SDU event."]
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct ble_l2cap_evt_ch_tx_t {
    #[doc = "< SDU data buffer."]
    pub sdu_buf: ble_data_t,
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of ble_l2cap_evt_ch_tx_t"][::core::mem::size_of::<ble_l2cap_evt_ch_tx_t>() - 8usize];
    ["Alignment of ble_l2cap_evt_ch_tx_t"][::core::mem::align_of::<ble_l2cap_evt_ch_tx_t>() - 4usize];
    ["Offset of field: ble_l2cap_evt_ch_tx_t::sdu_buf"]
        [::core::mem::offset_of!(ble_l2cap_evt_ch_tx_t, sdu_buf) - 0usize];
};
#[doc = "@brief L2CAP event structure."]
#[repr(C)]
#[derive(Copy, Clone)]
pub struct ble_l2cap_evt_t {
    #[doc = "< Connection Handle on which the event occured."]
    pub conn_handle: u16,
    #[doc = "< Local Channel ID of the L2CAP channel, or\n@ref BLE_L2CAP_CID_INVALID if not present."]
    pub local_cid: u16,
    #[doc = "< Event Parameters."]
    pub params: ble_l2cap_evt_t__bindgen_ty_1,
}
#[repr(C)]
#[derive(Copy, Clone)]
pub union ble_l2cap_evt_t__bindgen_ty_1 {
    #[doc = "< L2CAP Channel Setup Request Event Parameters."]
    pub ch_setup_request: ble_l2cap_evt_ch_setup_request_t,
    #[doc = "< L2CAP Channel Setup Refused Event Parameters."]
    pub ch_setup_refused: ble_l2cap_evt_ch_setup_refused_t,
    #[doc = "< L2CAP Channel Setup Completed Event Parameters."]
    pub ch_setup: ble_l2cap_evt_ch_setup_t,
    #[doc = "< L2CAP Channel SDU Data Buffer Released Event Parameters."]
    pub ch_sdu_buf_released: ble_l2cap_evt_ch_sdu_buf_released_t,
    #[doc = "< L2CAP Channel Credit Received Event Parameters."]
    pub credit: ble_l2cap_evt_ch_credit_t,
    #[doc = "< L2CAP Channel SDU Received Event Parameters."]
    pub rx: ble_l2cap_evt_ch_rx_t,
    #[doc = "< L2CAP Channel SDU Transmitted Event Parameters."]
    pub tx: ble_l2cap_evt_ch_tx_t,
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of ble_l2cap_evt_t__bindgen_ty_1"][::core::mem::size_of::<ble_l2cap_evt_t__bindgen_ty_1>() - 12usize];
    ["Alignment of ble_l2cap_evt_t__bindgen_ty_1"][::core::mem::align_of::<ble_l2cap_evt_t__bindgen_ty_1>() - 4usize];
    ["Offset of field: ble_l2cap_evt_t__bindgen_ty_1::ch_setup_request"]
        [::core::mem::offset_of!(ble_l2cap_evt_t__bindgen_ty_1, ch_setup_request) - 0usize];
    ["Offset of field: ble_l2cap_evt_t__bindgen_ty_1::ch_setup_refused"]
        [::core::mem::offset_of!(ble_l2cap_evt_t__bindgen_ty_1, ch_setup_refused) - 0usize];
    ["Offset of field: ble_l2cap_evt_t__bindgen_ty_1::ch_setup"]
        [::core::mem::offset_of!(ble_l2cap_evt_t__bindgen_ty_1, ch_setup) - 0usize];
    ["Offset of field: ble_l2cap_evt_t__bindgen_ty_1::ch_sdu_buf_released"]
        [::core::mem::offset_of!(ble_l2cap_evt_t__bindgen_ty_1, ch_sdu_buf_released) - 0usize];
    ["Offset of field: ble_l2cap_evt_t__bindgen_ty_1::credit"]
        [::core::mem::offset_of!(ble_l2cap_evt_t__bindgen_ty_1, credit) - 0usize];
    ["Offset of field: ble_l2cap_evt_t__bindgen_ty_1::rx"]
        [::core::mem::offset_of!(ble_l2cap_evt_t__bindgen_ty_1, rx) - 0usize];
    ["Offset of field: ble_l2cap_evt_t__bindgen_ty_1::tx"]
        [::core::mem::offset_of!(ble_l2cap_evt_t__bindgen_ty_1, tx) - 0usize];
};
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of ble_l2cap_evt_t"][::core::mem::size_of::<ble_l2cap_evt_t>() - 16usize];
    ["Alignment of ble_l2cap_evt_t"][::core::mem::align_of::<ble_l2cap_evt_t>() - 4usize];
    ["Offset of field: ble_l2cap_evt_t::conn_handle"][::core::mem::offset_of!(ble_l2cap_evt_t, conn_handle) - 0usize];
    ["Offset of field: ble_l2cap_evt_t::local_cid"][::core::mem::offset_of!(ble_l2cap_evt_t, local_cid) - 2usize];
    ["Offset of field: ble_l2cap_evt_t::params"][::core::mem::offset_of!(ble_l2cap_evt_t, params) - 4usize];
};

#[doc = "@brief Set up an L2CAP channel.\n\n @details This function is used to:\n          - Request setup of an L2CAP channel: sends an LE Credit Based Connection Request packet to a peer.\n          - Reply to a setup request of an L2CAP channel (if called in response to a\n            @ref BLE_L2CAP_EVT_CH_SETUP_REQUEST event): sends an LE Credit Based Connection\n            Response packet to a peer.\n\n @note    A call to this function will require the application to keep the SDU data buffer alive\n          until the SDU data buffer is returned in @ref BLE_L2CAP_EVT_CH_RX or\n          @ref BLE_L2CAP_EVT_CH_SDU_BUF_RELEASED event.\n\n @events\n @event{@ref BLE_L2CAP_EVT_CH_SETUP, Setup successful.}\n @event{@ref BLE_L2CAP_EVT_CH_SETUP_REFUSED, Setup failed.}\n @endevents\n\n @mscs\n @mmsc{@ref BLE_L2CAP_CH_SETUP_MSC}\n @endmscs\n\n @param[in] conn_handle      Connection Handle.\n @param[in,out] p_local_cid  Pointer to a uint16_t containing Local Channel ID of the L2CAP channel:\n                             - As input: @ref BLE_L2CAP_CID_INVALID when requesting setup of an L2CAP\n                               channel or local_cid provided in the @ref BLE_L2CAP_EVT_CH_SETUP_REQUEST\n                               event when replying to a setup request of an L2CAP channel.\n                             - As output: local_cid for this channel.\n @param[in] p_params         L2CAP channel parameters.\n\n @retval ::NRF_SUCCESS                    Successfully queued request or response for transmission.\n @retval ::NRF_ERROR_BUSY                 The stack is busy, process pending events and retry.\n @retval ::NRF_ERROR_INVALID_ADDR         Invalid pointer supplied.\n @retval ::BLE_ERROR_INVALID_CONN_HANDLE  Invalid Connection Handle.\n @retval ::NRF_ERROR_INVALID_PARAM        Invalid parameter(s) supplied.\n @retval ::NRF_ERROR_INVALID_LENGTH       Supplied higher rx_mps than has been configured on this link.\n @retval ::NRF_ERROR_INVALID_STATE        Invalid State to perform operation (L2CAP channel already set up).\n @retval ::NRF_ERROR_NOT_FOUND            CID not found.\n @retval ::NRF_ERROR_RESOURCES            The limit has been reached for available L2CAP channels,\n                                          see @ref ble_l2cap_conn_cfg_t::ch_count."]
#[inline(always)]
pub unsafe fn sd_ble_l2cap_ch_setup(
    conn_handle: u16,
    p_local_cid: *mut u16,
    p_params: *const ble_l2cap_ch_setup_params_t,
) -> u32 {
    let ret: u32;
    core::arch::asm!("svc 184",
        inout("r0") to_asm(conn_handle) => ret,
        inout("r1") to_asm(p_local_cid) => _,
        inout("r2") to_asm(p_params) => _,
        lateout("r3") _,
        lateout("r12") _,
    );
    ret
}

#[doc = "@brief Release an L2CAP channel.\n\n @details This sends a Disconnection Request packet to a peer.\n\n @events\n @event{@ref BLE_L2CAP_EVT_CH_RELEASED, Release complete.}\n @endevents\n\n @mscs\n @mmsc{@ref BLE_L2CAP_CH_RELEASE_MSC}\n @endmscs\n\n @param[in] conn_handle   Connection Handle.\n @param[in] local_cid     Local Channel ID of the L2CAP channel.\n\n @retval ::NRF_SUCCESS                    Successfully queued request for transmission.\n @retval ::BLE_ERROR_INVALID_CONN_HANDLE  Invalid Connection Handle.\n @retval ::NRF_ERROR_INVALID_STATE        Invalid State to perform operation (Setup or release is\n                                          in progress for the L2CAP channel).\n @retval ::NRF_ERROR_NOT_FOUND            CID not found."]
#[inline(always)]
pub unsafe fn sd_ble_l2cap_ch_release(conn_handle: u16, local_cid: u16) -> u32 {
    let ret: u32;
    core::arch::asm!("svc 185",
        inout("r0") to_asm(conn_handle) => ret,
        inout("r1") to_asm(local_cid) => _,
        lateout("r2") _,
        lateout("r3") _,
        lateout("r12") _,
    );
    ret
}

#[doc = "@brief Receive an SDU on an L2CAP channel.\n\n @details This may issue additional credits to the peer using an LE Flow Control Credit packet.\n\n @note    A call to this function will require the application to keep the memory pointed by\n          @ref ble_data_t::p_data alive until the SDU data buffer is returned in @ref BLE_L2CAP_EVT_CH_RX\n          or @ref BLE_L2CAP_EVT_CH_SDU_BUF_RELEASED event.\n\n @note    The SoftDevice can queue up to @ref ble_l2cap_conn_cfg_t::rx_queue_size SDU data buffers\n          for reception per L2CAP channel.\n\n @events\n @event{@ref BLE_L2CAP_EVT_CH_RX, The SDU is received.}\n @endevents\n\n @mscs\n @mmsc{@ref BLE_L2CAP_CH_RX_MSC}\n @endmscs\n\n @param[in] conn_handle Connection Handle.\n @param[in] local_cid   Local Channel ID of the L2CAP channel.\n @param[in] p_sdu_buf   Pointer to the SDU data buffer.\n\n @retval ::NRF_SUCCESS                    Buffer accepted.\n @retval ::NRF_ERROR_INVALID_ADDR         Invalid pointer supplied.\n @retval ::BLE_ERROR_INVALID_CONN_HANDLE  Invalid Connection Handle.\n @retval ::NRF_ERROR_INVALID_STATE        Invalid State to perform operation (Setup or release is\n                                          in progress for an L2CAP channel).\n @retval ::NRF_ERROR_NOT_FOUND            CID not found.\n @retval ::NRF_ERROR_RESOURCES            Too many SDU data buffers supplied. Wait for a\n                                          @ref BLE_L2CAP_EVT_CH_RX event and retry."]
#[inline(always)]
pub unsafe fn sd_ble_l2cap_ch_rx(conn_handle: u16, local_cid: u16, p_sdu_buf: *const ble_data_t) -> u32 {
    let ret: u32;
    core::arch::asm!("svc 186",
        inout("r0") to_asm(conn_handle) => ret,
        inout("r1") to_asm(local_cid) => _,
        inout("r2") to_asm(p_sdu_buf) => _,
        lateout("r3") _,
        lateout("r12") _,
    );
    ret
}

#[doc = "@brief Transmit an SDU on an L2CAP channel.\n\n @note    A call to this function will require the application to keep the memory pointed by\n          @ref ble_data_t::p_data alive until the SDU data buffer is returned in @ref BLE_L2CAP_EVT_CH_TX\n          or @ref BLE_L2CAP_EVT_CH_SDU_BUF_RELEASED event.\n\n @note    The SoftDevice can queue up to @ref ble_l2cap_conn_cfg_t::tx_queue_size SDUs for\n          transmission per L2CAP channel.\n\n @note    The application can keep track of the available credits for transmission by following\n          the procedure below:\n          - Store initial credits given by the peer in a variable.\n            (Initial credits are provided in a @ref BLE_L2CAP_EVT_CH_SETUP event.)\n          - Decrement the variable, which stores the currently available credits, by\n            ceiling((@ref ble_data_t::len + 2) / tx_mps) when a call to this function returns\n            @ref NRF_SUCCESS. (tx_mps is provided in a @ref BLE_L2CAP_EVT_CH_SETUP event.)\n          - Increment the variable, which stores the currently available credits, by additional\n            credits given by the peer in a @ref BLE_L2CAP_EVT_CH_CREDIT event.\n\n @events\n @event{@ref BLE_L2CAP_EVT_CH_TX, The SDU is transmitted.}\n @endevents\n\n @mscs\n @mmsc{@ref BLE_L2CAP_CH_TX_MSC}\n @endmscs\n\n @param[in] conn_handle Connection Handle.\n @param[in] local_cid   Local Channel ID of the L2CAP channel.\n @param[in] p_sdu_buf   Pointer to the SDU data buffer.\n\n @retval ::NRF_SUCCESS                    Successfully queued L2CAP SDU for transmission.\n @retval ::NRF_ERROR_INVALID_ADDR         Invalid pointer supplied.\n @retval ::BLE_ERROR_INVALID_CONN_HANDLE  Invalid Connection Handle.\n @retval ::NRF_ERROR_INVALID_STATE        Invalid State to perform operation (Setup or release is\n                                          in progress for the L2CAP channel).\n @retval ::NRF_ERROR_NOT_FOUND            CID not found.\n @retval ::NRF_ERROR_DATA_SIZE            Invalid SDU length supplied, must not be more than\n                                          @ref ble_l2cap_ch_tx_params_t::tx_mtu provided in\n                                          @ref BLE_L2CAP_EVT_CH_SETUP event.\n @retval ::NRF_ERROR_RESOURCES            Too many SDUs queued for transmission. Wait for a\n                                          @ref BLE_L2CAP_EVT_CH_TX event and retry."]
#[inline(always)]
pub unsafe fn sd_ble_l2cap_ch_tx(conn_handle: u16, local_cid: u16, p_sdu_buf: *const ble_data_t) -> u32 {
    let ret: u32;
    core::arch::asm!("svc 187",
        inout("r0") to_asm(conn_handle) => ret,
        inout("r1") to_asm(local_cid) => _,
        inout("r2") to_asm(p_sdu_buf) => _,
        lateout("r3") _,
        lateout("r12") _,
    );
    ret
}

#[doc = "@brief Advanced SDU reception flow control.\n\n @details Adjust the way the SoftDevice issues credits to the peer.\n          This may issue additional credits to the peer using an LE Flow Control Credit packet.\n\n @mscs\n @mmsc{@ref BLE_L2CAP_CH_FLOW_CONTROL_MSC}\n @endmscs\n\n @param[in] conn_handle Connection Handle.\n @param[in] local_cid   Local Channel ID of the L2CAP channel or @ref BLE_L2CAP_CID_INVALID to set\n                        the value that will be used for newly created channels.\n @param[in] credits     Number of credits that the SoftDevice will make sure the peer has every\n                        time it starts using a new reception buffer.\n                        - @ref BLE_L2CAP_CREDITS_DEFAULT is the default value the SoftDevice will\n                          use if this function is not called.\n                        - If set to zero, the SoftDevice will stop issuing credits for new reception\n                          buffers the application provides or has provided. SDU reception that is\n                          currently ongoing will be allowed to complete.\n @param[out] p_credits  NULL or pointer to a uint16_t. If a valid pointer is provided, it will be\n                        written by the SoftDevice with the number of credits that is or will be\n                        available to the peer. If the value written by the SoftDevice is 0 when\n                        credits parameter was set to 0, the peer will not be able to send more\n                        data until more credits are provided by calling this function again with\n                        credits > 0. This parameter is ignored when local_cid is set to\n                        @ref BLE_L2CAP_CID_INVALID.\n\n @note Application should take care when setting number of credits higher than default value. In\n       this case the application must make sure that the SoftDevice always has reception buffers\n       available (see @ref sd_ble_l2cap_ch_rx) for that channel. If the SoftDevice does not have\n       such buffers available, packets may be NACKed on the Link Layer and all Bluetooth traffic\n       on the connection handle may be stalled until the SoftDevice again has an available\n       reception buffer. This applies even if the application has used this call to set the\n       credits back to default, or zero.\n\n @retval ::NRF_SUCCESS                    Flow control parameters accepted.\n @retval ::NRF_ERROR_INVALID_ADDR         Invalid pointer supplied.\n @retval ::BLE_ERROR_INVALID_CONN_HANDLE  Invalid Connection Handle.\n @retval ::NRF_ERROR_INVALID_STATE        Invalid State to perform operation (Setup or release is\n                                          in progress for an L2CAP channel).\n @retval ::NRF_ERROR_NOT_FOUND            CID not found."]
#[inline(always)]
pub unsafe fn sd_ble_l2cap_ch_flow_control(conn_handle: u16, local_cid: u16, credits: u16, p_credits: *mut u16) -> u32 {
    let ret: u32;
    core::arch::asm!("svc 188",
        inout("r0") to_asm(conn_handle) => ret,
        inout("r1") to_asm(local_cid) => _,
        inout("r2") to_asm(credits) => _,
        inout("r3") to_asm(p_credits) => _,
        lateout("r12") _,
    );
    ret
}

#[doc = " @brief BLE GATT connection configuration parameters, set with @ref sd_ble_cfg_set.\n\n @retval ::NRF_ERROR_INVALID_PARAM att_mtu is smaller than @ref BLE_GATT_ATT_MTU_DEFAULT."]
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct ble_gatt_conn_cfg_t {
    #[doc = "< Maximum size of ATT packet the SoftDevice can send or receive.\nThe default and minimum value is @ref BLE_GATT_ATT_MTU_DEFAULT.\n@mscs\n@mmsc{@ref BLE_GATTC_MTU_EXCHANGE}\n@mmsc{@ref BLE_GATTS_MTU_EXCHANGE}\n@endmscs"]
    pub att_mtu: u16,
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of ble_gatt_conn_cfg_t"][::core::mem::size_of::<ble_gatt_conn_cfg_t>() - 2usize];
    ["Alignment of ble_gatt_conn_cfg_t"][::core::mem::align_of::<ble_gatt_conn_cfg_t>() - 2usize];
    ["Offset of field: ble_gatt_conn_cfg_t::att_mtu"][::core::mem::offset_of!(ble_gatt_conn_cfg_t, att_mtu) - 0usize];
};
#[doc = "@brief GATT Characteristic Properties."]
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct ble_gatt_char_props_t {
    pub _bitfield_align_1: [u8; 0],
    pub _bitfield_1: __BindgenBitfieldUnit<[u8; 1usize]>,
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of ble_gatt_char_props_t"][::core::mem::size_of::<ble_gatt_char_props_t>() - 1usize];
    ["Alignment of ble_gatt_char_props_t"][::core::mem::align_of::<ble_gatt_char_props_t>() - 1usize];
};
impl ble_gatt_char_props_t {
    #[inline]
    pub fn broadcast(&self) -> u8 {
        unsafe { ::core::mem::transmute(self._bitfield_1.get(0usize, 1u8) as u8) }
    }
    #[inline]
    pub fn set_broadcast(&mut self, val: u8) {
        unsafe {
            let val: u8 = ::core::mem::transmute(val);
            self._bitfield_1.set(0usize, 1u8, val as u64)
        }
    }
    #[inline]
    pub unsafe fn broadcast_raw(this: *const Self) -> u8 {
        unsafe {
            ::core::mem::transmute(<__BindgenBitfieldUnit<[u8; 1usize]>>::raw_get(
                ::core::ptr::addr_of!((*this)._bitfield_1),
                0usize,
                1u8,
            ) as u8)
        }
    }
    #[inline]
    pub unsafe fn set_broadcast_raw(this: *mut Self, val: u8) {
        unsafe {
            let val: u8 = ::core::mem::transmute(val);
            <__BindgenBitfieldUnit<[u8; 1usize]>>::raw_set(
                ::core::ptr::addr_of_mut!((*this)._bitfield_1),
                0usize,
                1u8,
                val as u64,
            )
        }
    }
    #[inline]
    pub fn read(&self) -> u8 {
        unsafe { ::core::mem::transmute(self._bitfield_1.get(1usize, 1u8) as u8) }
    }
    #[inline]
    pub fn set_read(&mut self, val: u8) {
        unsafe {
            let val: u8 = ::core::mem::transmute(val);
            self._bitfield_1.set(1usize, 1u8, val as u64)
        }
    }
    #[inline]
    pub unsafe fn read_raw(this: *const Self) -> u8 {
        unsafe {
            ::core::mem::transmute(<__BindgenBitfieldUnit<[u8; 1usize]>>::raw_get(
                ::core::ptr::addr_of!((*this)._bitfield_1),
                1usize,
                1u8,
            ) as u8)
        }
    }
    #[inline]
    pub unsafe fn set_read_raw(this: *mut Self, val: u8) {
        unsafe {
            let val: u8 = ::core::mem::transmute(val);
            <__BindgenBitfieldUnit<[u8; 1usize]>>::raw_set(
                ::core::ptr::addr_of_mut!((*this)._bitfield_1),
                1usize,
                1u8,
                val as u64,
            )
        }
    }
    #[inline]
    pub fn write_wo_resp(&self) -> u8 {
        unsafe { ::core::mem::transmute(self._bitfield_1.get(2usize, 1u8) as u8) }
    }
    #[inline]
    pub fn set_write_wo_resp(&mut self, val: u8) {
        unsafe {
            let val: u8 = ::core::mem::transmute(val);
            self._bitfield_1.set(2usize, 1u8, val as u64)
        }
    }
    #[inline]
    pub unsafe fn write_wo_resp_raw(this: *const Self) -> u8 {
        unsafe {
            ::core::mem::transmute(<__BindgenBitfieldUnit<[u8; 1usize]>>::raw_get(
                ::core::ptr::addr_of!((*this)._bitfield_1),
                2usize,
                1u8,
            ) as u8)
        }
    }
    #[inline]
    pub unsafe fn set_write_wo_resp_raw(this: *mut Self, val: u8) {
        unsafe {
            let val: u8 = ::core::mem::transmute(val);
            <__BindgenBitfieldUnit<[u8; 1usize]>>::raw_set(
                ::core::ptr::addr_of_mut!((*this)._bitfield_1),
                2usize,
                1u8,
                val as u64,
            )
        }
    }
    #[inline]
    pub fn write(&self) -> u8 {
        unsafe { ::core::mem::transmute(self._bitfield_1.get(3usize, 1u8) as u8) }
    }
    #[inline]
    pub fn set_write(&mut self, val: u8) {
        unsafe {
            let val: u8 = ::core::mem::transmute(val);
            self._bitfield_1.set(3usize, 1u8, val as u64)
        }
    }
    #[inline]
    pub unsafe fn write_raw(this: *const Self) -> u8 {
        unsafe {
            ::core::mem::transmute(<__BindgenBitfieldUnit<[u8; 1usize]>>::raw_get(
                ::core::ptr::addr_of!((*this)._bitfield_1),
                3usize,
                1u8,
            ) as u8)
        }
    }
    #[inline]
    pub unsafe fn set_write_raw(this: *mut Self, val: u8) {
        unsafe {
            let val: u8 = ::core::mem::transmute(val);
            <__BindgenBitfieldUnit<[u8; 1usize]>>::raw_set(
                ::core::ptr::addr_of_mut!((*this)._bitfield_1),
                3usize,
                1u8,
                val as u64,
            )
        }
    }
    #[inline]
    pub fn notify(&self) -> u8 {
        unsafe { ::core::mem::transmute(self._bitfield_1.get(4usize, 1u8) as u8) }
    }
    #[inline]
    pub fn set_notify(&mut self, val: u8) {
        unsafe {
            let val: u8 = ::core::mem::transmute(val);
            self._bitfield_1.set(4usize, 1u8, val as u64)
        }
    }
    #[inline]
    pub unsafe fn notify_raw(this: *const Self) -> u8 {
        unsafe {
            ::core::mem::transmute(<__BindgenBitfieldUnit<[u8; 1usize]>>::raw_get(
                ::core::ptr::addr_of!((*this)._bitfield_1),
                4usize,
                1u8,
            ) as u8)
        }
    }
    #[inline]
    pub unsafe fn set_notify_raw(this: *mut Self, val: u8) {
        unsafe {
            let val: u8 = ::core::mem::transmute(val);
            <__BindgenBitfieldUnit<[u8; 1usize]>>::raw_set(
                ::core::ptr::addr_of_mut!((*this)._bitfield_1),
                4usize,
                1u8,
                val as u64,
            )
        }
    }
    #[inline]
    pub fn indicate(&self) -> u8 {
        unsafe { ::core::mem::transmute(self._bitfield_1.get(5usize, 1u8) as u8) }
    }
    #[inline]
    pub fn set_indicate(&mut self, val: u8) {
        unsafe {
            let val: u8 = ::core::mem::transmute(val);
            self._bitfield_1.set(5usize, 1u8, val as u64)
        }
    }
    #[inline]
    pub unsafe fn indicate_raw(this: *const Self) -> u8 {
        unsafe {
            ::core::mem::transmute(<__BindgenBitfieldUnit<[u8; 1usize]>>::raw_get(
                ::core::ptr::addr_of!((*this)._bitfield_1),
                5usize,
                1u8,
            ) as u8)
        }
    }
    #[inline]
    pub unsafe fn set_indicate_raw(this: *mut Self, val: u8) {
        unsafe {
            let val: u8 = ::core::mem::transmute(val);
            <__BindgenBitfieldUnit<[u8; 1usize]>>::raw_set(
                ::core::ptr::addr_of_mut!((*this)._bitfield_1),
                5usize,
                1u8,
                val as u64,
            )
        }
    }
    #[inline]
    pub fn auth_signed_wr(&self) -> u8 {
        unsafe { ::core::mem::transmute(self._bitfield_1.get(6usize, 1u8) as u8) }
    }
    #[inline]
    pub fn set_auth_signed_wr(&mut self, val: u8) {
        unsafe {
            let val: u8 = ::core::mem::transmute(val);
            self._bitfield_1.set(6usize, 1u8, val as u64)
        }
    }
    #[inline]
    pub unsafe fn auth_signed_wr_raw(this: *const Self) -> u8 {
        unsafe {
            ::core::mem::transmute(<__BindgenBitfieldUnit<[u8; 1usize]>>::raw_get(
                ::core::ptr::addr_of!((*this)._bitfield_1),
                6usize,
                1u8,
            ) as u8)
        }
    }
    #[inline]
    pub unsafe fn set_auth_signed_wr_raw(this: *mut Self, val: u8) {
        unsafe {
            let val: u8 = ::core::mem::transmute(val);
            <__BindgenBitfieldUnit<[u8; 1usize]>>::raw_set(
                ::core::ptr::addr_of_mut!((*this)._bitfield_1),
                6usize,
                1u8,
                val as u64,
            )
        }
    }
    #[inline]
    pub fn new_bitfield_1(
        broadcast: u8,
        read: u8,
        write_wo_resp: u8,
        write: u8,
        notify: u8,
        indicate: u8,
        auth_signed_wr: u8,
    ) -> __BindgenBitfieldUnit<[u8; 1usize]> {
        let mut __bindgen_bitfield_unit: __BindgenBitfieldUnit<[u8; 1usize]> = Default::default();
        __bindgen_bitfield_unit.set(0usize, 1u8, {
            let broadcast: u8 = unsafe { ::core::mem::transmute(broadcast) };
            broadcast as u64
        });
        __bindgen_bitfield_unit.set(1usize, 1u8, {
            let read: u8 = unsafe { ::core::mem::transmute(read) };
            read as u64
        });
        __bindgen_bitfield_unit.set(2usize, 1u8, {
            let write_wo_resp: u8 = unsafe { ::core::mem::transmute(write_wo_resp) };
            write_wo_resp as u64
        });
        __bindgen_bitfield_unit.set(3usize, 1u8, {
            let write: u8 = unsafe { ::core::mem::transmute(write) };
            write as u64
        });
        __bindgen_bitfield_unit.set(4usize, 1u8, {
            let notify: u8 = unsafe { ::core::mem::transmute(notify) };
            notify as u64
        });
        __bindgen_bitfield_unit.set(5usize, 1u8, {
            let indicate: u8 = unsafe { ::core::mem::transmute(indicate) };
            indicate as u64
        });
        __bindgen_bitfield_unit.set(6usize, 1u8, {
            let auth_signed_wr: u8 = unsafe { ::core::mem::transmute(auth_signed_wr) };
            auth_signed_wr as u64
        });
        __bindgen_bitfield_unit
    }
}
#[doc = "@brief GATT Characteristic Extended Properties."]
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct ble_gatt_char_ext_props_t {
    pub _bitfield_align_1: [u8; 0],
    pub _bitfield_1: __BindgenBitfieldUnit<[u8; 1usize]>,
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of ble_gatt_char_ext_props_t"][::core::mem::size_of::<ble_gatt_char_ext_props_t>() - 1usize];
    ["Alignment of ble_gatt_char_ext_props_t"][::core::mem::align_of::<ble_gatt_char_ext_props_t>() - 1usize];
};
impl ble_gatt_char_ext_props_t {
    #[inline]
    pub fn reliable_wr(&self) -> u8 {
        unsafe { ::core::mem::transmute(self._bitfield_1.get(0usize, 1u8) as u8) }
    }
    #[inline]
    pub fn set_reliable_wr(&mut self, val: u8) {
        unsafe {
            let val: u8 = ::core::mem::transmute(val);
            self._bitfield_1.set(0usize, 1u8, val as u64)
        }
    }
    #[inline]
    pub unsafe fn reliable_wr_raw(this: *const Self) -> u8 {
        unsafe {
            ::core::mem::transmute(<__BindgenBitfieldUnit<[u8; 1usize]>>::raw_get(
                ::core::ptr::addr_of!((*this)._bitfield_1),
                0usize,
                1u8,
            ) as u8)
        }
    }
    #[inline]
    pub unsafe fn set_reliable_wr_raw(this: *mut Self, val: u8) {
        unsafe {
            let val: u8 = ::core::mem::transmute(val);
            <__BindgenBitfieldUnit<[u8; 1usize]>>::raw_set(
                ::core::ptr::addr_of_mut!((*this)._bitfield_1),
                0usize,
                1u8,
                val as u64,
            )
        }
    }
    #[inline]
    pub fn wr_aux(&self) -> u8 {
        unsafe { ::core::mem::transmute(self._bitfield_1.get(1usize, 1u8) as u8) }
    }
    #[inline]
    pub fn set_wr_aux(&mut self, val: u8) {
        unsafe {
            let val: u8 = ::core::mem::transmute(val);
            self._bitfield_1.set(1usize, 1u8, val as u64)
        }
    }
    #[inline]
    pub unsafe fn wr_aux_raw(this: *const Self) -> u8 {
        unsafe {
            ::core::mem::transmute(<__BindgenBitfieldUnit<[u8; 1usize]>>::raw_get(
                ::core::ptr::addr_of!((*this)._bitfield_1),
                1usize,
                1u8,
            ) as u8)
        }
    }
    #[inline]
    pub unsafe fn set_wr_aux_raw(this: *mut Self, val: u8) {
        unsafe {
            let val: u8 = ::core::mem::transmute(val);
            <__BindgenBitfieldUnit<[u8; 1usize]>>::raw_set(
                ::core::ptr::addr_of_mut!((*this)._bitfield_1),
                1usize,
                1u8,
                val as u64,
            )
        }
    }
    #[inline]
    pub fn new_bitfield_1(reliable_wr: u8, wr_aux: u8) -> __BindgenBitfieldUnit<[u8; 1usize]> {
        let mut __bindgen_bitfield_unit: __BindgenBitfieldUnit<[u8; 1usize]> = Default::default();
        __bindgen_bitfield_unit.set(0usize, 1u8, {
            let reliable_wr: u8 = unsafe { ::core::mem::transmute(reliable_wr) };
            reliable_wr as u64
        });
        __bindgen_bitfield_unit.set(1usize, 1u8, {
            let wr_aux: u8 = unsafe { ::core::mem::transmute(wr_aux) };
            wr_aux as u64
        });
        __bindgen_bitfield_unit
    }
}
#[doc = "< Primary Service Discovery."]
pub const BLE_GATTC_SVCS_SD_BLE_GATTC_PRIMARY_SERVICES_DISCOVER: BLE_GATTC_SVCS = 155;
#[doc = "< Relationship Discovery."]
pub const BLE_GATTC_SVCS_SD_BLE_GATTC_RELATIONSHIPS_DISCOVER: BLE_GATTC_SVCS = 156;
#[doc = "< Characteristic Discovery."]
pub const BLE_GATTC_SVCS_SD_BLE_GATTC_CHARACTERISTICS_DISCOVER: BLE_GATTC_SVCS = 157;
#[doc = "< Characteristic Descriptor Discovery."]
pub const BLE_GATTC_SVCS_SD_BLE_GATTC_DESCRIPTORS_DISCOVER: BLE_GATTC_SVCS = 158;
#[doc = "< Attribute Information Discovery."]
pub const BLE_GATTC_SVCS_SD_BLE_GATTC_ATTR_INFO_DISCOVER: BLE_GATTC_SVCS = 159;
#[doc = "< Read Characteristic Value by UUID."]
pub const BLE_GATTC_SVCS_SD_BLE_GATTC_CHAR_VALUE_BY_UUID_READ: BLE_GATTC_SVCS = 160;
#[doc = "< Generic read."]
pub const BLE_GATTC_SVCS_SD_BLE_GATTC_READ: BLE_GATTC_SVCS = 161;
#[doc = "< Read multiple Characteristic Values."]
pub const BLE_GATTC_SVCS_SD_BLE_GATTC_CHAR_VALUES_READ: BLE_GATTC_SVCS = 162;
#[doc = "< Generic write."]
pub const BLE_GATTC_SVCS_SD_BLE_GATTC_WRITE: BLE_GATTC_SVCS = 163;
#[doc = "< Handle Value Confirmation."]
pub const BLE_GATTC_SVCS_SD_BLE_GATTC_HV_CONFIRM: BLE_GATTC_SVCS = 164;
#[doc = "< Exchange MTU Request."]
pub const BLE_GATTC_SVCS_SD_BLE_GATTC_EXCHANGE_MTU_REQUEST: BLE_GATTC_SVCS = 165;
#[doc = "@brief GATTC API SVC numbers."]
pub type BLE_GATTC_SVCS = self::c_uint;
#[doc = "< Primary Service Discovery Response event.          \\n See @ref ble_gattc_evt_prim_srvc_disc_rsp_t."]
pub const BLE_GATTC_EVTS_BLE_GATTC_EVT_PRIM_SRVC_DISC_RSP: BLE_GATTC_EVTS = 48;
#[doc = "< Relationship Discovery Response event.             \\n See @ref ble_gattc_evt_rel_disc_rsp_t."]
pub const BLE_GATTC_EVTS_BLE_GATTC_EVT_REL_DISC_RSP: BLE_GATTC_EVTS = 49;
#[doc = "< Characteristic Discovery Response event.           \\n See @ref ble_gattc_evt_char_disc_rsp_t."]
pub const BLE_GATTC_EVTS_BLE_GATTC_EVT_CHAR_DISC_RSP: BLE_GATTC_EVTS = 50;
#[doc = "< Descriptor Discovery Response event.               \\n See @ref ble_gattc_evt_desc_disc_rsp_t."]
pub const BLE_GATTC_EVTS_BLE_GATTC_EVT_DESC_DISC_RSP: BLE_GATTC_EVTS = 51;
#[doc = "< Attribute Information Response event.              \\n See @ref ble_gattc_evt_attr_info_disc_rsp_t."]
pub const BLE_GATTC_EVTS_BLE_GATTC_EVT_ATTR_INFO_DISC_RSP: BLE_GATTC_EVTS = 52;
#[doc = "< Read By UUID Response event.                       \\n See @ref ble_gattc_evt_char_val_by_uuid_read_rsp_t."]
pub const BLE_GATTC_EVTS_BLE_GATTC_EVT_CHAR_VAL_BY_UUID_READ_RSP: BLE_GATTC_EVTS = 53;
#[doc = "< Read Response event.                               \\n See @ref ble_gattc_evt_read_rsp_t."]
pub const BLE_GATTC_EVTS_BLE_GATTC_EVT_READ_RSP: BLE_GATTC_EVTS = 54;
#[doc = "< Read multiple Response event.                      \\n See @ref ble_gattc_evt_char_vals_read_rsp_t."]
pub const BLE_GATTC_EVTS_BLE_GATTC_EVT_CHAR_VALS_READ_RSP: BLE_GATTC_EVTS = 55;
#[doc = "< Write Response event.                              \\n See @ref ble_gattc_evt_write_rsp_t."]
pub const BLE_GATTC_EVTS_BLE_GATTC_EVT_WRITE_RSP: BLE_GATTC_EVTS = 56;
#[doc = "< Handle Value Notification or Indication event.     \\n Confirm indication with @ref sd_ble_gattc_hv_confirm.  \\n See @ref ble_gattc_evt_hvx_t."]
pub const BLE_GATTC_EVTS_BLE_GATTC_EVT_HVX: BLE_GATTC_EVTS = 57;
#[doc = "< Exchange MTU Response event.                       \\n See @ref ble_gattc_evt_exchange_mtu_rsp_t."]
pub const BLE_GATTC_EVTS_BLE_GATTC_EVT_EXCHANGE_MTU_RSP: BLE_GATTC_EVTS = 58;
#[doc = "< Timeout event.                                     \\n See @ref ble_gattc_evt_timeout_t."]
pub const BLE_GATTC_EVTS_BLE_GATTC_EVT_TIMEOUT: BLE_GATTC_EVTS = 59;
#[doc = "< Write without Response transmission complete.      \\n See @ref ble_gattc_evt_write_cmd_tx_complete_t."]
pub const BLE_GATTC_EVTS_BLE_GATTC_EVT_WRITE_CMD_TX_COMPLETE: BLE_GATTC_EVTS = 60;
#[doc = " @brief GATT Client Event IDs."]
pub type BLE_GATTC_EVTS = self::c_uint;
#[doc = " @brief BLE GATTC connection configuration parameters, set with @ref sd_ble_cfg_set."]
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct ble_gattc_conn_cfg_t {
    #[doc = "< The guaranteed minimum number of Write without Response that can be queued for transmission.\nThe default value is @ref BLE_GATTC_WRITE_CMD_TX_QUEUE_SIZE_DEFAULT"]
    pub write_cmd_tx_queue_size: u8,
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of ble_gattc_conn_cfg_t"][::core::mem::size_of::<ble_gattc_conn_cfg_t>() - 1usize];
    ["Alignment of ble_gattc_conn_cfg_t"][::core::mem::align_of::<ble_gattc_conn_cfg_t>() - 1usize];
    ["Offset of field: ble_gattc_conn_cfg_t::write_cmd_tx_queue_size"]
        [::core::mem::offset_of!(ble_gattc_conn_cfg_t, write_cmd_tx_queue_size) - 0usize];
};
#[doc = "@brief Operation Handle Range."]
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct ble_gattc_handle_range_t {
    #[doc = "< Start Handle."]
    pub start_handle: u16,
    #[doc = "< End Handle."]
    pub end_handle: u16,
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of ble_gattc_handle_range_t"][::core::mem::size_of::<ble_gattc_handle_range_t>() - 4usize];
    ["Alignment of ble_gattc_handle_range_t"][::core::mem::align_of::<ble_gattc_handle_range_t>() - 2usize];
    ["Offset of field: ble_gattc_handle_range_t::start_handle"]
        [::core::mem::offset_of!(ble_gattc_handle_range_t, start_handle) - 0usize];
    ["Offset of field: ble_gattc_handle_range_t::end_handle"]
        [::core::mem::offset_of!(ble_gattc_handle_range_t, end_handle) - 2usize];
};
#[doc = "@brief GATT service."]
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct ble_gattc_service_t {
    #[doc = "< Service UUID."]
    pub uuid: ble_uuid_t,
    #[doc = "< Service Handle Range."]
    pub handle_range: ble_gattc_handle_range_t,
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of ble_gattc_service_t"][::core::mem::size_of::<ble_gattc_service_t>() - 8usize];
    ["Alignment of ble_gattc_service_t"][::core::mem::align_of::<ble_gattc_service_t>() - 2usize];
    ["Offset of field: ble_gattc_service_t::uuid"][::core::mem::offset_of!(ble_gattc_service_t, uuid) - 0usize];
    ["Offset of field: ble_gattc_service_t::handle_range"]
        [::core::mem::offset_of!(ble_gattc_service_t, handle_range) - 4usize];
};
#[doc = "@brief  GATT include."]
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct ble_gattc_include_t {
    #[doc = "< Include Handle."]
    pub handle: u16,
    #[doc = "< Handle of the included service."]
    pub included_srvc: ble_gattc_service_t,
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of ble_gattc_include_t"][::core::mem::size_of::<ble_gattc_include_t>() - 10usize];
    ["Alignment of ble_gattc_include_t"][::core::mem::align_of::<ble_gattc_include_t>() - 2usize];
    ["Offset of field: ble_gattc_include_t::handle"][::core::mem::offset_of!(ble_gattc_include_t, handle) - 0usize];
    ["Offset of field: ble_gattc_include_t::included_srvc"]
        [::core::mem::offset_of!(ble_gattc_include_t, included_srvc) - 2usize];
};
#[doc = "@brief GATT characteristic."]
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct ble_gattc_char_t {
    #[doc = "< Characteristic UUID."]
    pub uuid: ble_uuid_t,
    #[doc = "< Characteristic Properties."]
    pub char_props: ble_gatt_char_props_t,
    pub _bitfield_align_1: [u8; 0],
    pub _bitfield_1: __BindgenBitfieldUnit<[u8; 1usize]>,
    #[doc = "< Handle of the Characteristic Declaration."]
    pub handle_decl: u16,
    #[doc = "< Handle of the Characteristic Value."]
    pub handle_value: u16,
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of ble_gattc_char_t"][::core::mem::size_of::<ble_gattc_char_t>() - 10usize];
    ["Alignment of ble_gattc_char_t"][::core::mem::align_of::<ble_gattc_char_t>() - 2usize];
    ["Offset of field: ble_gattc_char_t::uuid"][::core::mem::offset_of!(ble_gattc_char_t, uuid) - 0usize];
    ["Offset of field: ble_gattc_char_t::char_props"][::core::mem::offset_of!(ble_gattc_char_t, char_props) - 4usize];
    ["Offset of field: ble_gattc_char_t::handle_decl"][::core::mem::offset_of!(ble_gattc_char_t, handle_decl) - 6usize];
    ["Offset of field: ble_gattc_char_t::handle_value"]
        [::core::mem::offset_of!(ble_gattc_char_t, handle_value) - 8usize];
};
impl ble_gattc_char_t {
    #[inline]
    pub fn char_ext_props(&self) -> u8 {
        unsafe { ::core::mem::transmute(self._bitfield_1.get(0usize, 1u8) as u8) }
    }
    #[inline]
    pub fn set_char_ext_props(&mut self, val: u8) {
        unsafe {
            let val: u8 = ::core::mem::transmute(val);
            self._bitfield_1.set(0usize, 1u8, val as u64)
        }
    }
    #[inline]
    pub unsafe fn char_ext_props_raw(this: *const Self) -> u8 {
        unsafe {
            ::core::mem::transmute(<__BindgenBitfieldUnit<[u8; 1usize]>>::raw_get(
                ::core::ptr::addr_of!((*this)._bitfield_1),
                0usize,
                1u8,
            ) as u8)
        }
    }
    #[inline]
    pub unsafe fn set_char_ext_props_raw(this: *mut Self, val: u8) {
        unsafe {
            let val: u8 = ::core::mem::transmute(val);
            <__BindgenBitfieldUnit<[u8; 1usize]>>::raw_set(
                ::core::ptr::addr_of_mut!((*this)._bitfield_1),
                0usize,
                1u8,
                val as u64,
            )
        }
    }
    #[inline]
    pub fn new_bitfield_1(char_ext_props: u8) -> __BindgenBitfieldUnit<[u8; 1usize]> {
        let mut __bindgen_bitfield_unit: __BindgenBitfieldUnit<[u8; 1usize]> = Default::default();
        __bindgen_bitfield_unit.set(0usize, 1u8, {
            let char_ext_props: u8 = unsafe { ::core::mem::transmute(char_ext_props) };
            char_ext_props as u64
        });
        __bindgen_bitfield_unit
    }
}
#[doc = "@brief GATT descriptor."]
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct ble_gattc_desc_t {
    #[doc = "< Descriptor Handle."]
    pub handle: u16,
    #[doc = "< Descriptor UUID."]
    pub uuid: ble_uuid_t,
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of ble_gattc_desc_t"][::core::mem::size_of::<ble_gattc_desc_t>() - 6usize];
    ["Alignment of ble_gattc_desc_t"][::core::mem::align_of::<ble_gattc_desc_t>() - 2usize];
    ["Offset of field: ble_gattc_desc_t::handle"][::core::mem::offset_of!(ble_gattc_desc_t, handle) - 0usize];
    ["Offset of field: ble_gattc_desc_t::uuid"][::core::mem::offset_of!(ble_gattc_desc_t, uuid) - 2usize];
};
#[doc = "@brief Write Parameters."]
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct ble_gattc_write_params_t {
    #[doc = "< Write Operation to be performed, see @ref BLE_GATT_WRITE_OPS."]
    pub write_op: u8,
    #[doc = "< Flags, see @ref BLE_GATT_EXEC_WRITE_FLAGS."]
    pub flags: u8,
    #[doc = "< Handle to the attribute to be written."]
    pub handle: u16,
    #[doc = "< Offset in bytes. @note For WRITE_CMD and WRITE_REQ, offset must be 0."]
    pub offset: u16,
    #[doc = "< Length of data in bytes."]
    pub len: u16,
    #[doc = "< Pointer to the value data."]
    pub p_value: *const u8,
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of ble_gattc_write_params_t"][::core::mem::size_of::<ble_gattc_write_params_t>() - 12usize];
    ["Alignment of ble_gattc_write_params_t"][::core::mem::align_of::<ble_gattc_write_params_t>() - 4usize];
    ["Offset of field: ble_gattc_write_params_t::write_op"]
        [::core::mem::offset_of!(ble_gattc_write_params_t, write_op) - 0usize];
    ["Offset of field: ble_gattc_write_params_t::flags"]
        [::core::mem::offset_of!(ble_gattc_write_params_t, flags) - 1usize];
    ["Offset of field: ble_gattc_write_params_t::handle"]
        [::core::mem::offset_of!(ble_gattc_write_params_t, handle) - 2usize];
    ["Offset of field: ble_gattc_write_params_t::offset"]
        [::core::mem::offset_of!(ble_gattc_write_params_t, offset) - 4usize];
    ["Offset of field: ble_gattc_write_params_t::len"][::core::mem::offset_of!(ble_gattc_write_params_t, len) - 6usize];
    ["Offset of field: ble_gattc_write_params_t::p_value"]
        [::core::mem::offset_of!(ble_gattc_write_params_t, p_value) - 8usize];
};
#[doc = "@brief Attribute Information for 16-bit Attribute UUID."]
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct ble_gattc_attr_info16_t {
    #[doc = "< Attribute handle."]
    pub handle: u16,
    #[doc = "< 16-bit Attribute UUID."]
    pub uuid: ble_uuid_t,
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of ble_gattc_attr_info16_t"][::core::mem::size_of::<ble_gattc_attr_info16_t>() - 6usize];
    ["Alignment of ble_gattc_attr_info16_t"][::core::mem::align_of::<ble_gattc_attr_info16_t>() - 2usize];
    ["Offset of field: ble_gattc_attr_info16_t::handle"]
        [::core::mem::offset_of!(ble_gattc_attr_info16_t, handle) - 0usize];
    ["Offset of field: ble_gattc_attr_info16_t::uuid"][::core::mem::offset_of!(ble_gattc_attr_info16_t, uuid) - 2usize];
};
#[doc = "@brief Attribute Information for 128-bit Attribute UUID."]
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct ble_gattc_attr_info128_t {
    #[doc = "< Attribute handle."]
    pub handle: u16,
    #[doc = "< 128-bit Attribute UUID."]
    pub uuid: ble_uuid128_t,
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of ble_gattc_attr_info128_t"][::core::mem::size_of::<ble_gattc_attr_info128_t>() - 18usize];
    ["Alignment of ble_gattc_attr_info128_t"][::core::mem::align_of::<ble_gattc_attr_info128_t>() - 2usize];
    ["Offset of field: ble_gattc_attr_info128_t::handle"]
        [::core::mem::offset_of!(ble_gattc_attr_info128_t, handle) - 0usize];
    ["Offset of field: ble_gattc_attr_info128_t::uuid"]
        [::core::mem::offset_of!(ble_gattc_attr_info128_t, uuid) - 2usize];
};
#[doc = "@brief Event structure for @ref BLE_GATTC_EVT_PRIM_SRVC_DISC_RSP."]
#[repr(C)]
#[derive(Debug)]
pub struct ble_gattc_evt_prim_srvc_disc_rsp_t {
    #[doc = "< Service count."]
    pub count: u16,
    #[doc = "< Service data. @note This is a variable length array. The size of 1 indicated is only a placeholder for compilation.\nSee @ref sd_ble_evt_get for more information on how to use event structures with variable length array members."]
    pub services: __IncompleteArrayField<ble_gattc_service_t>,
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of ble_gattc_evt_prim_srvc_disc_rsp_t"]
        [::core::mem::size_of::<ble_gattc_evt_prim_srvc_disc_rsp_t>() - 2usize];
    ["Alignment of ble_gattc_evt_prim_srvc_disc_rsp_t"]
        [::core::mem::align_of::<ble_gattc_evt_prim_srvc_disc_rsp_t>() - 2usize];
    ["Offset of field: ble_gattc_evt_prim_srvc_disc_rsp_t::count"]
        [::core::mem::offset_of!(ble_gattc_evt_prim_srvc_disc_rsp_t, count) - 0usize];
    ["Offset of field: ble_gattc_evt_prim_srvc_disc_rsp_t::services"]
        [::core::mem::offset_of!(ble_gattc_evt_prim_srvc_disc_rsp_t, services) - 2usize];
};
#[doc = "@brief Event structure for @ref BLE_GATTC_EVT_REL_DISC_RSP."]
#[repr(C)]
#[derive(Debug)]
pub struct ble_gattc_evt_rel_disc_rsp_t {
    #[doc = "< Include count."]
    pub count: u16,
    #[doc = "< Include data. @note This is a variable length array. The size of 1 indicated is only a placeholder for compilation.\nSee @ref sd_ble_evt_get for more information on how to use event structures with variable length array members."]
    pub includes: __IncompleteArrayField<ble_gattc_include_t>,
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of ble_gattc_evt_rel_disc_rsp_t"][::core::mem::size_of::<ble_gattc_evt_rel_disc_rsp_t>() - 2usize];
    ["Alignment of ble_gattc_evt_rel_disc_rsp_t"][::core::mem::align_of::<ble_gattc_evt_rel_disc_rsp_t>() - 2usize];
    ["Offset of field: ble_gattc_evt_rel_disc_rsp_t::count"]
        [::core::mem::offset_of!(ble_gattc_evt_rel_disc_rsp_t, count) - 0usize];
    ["Offset of field: ble_gattc_evt_rel_disc_rsp_t::includes"]
        [::core::mem::offset_of!(ble_gattc_evt_rel_disc_rsp_t, includes) - 2usize];
};
#[doc = "@brief Event structure for @ref BLE_GATTC_EVT_CHAR_DISC_RSP."]
#[repr(C)]
#[derive(Debug)]
pub struct ble_gattc_evt_char_disc_rsp_t {
    #[doc = "< Characteristic count."]
    pub count: u16,
    #[doc = "< Characteristic data. @note This is a variable length array. The size of 1 indicated is only a placeholder for compilation.\nSee @ref sd_ble_evt_get for more information on how to use event structures with variable length array members."]
    pub chars: __IncompleteArrayField<ble_gattc_char_t>,
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of ble_gattc_evt_char_disc_rsp_t"][::core::mem::size_of::<ble_gattc_evt_char_disc_rsp_t>() - 2usize];
    ["Alignment of ble_gattc_evt_char_disc_rsp_t"][::core::mem::align_of::<ble_gattc_evt_char_disc_rsp_t>() - 2usize];
    ["Offset of field: ble_gattc_evt_char_disc_rsp_t::count"]
        [::core::mem::offset_of!(ble_gattc_evt_char_disc_rsp_t, count) - 0usize];
    ["Offset of field: ble_gattc_evt_char_disc_rsp_t::chars"]
        [::core::mem::offset_of!(ble_gattc_evt_char_disc_rsp_t, chars) - 2usize];
};
#[doc = "@brief Event structure for @ref BLE_GATTC_EVT_DESC_DISC_RSP."]
#[repr(C)]
#[derive(Debug)]
pub struct ble_gattc_evt_desc_disc_rsp_t {
    #[doc = "< Descriptor count."]
    pub count: u16,
    #[doc = "< Descriptor data. @note This is a variable length array. The size of 1 indicated is only a placeholder for compilation.\nSee @ref sd_ble_evt_get for more information on how to use event structures with variable length array members."]
    pub descs: __IncompleteArrayField<ble_gattc_desc_t>,
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of ble_gattc_evt_desc_disc_rsp_t"][::core::mem::size_of::<ble_gattc_evt_desc_disc_rsp_t>() - 2usize];
    ["Alignment of ble_gattc_evt_desc_disc_rsp_t"][::core::mem::align_of::<ble_gattc_evt_desc_disc_rsp_t>() - 2usize];
    ["Offset of field: ble_gattc_evt_desc_disc_rsp_t::count"]
        [::core::mem::offset_of!(ble_gattc_evt_desc_disc_rsp_t, count) - 0usize];
    ["Offset of field: ble_gattc_evt_desc_disc_rsp_t::descs"]
        [::core::mem::offset_of!(ble_gattc_evt_desc_disc_rsp_t, descs) - 2usize];
};
#[doc = "@brief Event structure for @ref BLE_GATTC_EVT_ATTR_INFO_DISC_RSP."]
#[repr(C)]
pub struct ble_gattc_evt_attr_info_disc_rsp_t {
    #[doc = "< Attribute count."]
    pub count: u16,
    #[doc = "< Attribute information format, see @ref BLE_GATTC_ATTR_INFO_FORMAT."]
    pub format: u8,
    #[doc = "< Attribute information union."]
    pub info: ble_gattc_evt_attr_info_disc_rsp_t__bindgen_ty_1,
}
#[repr(C)]
pub struct ble_gattc_evt_attr_info_disc_rsp_t__bindgen_ty_1 {
    #[doc = "< Attribute information for 16-bit Attribute UUID.\n@note This is a variable length array. The size of 1 indicated is only a placeholder for compilation.\nSee @ref sd_ble_evt_get for more information on how to use event structures with variable length array members."]
    pub attr_info16: __BindgenUnionField<[ble_gattc_attr_info16_t; 0usize]>,
    #[doc = "< Attribute information for 128-bit Attribute UUID.\n@note This is a variable length array. The size of 1 indicated is only a placeholder for compilation.\nSee @ref sd_ble_evt_get for more information on how to use event structures with variable length array members."]
    pub attr_info128: __BindgenUnionField<[ble_gattc_attr_info128_t; 0usize]>,
    pub bindgen_union_field: [u16; 0usize],
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of ble_gattc_evt_attr_info_disc_rsp_t__bindgen_ty_1"]
        [::core::mem::size_of::<ble_gattc_evt_attr_info_disc_rsp_t__bindgen_ty_1>() - 0usize];
    ["Alignment of ble_gattc_evt_attr_info_disc_rsp_t__bindgen_ty_1"]
        [::core::mem::align_of::<ble_gattc_evt_attr_info_disc_rsp_t__bindgen_ty_1>() - 2usize];
    ["Offset of field: ble_gattc_evt_attr_info_disc_rsp_t__bindgen_ty_1::attr_info16"]
        [::core::mem::offset_of!(ble_gattc_evt_attr_info_disc_rsp_t__bindgen_ty_1, attr_info16) - 0usize];
    ["Offset of field: ble_gattc_evt_attr_info_disc_rsp_t__bindgen_ty_1::attr_info128"]
        [::core::mem::offset_of!(ble_gattc_evt_attr_info_disc_rsp_t__bindgen_ty_1, attr_info128) - 0usize];
};
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of ble_gattc_evt_attr_info_disc_rsp_t"]
        [::core::mem::size_of::<ble_gattc_evt_attr_info_disc_rsp_t>() - 4usize];
    ["Alignment of ble_gattc_evt_attr_info_disc_rsp_t"]
        [::core::mem::align_of::<ble_gattc_evt_attr_info_disc_rsp_t>() - 2usize];
    ["Offset of field: ble_gattc_evt_attr_info_disc_rsp_t::count"]
        [::core::mem::offset_of!(ble_gattc_evt_attr_info_disc_rsp_t, count) - 0usize];
    ["Offset of field: ble_gattc_evt_attr_info_disc_rsp_t::format"]
        [::core::mem::offset_of!(ble_gattc_evt_attr_info_disc_rsp_t, format) - 2usize];
    ["Offset of field: ble_gattc_evt_attr_info_disc_rsp_t::info"]
        [::core::mem::offset_of!(ble_gattc_evt_attr_info_disc_rsp_t, info) - 4usize];
};
#[doc = "@brief GATT read by UUID handle value pair."]
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct ble_gattc_handle_value_t {
    #[doc = "< Attribute Handle."]
    pub handle: u16,
    #[doc = "< Pointer to the Attribute Value, length is available in @ref ble_gattc_evt_char_val_by_uuid_read_rsp_t::value_len."]
    pub p_value: *mut u8,
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of ble_gattc_handle_value_t"][::core::mem::size_of::<ble_gattc_handle_value_t>() - 8usize];
    ["Alignment of ble_gattc_handle_value_t"][::core::mem::align_of::<ble_gattc_handle_value_t>() - 4usize];
    ["Offset of field: ble_gattc_handle_value_t::handle"]
        [::core::mem::offset_of!(ble_gattc_handle_value_t, handle) - 0usize];
    ["Offset of field: ble_gattc_handle_value_t::p_value"]
        [::core::mem::offset_of!(ble_gattc_handle_value_t, p_value) - 4usize];
};
#[doc = "@brief Event structure for @ref BLE_GATTC_EVT_CHAR_VAL_BY_UUID_READ_RSP."]
#[repr(C)]
#[derive(Debug)]
pub struct ble_gattc_evt_char_val_by_uuid_read_rsp_t {
    #[doc = "< Handle-Value Pair Count."]
    pub count: u16,
    #[doc = "< Length of the value in Handle-Value(s) list."]
    pub value_len: u16,
    #[doc = "< Handle-Value(s) list. To iterate through the list use @ref sd_ble_gattc_evt_char_val_by_uuid_read_rsp_iter.\n@note This is a variable length array. The size of 1 indicated is only a placeholder for compilation.\nSee @ref sd_ble_evt_get for more information on how to use event structures with variable length array members."]
    pub handle_value: __IncompleteArrayField<u8>,
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of ble_gattc_evt_char_val_by_uuid_read_rsp_t"]
        [::core::mem::size_of::<ble_gattc_evt_char_val_by_uuid_read_rsp_t>() - 4usize];
    ["Alignment of ble_gattc_evt_char_val_by_uuid_read_rsp_t"]
        [::core::mem::align_of::<ble_gattc_evt_char_val_by_uuid_read_rsp_t>() - 2usize];
    ["Offset of field: ble_gattc_evt_char_val_by_uuid_read_rsp_t::count"]
        [::core::mem::offset_of!(ble_gattc_evt_char_val_by_uuid_read_rsp_t, count) - 0usize];
    ["Offset of field: ble_gattc_evt_char_val_by_uuid_read_rsp_t::value_len"]
        [::core::mem::offset_of!(ble_gattc_evt_char_val_by_uuid_read_rsp_t, value_len) - 2usize];
    ["Offset of field: ble_gattc_evt_char_val_by_uuid_read_rsp_t::handle_value"]
        [::core::mem::offset_of!(ble_gattc_evt_char_val_by_uuid_read_rsp_t, handle_value) - 4usize];
};
#[doc = "@brief Event structure for @ref BLE_GATTC_EVT_READ_RSP."]
#[repr(C)]
#[derive(Debug)]
pub struct ble_gattc_evt_read_rsp_t {
    #[doc = "< Attribute Handle."]
    pub handle: u16,
    #[doc = "< Offset of the attribute data."]
    pub offset: u16,
    #[doc = "< Attribute data length."]
    pub len: u16,
    #[doc = "< Attribute data. @note This is a variable length array. The size of 1 indicated is only a placeholder for compilation.\nSee @ref sd_ble_evt_get for more information on how to use event structures with variable length array members."]
    pub data: __IncompleteArrayField<u8>,
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of ble_gattc_evt_read_rsp_t"][::core::mem::size_of::<ble_gattc_evt_read_rsp_t>() - 6usize];
    ["Alignment of ble_gattc_evt_read_rsp_t"][::core::mem::align_of::<ble_gattc_evt_read_rsp_t>() - 2usize];
    ["Offset of field: ble_gattc_evt_read_rsp_t::handle"]
        [::core::mem::offset_of!(ble_gattc_evt_read_rsp_t, handle) - 0usize];
    ["Offset of field: ble_gattc_evt_read_rsp_t::offset"]
        [::core::mem::offset_of!(ble_gattc_evt_read_rsp_t, offset) - 2usize];
    ["Offset of field: ble_gattc_evt_read_rsp_t::len"][::core::mem::offset_of!(ble_gattc_evt_read_rsp_t, len) - 4usize];
    ["Offset of field: ble_gattc_evt_read_rsp_t::data"]
        [::core::mem::offset_of!(ble_gattc_evt_read_rsp_t, data) - 6usize];
};
#[doc = "@brief Event structure for @ref BLE_GATTC_EVT_CHAR_VALS_READ_RSP."]
#[repr(C)]
#[derive(Debug)]
pub struct ble_gattc_evt_char_vals_read_rsp_t {
    #[doc = "< Concatenated Attribute values length."]
    pub len: u16,
    #[doc = "< Attribute values. @note This is a variable length array. The size of 1 indicated is only a placeholder for compilation.\nSee @ref sd_ble_evt_get for more information on how to use event structures with variable length array members."]
    pub values: __IncompleteArrayField<u8>,
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of ble_gattc_evt_char_vals_read_rsp_t"]
        [::core::mem::size_of::<ble_gattc_evt_char_vals_read_rsp_t>() - 2usize];
    ["Alignment of ble_gattc_evt_char_vals_read_rsp_t"]
        [::core::mem::align_of::<ble_gattc_evt_char_vals_read_rsp_t>() - 2usize];
    ["Offset of field: ble_gattc_evt_char_vals_read_rsp_t::len"]
        [::core::mem::offset_of!(ble_gattc_evt_char_vals_read_rsp_t, len) - 0usize];
    ["Offset of field: ble_gattc_evt_char_vals_read_rsp_t::values"]
        [::core::mem::offset_of!(ble_gattc_evt_char_vals_read_rsp_t, values) - 2usize];
};
#[doc = "@brief Event structure for @ref BLE_GATTC_EVT_WRITE_RSP."]
#[repr(C)]
#[derive(Debug)]
pub struct ble_gattc_evt_write_rsp_t {
    #[doc = "< Attribute Handle."]
    pub handle: u16,
    #[doc = "< Type of write operation, see @ref BLE_GATT_WRITE_OPS."]
    pub write_op: u8,
    #[doc = "< Data offset."]
    pub offset: u16,
    #[doc = "< Data length."]
    pub len: u16,
    #[doc = "< Data. @note This is a variable length array. The size of 1 indicated is only a placeholder for compilation.\nSee @ref sd_ble_evt_get for more information on how to use event structures with variable length array members."]
    pub data: __IncompleteArrayField<u8>,
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of ble_gattc_evt_write_rsp_t"][::core::mem::size_of::<ble_gattc_evt_write_rsp_t>() - 8usize];
    ["Alignment of ble_gattc_evt_write_rsp_t"][::core::mem::align_of::<ble_gattc_evt_write_rsp_t>() - 2usize];
    ["Offset of field: ble_gattc_evt_write_rsp_t::handle"]
        [::core::mem::offset_of!(ble_gattc_evt_write_rsp_t, handle) - 0usize];
    ["Offset of field: ble_gattc_evt_write_rsp_t::write_op"]
        [::core::mem::offset_of!(ble_gattc_evt_write_rsp_t, write_op) - 2usize];
    ["Offset of field: ble_gattc_evt_write_rsp_t::offset"]
        [::core::mem::offset_of!(ble_gattc_evt_write_rsp_t, offset) - 4usize];
    ["Offset of field: ble_gattc_evt_write_rsp_t::len"]
        [::core::mem::offset_of!(ble_gattc_evt_write_rsp_t, len) - 6usize];
    ["Offset of field: ble_gattc_evt_write_rsp_t::data"]
        [::core::mem::offset_of!(ble_gattc_evt_write_rsp_t, data) - 8usize];
};
#[doc = "@brief Event structure for @ref BLE_GATTC_EVT_HVX."]
#[repr(C)]
#[derive(Debug)]
pub struct ble_gattc_evt_hvx_t {
    #[doc = "< Handle to which the HVx operation applies."]
    pub handle: u16,
    #[doc = "< Indication or Notification, see @ref BLE_GATT_HVX_TYPES."]
    pub type_: u8,
    #[doc = "< Attribute data length."]
    pub len: u16,
    #[doc = "< Attribute data. @note This is a variable length array. The size of 1 indicated is only a placeholder for compilation.\nSee @ref sd_ble_evt_get for more information on how to use event structures with variable length array members."]
    pub data: __IncompleteArrayField<u8>,
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of ble_gattc_evt_hvx_t"][::core::mem::size_of::<ble_gattc_evt_hvx_t>() - 6usize];
    ["Alignment of ble_gattc_evt_hvx_t"][::core::mem::align_of::<ble_gattc_evt_hvx_t>() - 2usize];
    ["Offset of field: ble_gattc_evt_hvx_t::handle"][::core::mem::offset_of!(ble_gattc_evt_hvx_t, handle) - 0usize];
    ["Offset of field: ble_gattc_evt_hvx_t::type_"][::core::mem::offset_of!(ble_gattc_evt_hvx_t, type_) - 2usize];
    ["Offset of field: ble_gattc_evt_hvx_t::len"][::core::mem::offset_of!(ble_gattc_evt_hvx_t, len) - 4usize];
    ["Offset of field: ble_gattc_evt_hvx_t::data"][::core::mem::offset_of!(ble_gattc_evt_hvx_t, data) - 6usize];
};
#[doc = "@brief Event structure for @ref BLE_GATTC_EVT_EXCHANGE_MTU_RSP."]
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct ble_gattc_evt_exchange_mtu_rsp_t {
    #[doc = "< Server RX MTU size."]
    pub server_rx_mtu: u16,
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of ble_gattc_evt_exchange_mtu_rsp_t"][::core::mem::size_of::<ble_gattc_evt_exchange_mtu_rsp_t>() - 2usize];
    ["Alignment of ble_gattc_evt_exchange_mtu_rsp_t"]
        [::core::mem::align_of::<ble_gattc_evt_exchange_mtu_rsp_t>() - 2usize];
    ["Offset of field: ble_gattc_evt_exchange_mtu_rsp_t::server_rx_mtu"]
        [::core::mem::offset_of!(ble_gattc_evt_exchange_mtu_rsp_t, server_rx_mtu) - 0usize];
};
#[doc = "@brief Event structure for @ref BLE_GATTC_EVT_TIMEOUT."]
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct ble_gattc_evt_timeout_t {
    #[doc = "< Timeout source, see @ref BLE_GATT_TIMEOUT_SOURCES."]
    pub src: u8,
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of ble_gattc_evt_timeout_t"][::core::mem::size_of::<ble_gattc_evt_timeout_t>() - 1usize];
    ["Alignment of ble_gattc_evt_timeout_t"][::core::mem::align_of::<ble_gattc_evt_timeout_t>() - 1usize];
    ["Offset of field: ble_gattc_evt_timeout_t::src"][::core::mem::offset_of!(ble_gattc_evt_timeout_t, src) - 0usize];
};
#[doc = "@brief Event structure for @ref BLE_GATTC_EVT_WRITE_CMD_TX_COMPLETE."]
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct ble_gattc_evt_write_cmd_tx_complete_t {
    #[doc = "< Number of write without response transmissions completed."]
    pub count: u8,
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of ble_gattc_evt_write_cmd_tx_complete_t"]
        [::core::mem::size_of::<ble_gattc_evt_write_cmd_tx_complete_t>() - 1usize];
    ["Alignment of ble_gattc_evt_write_cmd_tx_complete_t"]
        [::core::mem::align_of::<ble_gattc_evt_write_cmd_tx_complete_t>() - 1usize];
    ["Offset of field: ble_gattc_evt_write_cmd_tx_complete_t::count"]
        [::core::mem::offset_of!(ble_gattc_evt_write_cmd_tx_complete_t, count) - 0usize];
};
#[doc = "@brief GATTC event structure."]
#[repr(C)]
pub struct ble_gattc_evt_t {
    #[doc = "< Connection Handle on which event occurred."]
    pub conn_handle: u16,
    #[doc = "< GATT status code for the operation, see @ref BLE_GATT_STATUS_CODES."]
    pub gatt_status: u16,
    #[doc = "< In case of error: The handle causing the error. In all other cases @ref BLE_GATT_HANDLE_INVALID."]
    pub error_handle: u16,
    #[doc = "< Event Parameters. @note Only valid if @ref gatt_status == @ref BLE_GATT_STATUS_SUCCESS."]
    pub params: ble_gattc_evt_t__bindgen_ty_1,
}
#[repr(C)]
pub struct ble_gattc_evt_t__bindgen_ty_1 {
    #[doc = "< Primary Service Discovery Response Event Parameters."]
    pub prim_srvc_disc_rsp: __BindgenUnionField<ble_gattc_evt_prim_srvc_disc_rsp_t>,
    #[doc = "< Relationship Discovery Response Event Parameters."]
    pub rel_disc_rsp: __BindgenUnionField<ble_gattc_evt_rel_disc_rsp_t>,
    #[doc = "< Characteristic Discovery Response Event Parameters."]
    pub char_disc_rsp: __BindgenUnionField<ble_gattc_evt_char_disc_rsp_t>,
    #[doc = "< Descriptor Discovery Response Event Parameters."]
    pub desc_disc_rsp: __BindgenUnionField<ble_gattc_evt_desc_disc_rsp_t>,
    #[doc = "< Characteristic Value Read by UUID Response Event Parameters."]
    pub char_val_by_uuid_read_rsp: __BindgenUnionField<ble_gattc_evt_char_val_by_uuid_read_rsp_t>,
    #[doc = "< Read Response Event Parameters."]
    pub read_rsp: __BindgenUnionField<ble_gattc_evt_read_rsp_t>,
    #[doc = "< Characteristic Values Read Response Event Parameters."]
    pub char_vals_read_rsp: __BindgenUnionField<ble_gattc_evt_char_vals_read_rsp_t>,
    #[doc = "< Write Response Event Parameters."]
    pub write_rsp: __BindgenUnionField<ble_gattc_evt_write_rsp_t>,
    #[doc = "< Handle Value Notification/Indication Event Parameters."]
    pub hvx: __BindgenUnionField<ble_gattc_evt_hvx_t>,
    #[doc = "< Exchange MTU Response Event Parameters."]
    pub exchange_mtu_rsp: __BindgenUnionField<ble_gattc_evt_exchange_mtu_rsp_t>,
    #[doc = "< Timeout Event Parameters."]
    pub timeout: __BindgenUnionField<ble_gattc_evt_timeout_t>,
    #[doc = "< Attribute Information Discovery Event Parameters."]
    pub attr_info_disc_rsp: __BindgenUnionField<ble_gattc_evt_attr_info_disc_rsp_t>,
    #[doc = "< Write without Response transmission complete Event Parameters."]
    pub write_cmd_tx_complete: __BindgenUnionField<ble_gattc_evt_write_cmd_tx_complete_t>,
    pub bindgen_union_field: [u16; 4usize],
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of ble_gattc_evt_t__bindgen_ty_1"][::core::mem::size_of::<ble_gattc_evt_t__bindgen_ty_1>() - 8usize];
    ["Alignment of ble_gattc_evt_t__bindgen_ty_1"][::core::mem::align_of::<ble_gattc_evt_t__bindgen_ty_1>() - 2usize];
    ["Offset of field: ble_gattc_evt_t__bindgen_ty_1::prim_srvc_disc_rsp"]
        [::core::mem::offset_of!(ble_gattc_evt_t__bindgen_ty_1, prim_srvc_disc_rsp) - 0usize];
    ["Offset of field: ble_gattc_evt_t__bindgen_ty_1::rel_disc_rsp"]
        [::core::mem::offset_of!(ble_gattc_evt_t__bindgen_ty_1, rel_disc_rsp) - 0usize];
    ["Offset of field: ble_gattc_evt_t__bindgen_ty_1::char_disc_rsp"]
        [::core::mem::offset_of!(ble_gattc_evt_t__bindgen_ty_1, char_disc_rsp) - 0usize];
    ["Offset of field: ble_gattc_evt_t__bindgen_ty_1::desc_disc_rsp"]
        [::core::mem::offset_of!(ble_gattc_evt_t__bindgen_ty_1, desc_disc_rsp) - 0usize];
    ["Offset of field: ble_gattc_evt_t__bindgen_ty_1::char_val_by_uuid_read_rsp"]
        [::core::mem::offset_of!(ble_gattc_evt_t__bindgen_ty_1, char_val_by_uuid_read_rsp) - 0usize];
    ["Offset of field: ble_gattc_evt_t__bindgen_ty_1::read_rsp"]
        [::core::mem::offset_of!(ble_gattc_evt_t__bindgen_ty_1, read_rsp) - 0usize];
    ["Offset of field: ble_gattc_evt_t__bindgen_ty_1::char_vals_read_rsp"]
        [::core::mem::offset_of!(ble_gattc_evt_t__bindgen_ty_1, char_vals_read_rsp) - 0usize];
    ["Offset of field: ble_gattc_evt_t__bindgen_ty_1::write_rsp"]
        [::core::mem::offset_of!(ble_gattc_evt_t__bindgen_ty_1, write_rsp) - 0usize];
    ["Offset of field: ble_gattc_evt_t__bindgen_ty_1::hvx"]
        [::core::mem::offset_of!(ble_gattc_evt_t__bindgen_ty_1, hvx) - 0usize];
    ["Offset of field: ble_gattc_evt_t__bindgen_ty_1::exchange_mtu_rsp"]
        [::core::mem::offset_of!(ble_gattc_evt_t__bindgen_ty_1, exchange_mtu_rsp) - 0usize];
    ["Offset of field: ble_gattc_evt_t__bindgen_ty_1::timeout"]
        [::core::mem::offset_of!(ble_gattc_evt_t__bindgen_ty_1, timeout) - 0usize];
    ["Offset of field: ble_gattc_evt_t__bindgen_ty_1::attr_info_disc_rsp"]
        [::core::mem::offset_of!(ble_gattc_evt_t__bindgen_ty_1, attr_info_disc_rsp) - 0usize];
    ["Offset of field: ble_gattc_evt_t__bindgen_ty_1::write_cmd_tx_complete"]
        [::core::mem::offset_of!(ble_gattc_evt_t__bindgen_ty_1, write_cmd_tx_complete) - 0usize];
};
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of ble_gattc_evt_t"][::core::mem::size_of::<ble_gattc_evt_t>() - 14usize];
    ["Alignment of ble_gattc_evt_t"][::core::mem::align_of::<ble_gattc_evt_t>() - 2usize];
    ["Offset of field: ble_gattc_evt_t::conn_handle"][::core::mem::offset_of!(ble_gattc_evt_t, conn_handle) - 0usize];
    ["Offset of field: ble_gattc_evt_t::gatt_status"][::core::mem::offset_of!(ble_gattc_evt_t, gatt_status) - 2usize];
    ["Offset of field: ble_gattc_evt_t::error_handle"][::core::mem::offset_of!(ble_gattc_evt_t, error_handle) - 4usize];
    ["Offset of field: ble_gattc_evt_t::params"][::core::mem::offset_of!(ble_gattc_evt_t, params) - 6usize];
};

#[doc = "@brief Initiate or continue a GATT Primary Service Discovery procedure.\n\n @details This function initiates or resumes a Primary Service discovery procedure, starting from the supplied handle.\n          If the last service has not been reached, this function must be called again with an updated start handle value to continue the search.\n\n @note If any of the discovered services have 128-bit UUIDs which are not present in the table provided to ble_vs_uuids_assign, a UUID structure with\n       type @ref BLE_UUID_TYPE_UNKNOWN will be received in the corresponding event.\n\n @events\n @event{@ref BLE_GATTC_EVT_PRIM_SRVC_DISC_RSP}\n @endevents\n\n @mscs\n @mmsc{@ref BLE_GATTC_PRIM_SRVC_DISC_MSC}\n @endmscs\n\n @param[in] conn_handle The connection handle identifying the connection to perform this procedure on.\n @param[in] start_handle Handle to start searching from.\n @param[in] p_srvc_uuid Pointer to the service UUID to be found. If it is NULL, all primary services will be returned.\n\n @retval ::NRF_SUCCESS Successfully started or resumed the Primary Service Discovery procedure.\n @retval ::BLE_ERROR_INVALID_CONN_HANDLE Invalid Connection Handle.\n @retval ::NRF_ERROR_INVALID_STATE Invalid Connection State.\n @retval ::NRF_ERROR_INVALID_PARAM Invalid parameter(s) supplied.\n @retval ::NRF_ERROR_BUSY Client procedure already in progress.\n @retval ::NRF_ERROR_TIMEOUT There has been a GATT procedure timeout. No new GATT procedure can be performed without reestablishing the connection."]
#[inline(always)]
pub unsafe fn sd_ble_gattc_primary_services_discover(
    conn_handle: u16,
    start_handle: u16,
    p_srvc_uuid: *const ble_uuid_t,
) -> u32 {
    let ret: u32;
    core::arch::asm!("svc 155",
        inout("r0") to_asm(conn_handle) => ret,
        inout("r1") to_asm(start_handle) => _,
        inout("r2") to_asm(p_srvc_uuid) => _,
        lateout("r3") _,
        lateout("r12") _,
    );
    ret
}

#[doc = "@brief Initiate or continue a GATT Relationship Discovery procedure.\n\n @details This function initiates or resumes the Find Included Services sub-procedure. If the last included service has not been reached,\n          this must be called again with an updated handle range to continue the search.\n\n @events\n @event{@ref BLE_GATTC_EVT_REL_DISC_RSP}\n @endevents\n\n @mscs\n @mmsc{@ref BLE_GATTC_REL_DISC_MSC}\n @endmscs\n\n @param[in] conn_handle The connection handle identifying the connection to perform this procedure on.\n @param[in] p_handle_range A pointer to the range of handles of the Service to perform this procedure on.\n\n @retval ::NRF_SUCCESS Successfully started or resumed the Relationship Discovery procedure.\n @retval ::BLE_ERROR_INVALID_CONN_HANDLE Invalid Connection Handle.\n @retval ::NRF_ERROR_INVALID_STATE Invalid Connection State.\n @retval ::NRF_ERROR_INVALID_ADDR Invalid pointer supplied.\n @retval ::NRF_ERROR_INVALID_PARAM Invalid parameter(s) supplied.\n @retval ::NRF_ERROR_BUSY Client procedure already in progress.\n @retval ::NRF_ERROR_TIMEOUT There has been a GATT procedure timeout. No new GATT procedure can be performed without reestablishing the connection."]
#[inline(always)]
pub unsafe fn sd_ble_gattc_relationships_discover(
    conn_handle: u16,
    p_handle_range: *const ble_gattc_handle_range_t,
) -> u32 {
    let ret: u32;
    core::arch::asm!("svc 156",
        inout("r0") to_asm(conn_handle) => ret,
        inout("r1") to_asm(p_handle_range) => _,
        lateout("r2") _,
        lateout("r3") _,
        lateout("r12") _,
    );
    ret
}

#[doc = "@brief Initiate or continue a GATT Characteristic Discovery procedure.\n\n @details This function initiates or resumes a Characteristic discovery procedure. If the last Characteristic has not been reached,\n          this must be called again with an updated handle range to continue the discovery.\n\n @note If any of the discovered characteristics have 128-bit UUIDs which are not present in the table provided to ble_vs_uuids_assign, a UUID structure with\n       type @ref BLE_UUID_TYPE_UNKNOWN will be received in the corresponding event.\n\n @events\n @event{@ref BLE_GATTC_EVT_CHAR_DISC_RSP}\n @endevents\n\n @mscs\n @mmsc{@ref BLE_GATTC_CHAR_DISC_MSC}\n @endmscs\n\n @param[in] conn_handle The connection handle identifying the connection to perform this procedure on.\n @param[in] p_handle_range A pointer to the range of handles of the Service to perform this procedure on.\n\n @retval ::NRF_SUCCESS Successfully started or resumed the Characteristic Discovery procedure.\n @retval ::BLE_ERROR_INVALID_CONN_HANDLE Invalid Connection Handle.\n @retval ::NRF_ERROR_INVALID_STATE Invalid Connection State.\n @retval ::NRF_ERROR_INVALID_ADDR Invalid pointer supplied.\n @retval ::NRF_ERROR_BUSY Client procedure already in progress.\n @retval ::NRF_ERROR_TIMEOUT There has been a GATT procedure timeout. No new GATT procedure can be performed without reestablishing the connection."]
#[inline(always)]
pub unsafe fn sd_ble_gattc_characteristics_discover(
    conn_handle: u16,
    p_handle_range: *const ble_gattc_handle_range_t,
) -> u32 {
    let ret: u32;
    core::arch::asm!("svc 157",
        inout("r0") to_asm(conn_handle) => ret,
        inout("r1") to_asm(p_handle_range) => _,
        lateout("r2") _,
        lateout("r3") _,
        lateout("r12") _,
    );
    ret
}

#[doc = "@brief Initiate or continue a GATT Characteristic Descriptor Discovery procedure.\n\n @details This function initiates or resumes a Characteristic Descriptor discovery procedure. If the last Descriptor has not been reached,\n          this must be called again with an updated handle range to continue the discovery.\n\n @events\n @event{@ref BLE_GATTC_EVT_DESC_DISC_RSP}\n @endevents\n\n @mscs\n @mmsc{@ref BLE_GATTC_DESC_DISC_MSC}\n @endmscs\n\n @param[in] conn_handle The connection handle identifying the connection to perform this procedure on.\n @param[in] p_handle_range A pointer to the range of handles of the Characteristic to perform this procedure on.\n\n @retval ::NRF_SUCCESS Successfully started or resumed the Descriptor Discovery procedure.\n @retval ::BLE_ERROR_INVALID_CONN_HANDLE Invalid Connection Handle.\n @retval ::NRF_ERROR_INVALID_STATE Invalid Connection State.\n @retval ::NRF_ERROR_INVALID_ADDR Invalid pointer supplied.\n @retval ::NRF_ERROR_BUSY Client procedure already in progress.\n @retval ::NRF_ERROR_TIMEOUT There has been a GATT procedure timeout. No new GATT procedure can be performed without reestablishing the connection."]
#[inline(always)]
pub unsafe fn sd_ble_gattc_descriptors_discover(
    conn_handle: u16,
    p_handle_range: *const ble_gattc_handle_range_t,
) -> u32 {
    let ret: u32;
    core::arch::asm!("svc 158",
        inout("r0") to_asm(conn_handle) => ret,
        inout("r1") to_asm(p_handle_range) => _,
        lateout("r2") _,
        lateout("r3") _,
        lateout("r12") _,
    );
    ret
}

#[doc = "@brief Initiate or continue a GATT Read using Characteristic UUID procedure.\n\n @details This function initiates or resumes a Read using Characteristic UUID procedure. If the last Characteristic has not been reached,\n          this must be called again with an updated handle range to continue the discovery.\n\n @events\n @event{@ref BLE_GATTC_EVT_CHAR_VAL_BY_UUID_READ_RSP}\n @endevents\n\n @mscs\n @mmsc{@ref BLE_GATTC_READ_UUID_MSC}\n @endmscs\n\n @param[in] conn_handle The connection handle identifying the connection to perform this procedure on.\n @param[in] p_uuid Pointer to a Characteristic value UUID to read.\n @param[in] p_handle_range A pointer to the range of handles to perform this procedure on.\n\n @retval ::NRF_SUCCESS Successfully started or resumed the Read using Characteristic UUID procedure.\n @retval ::BLE_ERROR_INVALID_CONN_HANDLE Invalid Connection Handle.\n @retval ::NRF_ERROR_INVALID_STATE Invalid Connection State.\n @retval ::NRF_ERROR_INVALID_ADDR Invalid pointer supplied.\n @retval ::NRF_ERROR_BUSY Client procedure already in progress.\n @retval ::NRF_ERROR_TIMEOUT There has been a GATT procedure timeout. No new GATT procedure can be performed without reestablishing the connection."]
#[inline(always)]
pub unsafe fn sd_ble_gattc_char_value_by_uuid_read(
    conn_handle: u16,
    p_uuid: *const ble_uuid_t,
    p_handle_range: *const ble_gattc_handle_range_t,
) -> u32 {
    let ret: u32;
    core::arch::asm!("svc 160",
        inout("r0") to_asm(conn_handle) => ret,
        inout("r1") to_asm(p_uuid) => _,
        inout("r2") to_asm(p_handle_range) => _,
        lateout("r3") _,
        lateout("r12") _,
    );
    ret
}

#[doc = "@brief Initiate or continue a GATT Read (Long) Characteristic or Descriptor procedure.\n\n @details This function initiates or resumes a GATT Read (Long) Characteristic or Descriptor procedure. If the Characteristic or Descriptor\n          to be read is longer than ATT_MTU - 1, this function must be called multiple times with appropriate offset to read the\n          complete value.\n\n @events\n @event{@ref BLE_GATTC_EVT_READ_RSP}\n @endevents\n\n @mscs\n @mmsc{@ref BLE_GATTC_VALUE_READ_MSC}\n @endmscs\n\n @param[in] conn_handle The connection handle identifying the connection to perform this procedure on.\n @param[in] handle The handle of the attribute to be read.\n @param[in] offset Offset into the attribute value to be read.\n\n @retval ::NRF_SUCCESS Successfully started or resumed the Read (Long) procedure.\n @retval ::BLE_ERROR_INVALID_CONN_HANDLE Invalid Connection Handle.\n @retval ::NRF_ERROR_INVALID_STATE Invalid Connection State.\n @retval ::NRF_ERROR_BUSY Client procedure already in progress.\n @retval ::NRF_ERROR_TIMEOUT There has been a GATT procedure timeout. No new GATT procedure can be performed without reestablishing the connection."]
#[inline(always)]
pub unsafe fn sd_ble_gattc_read(conn_handle: u16, handle: u16, offset: u16) -> u32 {
    let ret: u32;
    core::arch::asm!("svc 161",
        inout("r0") to_asm(conn_handle) => ret,
        inout("r1") to_asm(handle) => _,
        inout("r2") to_asm(offset) => _,
        lateout("r3") _,
        lateout("r12") _,
    );
    ret
}

#[doc = "@brief Initiate a GATT Read Multiple Characteristic Values procedure.\n\n @details This function initiates a GATT Read Multiple Characteristic Values procedure.\n\n @events\n @event{@ref BLE_GATTC_EVT_CHAR_VALS_READ_RSP}\n @endevents\n\n @mscs\n @mmsc{@ref BLE_GATTC_READ_MULT_MSC}\n @endmscs\n\n @param[in] conn_handle The connection handle identifying the connection to perform this procedure on.\n @param[in] p_handles A pointer to the handle(s) of the attribute(s) to be read.\n @param[in] handle_count The number of handles in p_handles.\n\n @retval ::NRF_SUCCESS Successfully started the Read Multiple Characteristic Values procedure.\n @retval ::BLE_ERROR_INVALID_CONN_HANDLE Invalid Connection Handle.\n @retval ::NRF_ERROR_INVALID_STATE Invalid Connection State.\n @retval ::NRF_ERROR_INVALID_ADDR Invalid pointer supplied.\n @retval ::NRF_ERROR_BUSY Client procedure already in progress.\n @retval ::NRF_ERROR_TIMEOUT There has been a GATT procedure timeout. No new GATT procedure can be performed without reestablishing the connection."]
#[inline(always)]
pub unsafe fn sd_ble_gattc_char_values_read(conn_handle: u16, p_handles: *const u16, handle_count: u16) -> u32 {
    let ret: u32;
    core::arch::asm!("svc 162",
        inout("r0") to_asm(conn_handle) => ret,
        inout("r1") to_asm(p_handles) => _,
        inout("r2") to_asm(handle_count) => _,
        lateout("r3") _,
        lateout("r12") _,
    );
    ret
}

#[doc = "@brief Perform a Write (Characteristic Value or Descriptor, with or without response, signed or not, long or reliable) procedure.\n\n @details This function can perform all write procedures described in GATT.\n\n @note    Only one write with response procedure can be ongoing per connection at a time.\n          If the application tries to write with response while another write with response procedure is ongoing,\n          the function call will return @ref NRF_ERROR_BUSY.\n          A @ref BLE_GATTC_EVT_WRITE_RSP event will be issued as soon as the write response arrives from the peer.\n\n @note    The number of Write without Response that can be queued is configured by @ref ble_gattc_conn_cfg_t::write_cmd_tx_queue_size\n          When the queue is full, the function call will return @ref NRF_ERROR_RESOURCES.\n          A @ref BLE_GATTC_EVT_WRITE_CMD_TX_COMPLETE event will be issued as soon as the transmission of the write without response is complete.\n\n @note    The application can keep track of the available queue element count for writes without responses by following the procedure below:\n          - Store initial queue element count in a variable.\n          - Decrement the variable, which stores the currently available queue element count, by one when a call to this function returns @ref NRF_SUCCESS.\n          - Increment the variable, which stores the current available queue element count, by the count variable in @ref BLE_GATTC_EVT_WRITE_CMD_TX_COMPLETE event.\n\n @events\n @event{@ref BLE_GATTC_EVT_WRITE_CMD_TX_COMPLETE, Write without response transmission complete.}\n @event{@ref BLE_GATTC_EVT_WRITE_RSP, Write response received from the peer.}\n @endevents\n\n @mscs\n @mmsc{@ref BLE_GATTC_VALUE_WRITE_WITHOUT_RESP_MSC}\n @mmsc{@ref BLE_GATTC_VALUE_WRITE_MSC}\n @mmsc{@ref BLE_GATTC_VALUE_LONG_WRITE_MSC}\n @mmsc{@ref BLE_GATTC_VALUE_RELIABLE_WRITE_MSC}\n @endmscs\n\n @param[in] conn_handle The connection handle identifying the connection to perform this procedure on.\n @param[in] p_write_params A pointer to a write parameters structure.\n\n @retval ::NRF_SUCCESS Successfully started the Write procedure.\n @retval ::BLE_ERROR_INVALID_CONN_HANDLE Invalid Connection Handle.\n @retval ::NRF_ERROR_INVALID_STATE Invalid Connection State.\n @retval ::NRF_ERROR_INVALID_ADDR Invalid pointer supplied.\n @retval ::NRF_ERROR_INVALID_PARAM Invalid parameter(s) supplied.\n @retval ::NRF_ERROR_DATA_SIZE Invalid data size(s) supplied.\n @retval ::NRF_ERROR_BUSY For write with response, procedure already in progress. Wait for a @ref BLE_GATTC_EVT_WRITE_RSP event and retry.\n @retval ::NRF_ERROR_RESOURCES Too many writes without responses queued.\n                               Wait for a @ref BLE_GATTC_EVT_WRITE_CMD_TX_COMPLETE event and retry.\n @retval ::NRF_ERROR_TIMEOUT There has been a GATT procedure timeout. No new GATT procedure can be performed without reestablishing the connection."]
#[inline(always)]
pub unsafe fn sd_ble_gattc_write(conn_handle: u16, p_write_params: *const ble_gattc_write_params_t) -> u32 {
    let ret: u32;
    core::arch::asm!("svc 163",
        inout("r0") to_asm(conn_handle) => ret,
        inout("r1") to_asm(p_write_params) => _,
        lateout("r2") _,
        lateout("r3") _,
        lateout("r12") _,
    );
    ret
}

#[doc = "@brief Send a Handle Value Confirmation to the GATT Server.\n\n @mscs\n @mmsc{@ref BLE_GATTC_HVI_MSC}\n @endmscs\n\n @param[in] conn_handle The connection handle identifying the connection to perform this procedure on.\n @param[in] handle The handle of the attribute in the indication.\n\n @retval ::NRF_SUCCESS Successfully queued the Handle Value Confirmation for transmission.\n @retval ::BLE_ERROR_INVALID_CONN_HANDLE Invalid Connection Handle.\n @retval ::NRF_ERROR_INVALID_STATE Invalid Connection State or no Indication pending to be confirmed.\n @retval ::BLE_ERROR_INVALID_ATTR_HANDLE Invalid attribute handle.\n @retval ::NRF_ERROR_TIMEOUT There has been a GATT procedure timeout. No new GATT procedure can be performed without reestablishing the connection."]
#[inline(always)]
pub unsafe fn sd_ble_gattc_hv_confirm(conn_handle: u16, handle: u16) -> u32 {
    let ret: u32;
    core::arch::asm!("svc 164",
        inout("r0") to_asm(conn_handle) => ret,
        inout("r1") to_asm(handle) => _,
        lateout("r2") _,
        lateout("r3") _,
        lateout("r12") _,
    );
    ret
}

#[doc = "@brief Discovers information about a range of attributes on a GATT server.\n\n @events\n @event{@ref BLE_GATTC_EVT_ATTR_INFO_DISC_RSP, Generated when information about a range of attributes has been received.}\n @endevents\n\n @param[in] conn_handle    The connection handle identifying the connection to perform this procedure on.\n @param[in] p_handle_range The range of handles to request information about.\n\n @retval ::NRF_SUCCESS Successfully started an attribute information discovery procedure.\n @retval ::BLE_ERROR_INVALID_CONN_HANDLE Invalid connection handle.\n @retval ::NRF_ERROR_INVALID_STATE Invalid connection state\n @retval ::NRF_ERROR_INVALID_ADDR  Invalid pointer supplied.\n @retval ::NRF_ERROR_BUSY Client procedure already in progress.\n @retval ::NRF_ERROR_TIMEOUT There has been a GATT procedure timeout. No new GATT procedure can be performed without reestablishing the connection."]
#[inline(always)]
pub unsafe fn sd_ble_gattc_attr_info_discover(
    conn_handle: u16,
    p_handle_range: *const ble_gattc_handle_range_t,
) -> u32 {
    let ret: u32;
    core::arch::asm!("svc 159",
        inout("r0") to_asm(conn_handle) => ret,
        inout("r1") to_asm(p_handle_range) => _,
        lateout("r2") _,
        lateout("r3") _,
        lateout("r12") _,
    );
    ret
}

#[doc = "@brief Start an ATT_MTU exchange by sending an Exchange MTU Request to the server.\n\n @details The SoftDevice sets ATT_MTU to the minimum of:\n          - The Client RX MTU value, and\n          - The Server RX MTU value from @ref BLE_GATTC_EVT_EXCHANGE_MTU_RSP.\n\n          However, the SoftDevice never sets ATT_MTU lower than @ref BLE_GATT_ATT_MTU_DEFAULT.\n\n @events\n @event{@ref BLE_GATTC_EVT_EXCHANGE_MTU_RSP}\n @endevents\n\n @mscs\n @mmsc{@ref BLE_GATTC_MTU_EXCHANGE}\n @endmscs\n\n @param[in] conn_handle    The connection handle identifying the connection to perform this procedure on.\n @param[in] client_rx_mtu  Client RX MTU size.\n                           - The minimum value is @ref BLE_GATT_ATT_MTU_DEFAULT.\n                           - The maximum value is @ref ble_gatt_conn_cfg_t::att_mtu in the connection configuration\nused for this connection.\n                           - The value must be equal to Server RX MTU size given in @ref sd_ble_gatts_exchange_mtu_reply\n                             if an ATT_MTU exchange has already been performed in the other direction.\n\n @retval ::NRF_SUCCESS Successfully sent request to the server.\n @retval ::BLE_ERROR_INVALID_CONN_HANDLE Invalid connection handle.\n @retval ::NRF_ERROR_INVALID_STATE Invalid connection state or an ATT_MTU exchange was already requested once.\n @retval ::NRF_ERROR_INVALID_PARAM Invalid Client RX MTU size supplied.\n @retval ::NRF_ERROR_BUSY Client procedure already in progress.\n @retval ::NRF_ERROR_TIMEOUT There has been a GATT procedure timeout. No new GATT procedure can be performed without reestablishing the connection."]
#[inline(always)]
pub unsafe fn sd_ble_gattc_exchange_mtu_request(conn_handle: u16, client_rx_mtu: u16) -> u32 {
    let ret: u32;
    core::arch::asm!("svc 165",
        inout("r0") to_asm(conn_handle) => ret,
        inout("r1") to_asm(client_rx_mtu) => _,
        lateout("r2") _,
        lateout("r3") _,
        lateout("r12") _,
    );
    ret
}

#[doc = "< ::sd_mbr_command"]
pub const NRF_MBR_SVCS_SD_MBR_COMMAND: NRF_MBR_SVCS = 24;
#[doc = "@brief nRF Master Boot Record API SVC numbers."]
pub type NRF_MBR_SVCS = self::c_uint;
#[doc = "< Copy a new BootLoader. @see ::sd_mbr_command_copy_bl_t"]
pub const NRF_MBR_COMMANDS_SD_MBR_COMMAND_COPY_BL: NRF_MBR_COMMANDS = 0;
#[doc = "< Copy a new SoftDevice. @see ::sd_mbr_command_copy_sd_t"]
pub const NRF_MBR_COMMANDS_SD_MBR_COMMAND_COPY_SD: NRF_MBR_COMMANDS = 1;
#[doc = "< Initialize forwarding interrupts to SD, and run reset function in SD. Does not require any parameters in ::sd_mbr_command_t params."]
pub const NRF_MBR_COMMANDS_SD_MBR_COMMAND_INIT_SD: NRF_MBR_COMMANDS = 2;
#[doc = "< This command works like memcmp. @see ::sd_mbr_command_compare_t"]
pub const NRF_MBR_COMMANDS_SD_MBR_COMMAND_COMPARE: NRF_MBR_COMMANDS = 3;
#[doc = "< Change the address the MBR starts after a reset. @see ::sd_mbr_command_vector_table_base_set_t"]
pub const NRF_MBR_COMMANDS_SD_MBR_COMMAND_VECTOR_TABLE_BASE_SET: NRF_MBR_COMMANDS = 4;
pub const NRF_MBR_COMMANDS_SD_MBR_COMMAND_RESERVED: NRF_MBR_COMMANDS = 5;
#[doc = "< Start forwarding all interrupts to this address. @see ::sd_mbr_command_irq_forward_address_set_t"]
pub const NRF_MBR_COMMANDS_SD_MBR_COMMAND_IRQ_FORWARD_ADDRESS_SET: NRF_MBR_COMMANDS = 6;
#[doc = "@brief Possible values for ::sd_mbr_command_t.command"]
pub type NRF_MBR_COMMANDS = self::c_uint;
#[doc = "@brief This command copies part of a new SoftDevice\n\n The destination area is erased before copying.\n If dst is in the middle of a flash page, that whole flash page will be erased.\n If (dst+len) is in the middle of a flash page, that whole flash page will be erased.\n\n The user of this function is responsible for setting the BPROT registers.\n\n @retval ::NRF_SUCCESS indicates that the contents of the memory blocks where copied correctly.\n @retval ::NRF_ERROR_INTERNAL indicates that the contents of the memory blocks where not verified correctly after copying."]
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct sd_mbr_command_copy_sd_t {
    #[doc = "< Pointer to the source of data to be copied."]
    pub src: *mut u32,
    #[doc = "< Pointer to the destination where the content is to be copied."]
    pub dst: *mut u32,
    #[doc = "< Number of 32 bit words to copy. Must be a multiple of @ref MBR_PAGE_SIZE_IN_WORDS words."]
    pub len: u32,
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of sd_mbr_command_copy_sd_t"][::core::mem::size_of::<sd_mbr_command_copy_sd_t>() - 12usize];
    ["Alignment of sd_mbr_command_copy_sd_t"][::core::mem::align_of::<sd_mbr_command_copy_sd_t>() - 4usize];
    ["Offset of field: sd_mbr_command_copy_sd_t::src"][::core::mem::offset_of!(sd_mbr_command_copy_sd_t, src) - 0usize];
    ["Offset of field: sd_mbr_command_copy_sd_t::dst"][::core::mem::offset_of!(sd_mbr_command_copy_sd_t, dst) - 4usize];
    ["Offset of field: sd_mbr_command_copy_sd_t::len"][::core::mem::offset_of!(sd_mbr_command_copy_sd_t, len) - 8usize];
};
#[doc = "@brief This command works like memcmp, but takes the length in words.\n\n @retval ::NRF_SUCCESS indicates that the contents of both memory blocks are equal.\n @retval ::NRF_ERROR_NULL indicates that the contents of the memory blocks are not equal."]
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct sd_mbr_command_compare_t {
    #[doc = "< Pointer to block of memory."]
    pub ptr1: *mut u32,
    #[doc = "< Pointer to block of memory."]
    pub ptr2: *mut u32,
    #[doc = "< Number of 32 bit words to compare."]
    pub len: u32,
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of sd_mbr_command_compare_t"][::core::mem::size_of::<sd_mbr_command_compare_t>() - 12usize];
    ["Alignment of sd_mbr_command_compare_t"][::core::mem::align_of::<sd_mbr_command_compare_t>() - 4usize];
    ["Offset of field: sd_mbr_command_compare_t::ptr1"]
        [::core::mem::offset_of!(sd_mbr_command_compare_t, ptr1) - 0usize];
    ["Offset of field: sd_mbr_command_compare_t::ptr2"]
        [::core::mem::offset_of!(sd_mbr_command_compare_t, ptr2) - 4usize];
    ["Offset of field: sd_mbr_command_compare_t::len"][::core::mem::offset_of!(sd_mbr_command_compare_t, len) - 8usize];
};
#[doc = "@brief This command copies a new BootLoader.\n\n The MBR assumes that either @ref MBR_BOOTLOADER_ADDR or @ref MBR_UICR_BOOTLOADER_ADDR is set to\n the address where the bootloader will be copied. If both addresses are set, the MBR will prioritize\n @ref MBR_BOOTLOADER_ADDR.\n\n The bootloader destination is erased by this function.\n If (destination+bl_len) is in the middle of a flash page, that whole flash page will be erased.\n\n This command requires that @ref MBR_PARAM_PAGE_ADDR or @ref MBR_UICR_PARAM_PAGE_ADDR is set,\n see @ref sd_mbr_command.\n\n This command will use the flash protect peripheral (BPROT or ACL) to protect the flash that is\n not intended to be written.\n\n On success, this function will not return. It will start the new bootloader from reset-vector as normal.\n\n @retval ::NRF_ERROR_INTERNAL indicates an internal error that should not happen.\n @retval ::NRF_ERROR_FORBIDDEN if the bootloader address is not set.\n @retval ::NRF_ERROR_INVALID_LENGTH if parameters attempts to read or write outside flash area.\n @retval ::NRF_ERROR_NO_MEM No MBR parameter page is provided. See @ref sd_mbr_command."]
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct sd_mbr_command_copy_bl_t {
    #[doc = "< Pointer to the source of the bootloader to be be copied."]
    pub bl_src: *mut u32,
    #[doc = "< Number of 32 bit words to copy for BootLoader."]
    pub bl_len: u32,
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of sd_mbr_command_copy_bl_t"][::core::mem::size_of::<sd_mbr_command_copy_bl_t>() - 8usize];
    ["Alignment of sd_mbr_command_copy_bl_t"][::core::mem::align_of::<sd_mbr_command_copy_bl_t>() - 4usize];
    ["Offset of field: sd_mbr_command_copy_bl_t::bl_src"]
        [::core::mem::offset_of!(sd_mbr_command_copy_bl_t, bl_src) - 0usize];
    ["Offset of field: sd_mbr_command_copy_bl_t::bl_len"]
        [::core::mem::offset_of!(sd_mbr_command_copy_bl_t, bl_len) - 4usize];
};
#[doc = "@brief Change the address the MBR starts after a reset\n\n Once this function has been called, this address is where the MBR will start to forward\n interrupts to after a reset.\n\n To restore default forwarding, this function should be called with @ref address set to 0. If a\n bootloader is present, interrupts will be forwarded to the bootloader. If not, interrupts will\n be forwarded to the SoftDevice.\n\n The location of a bootloader can be specified in @ref MBR_BOOTLOADER_ADDR or\n @ref MBR_UICR_BOOTLOADER_ADDR. If both addresses are set, the MBR will prioritize\n @ref MBR_BOOTLOADER_ADDR.\n\n This command requires that @ref MBR_PARAM_PAGE_ADDR or @ref MBR_UICR_PARAM_PAGE_ADDR is set,\n see @ref sd_mbr_command.\n\n On success, this function will not return. It will reset the device.\n\n @retval ::NRF_ERROR_INTERNAL indicates an internal error that should not happen.\n @retval ::NRF_ERROR_INVALID_ADDR if parameter address is outside of the flash size.\n @retval ::NRF_ERROR_NO_MEM No MBR parameter page is provided. See @ref sd_mbr_command."]
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct sd_mbr_command_vector_table_base_set_t {
    #[doc = "< The base address of the interrupt vector table for forwarded interrupts."]
    pub address: u32,
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of sd_mbr_command_vector_table_base_set_t"]
        [::core::mem::size_of::<sd_mbr_command_vector_table_base_set_t>() - 4usize];
    ["Alignment of sd_mbr_command_vector_table_base_set_t"]
        [::core::mem::align_of::<sd_mbr_command_vector_table_base_set_t>() - 4usize];
    ["Offset of field: sd_mbr_command_vector_table_base_set_t::address"]
        [::core::mem::offset_of!(sd_mbr_command_vector_table_base_set_t, address) - 0usize];
};
#[doc = "@brief Sets the base address of the interrupt vector table for interrupts forwarded from the MBR\n\n Unlike sd_mbr_command_vector_table_base_set_t, this function does not reset, and it does not\n change where the MBR starts after reset.\n\n @retval ::NRF_SUCCESS"]
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct sd_mbr_command_irq_forward_address_set_t {
    #[doc = "< The base address of the interrupt vector table for forwarded interrupts."]
    pub address: u32,
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of sd_mbr_command_irq_forward_address_set_t"]
        [::core::mem::size_of::<sd_mbr_command_irq_forward_address_set_t>() - 4usize];
    ["Alignment of sd_mbr_command_irq_forward_address_set_t"]
        [::core::mem::align_of::<sd_mbr_command_irq_forward_address_set_t>() - 4usize];
    ["Offset of field: sd_mbr_command_irq_forward_address_set_t::address"]
        [::core::mem::offset_of!(sd_mbr_command_irq_forward_address_set_t, address) - 0usize];
};
#[doc = "@brief Input structure containing data used when calling ::sd_mbr_command\n\n Depending on what command value that is set, the corresponding params value type must also be\n set. See @ref NRF_MBR_COMMANDS for command types and corresponding params value type. If command\n @ref SD_MBR_COMMAND_INIT_SD is set, it is not necessary to set any values under params."]
#[repr(C)]
#[derive(Copy, Clone)]
pub struct sd_mbr_command_t {
    #[doc = "< Type of command to be issued. See @ref NRF_MBR_COMMANDS."]
    pub command: u32,
    #[doc = "< Command parameters."]
    pub params: sd_mbr_command_t__bindgen_ty_1,
}
#[repr(C)]
#[derive(Copy, Clone)]
pub union sd_mbr_command_t__bindgen_ty_1 {
    #[doc = "< Parameters for copy SoftDevice."]
    pub copy_sd: sd_mbr_command_copy_sd_t,
    #[doc = "< Parameters for verify."]
    pub compare: sd_mbr_command_compare_t,
    #[doc = "< Parameters for copy BootLoader. Requires parameter page."]
    pub copy_bl: sd_mbr_command_copy_bl_t,
    #[doc = "< Parameters for vector table base set. Requires parameter page."]
    pub base_set: sd_mbr_command_vector_table_base_set_t,
    #[doc = "< Parameters for irq forward address set"]
    pub irq_forward_address_set: sd_mbr_command_irq_forward_address_set_t,
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of sd_mbr_command_t__bindgen_ty_1"][::core::mem::size_of::<sd_mbr_command_t__bindgen_ty_1>() - 12usize];
    ["Alignment of sd_mbr_command_t__bindgen_ty_1"][::core::mem::align_of::<sd_mbr_command_t__bindgen_ty_1>() - 4usize];
    ["Offset of field: sd_mbr_command_t__bindgen_ty_1::copy_sd"]
        [::core::mem::offset_of!(sd_mbr_command_t__bindgen_ty_1, copy_sd) - 0usize];
    ["Offset of field: sd_mbr_command_t__bindgen_ty_1::compare"]
        [::core::mem::offset_of!(sd_mbr_command_t__bindgen_ty_1, compare) - 0usize];
    ["Offset of field: sd_mbr_command_t__bindgen_ty_1::copy_bl"]
        [::core::mem::offset_of!(sd_mbr_command_t__bindgen_ty_1, copy_bl) - 0usize];
    ["Offset of field: sd_mbr_command_t__bindgen_ty_1::base_set"]
        [::core::mem::offset_of!(sd_mbr_command_t__bindgen_ty_1, base_set) - 0usize];
    ["Offset of field: sd_mbr_command_t__bindgen_ty_1::irq_forward_address_set"]
        [::core::mem::offset_of!(sd_mbr_command_t__bindgen_ty_1, irq_forward_address_set) - 0usize];
};
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of sd_mbr_command_t"][::core::mem::size_of::<sd_mbr_command_t>() - 16usize];
    ["Alignment of sd_mbr_command_t"][::core::mem::align_of::<sd_mbr_command_t>() - 4usize];
    ["Offset of field: sd_mbr_command_t::command"][::core::mem::offset_of!(sd_mbr_command_t, command) - 0usize];
    ["Offset of field: sd_mbr_command_t::params"][::core::mem::offset_of!(sd_mbr_command_t, params) - 4usize];
};

#[doc = "@brief Issue Master Boot Record commands\n\n Commands used when updating a SoftDevice and bootloader.\n\n The @ref SD_MBR_COMMAND_COPY_BL and @ref SD_MBR_COMMAND_VECTOR_TABLE_BASE_SET requires\n parameters to be retained by the MBR when resetting the IC. This is done in a separate flash\n page. The location of the flash page should be provided by the application in either\n @ref MBR_PARAM_PAGE_ADDR or @ref MBR_UICR_PARAM_PAGE_ADDR. If both addresses are set, the MBR\n will prioritize @ref MBR_PARAM_PAGE_ADDR. This page will be cleared by the MBR and is used to\n store the command before reset. When an address is specified, the page it refers to must not be\n used by the application. If no address is provided by the application, i.e. both\n @ref MBR_PARAM_PAGE_ADDR and @ref MBR_UICR_PARAM_PAGE_ADDR is 0xFFFFFFFF, MBR commands which use\n flash will be unavailable and return @ref NRF_ERROR_NO_MEM.\n\n @param[in]  param Pointer to a struct describing the command.\n\n @note For a complete set of return values, see ::sd_mbr_command_copy_sd_t,\n       ::sd_mbr_command_copy_bl_t, ::sd_mbr_command_compare_t,\n       ::sd_mbr_command_vector_table_base_set_t, ::sd_mbr_command_irq_forward_address_set_t\n\n @retval ::NRF_ERROR_NO_MEM No MBR parameter page provided\n @retval ::NRF_ERROR_INVALID_PARAM if an invalid command is given."]
#[inline(always)]
pub unsafe fn sd_mbr_command(param: *mut sd_mbr_command_t) -> u32 {
    let ret: u32;
    core::arch::asm!("svc 24",
        inout("r0") to_asm(param) => ret,
        lateout("r1") _,
        lateout("r2") _,
        lateout("r3") _,
        lateout("r12") _,
    );
    ret
}

#[doc = "< Set own Bluetooth Address."]
pub const BLE_GAP_SVCS_SD_BLE_GAP_ADDR_SET: BLE_GAP_SVCS = 108;
#[doc = "< Get own Bluetooth Address."]
pub const BLE_GAP_SVCS_SD_BLE_GAP_ADDR_GET: BLE_GAP_SVCS = 109;
#[doc = "< Set active whitelist."]
pub const BLE_GAP_SVCS_SD_BLE_GAP_WHITELIST_SET: BLE_GAP_SVCS = 110;
#[doc = "< Set device identity list."]
pub const BLE_GAP_SVCS_SD_BLE_GAP_DEVICE_IDENTITIES_SET: BLE_GAP_SVCS = 111;
#[doc = "< Set Privacy settings"]
pub const BLE_GAP_SVCS_SD_BLE_GAP_PRIVACY_SET: BLE_GAP_SVCS = 112;
#[doc = "< Get Privacy settings"]
pub const BLE_GAP_SVCS_SD_BLE_GAP_PRIVACY_GET: BLE_GAP_SVCS = 113;
#[doc = "< Configure an advertising set."]
pub const BLE_GAP_SVCS_SD_BLE_GAP_ADV_SET_CONFIGURE: BLE_GAP_SVCS = 114;
#[doc = "< Start Advertising."]
pub const BLE_GAP_SVCS_SD_BLE_GAP_ADV_START: BLE_GAP_SVCS = 115;
#[doc = "< Stop Advertising."]
pub const BLE_GAP_SVCS_SD_BLE_GAP_ADV_STOP: BLE_GAP_SVCS = 116;
#[doc = "< Connection Parameter Update."]
pub const BLE_GAP_SVCS_SD_BLE_GAP_CONN_PARAM_UPDATE: BLE_GAP_SVCS = 117;
#[doc = "< Disconnect."]
pub const BLE_GAP_SVCS_SD_BLE_GAP_DISCONNECT: BLE_GAP_SVCS = 118;
#[doc = "< Set TX Power."]
pub const BLE_GAP_SVCS_SD_BLE_GAP_TX_POWER_SET: BLE_GAP_SVCS = 119;
#[doc = "< Set Appearance."]
pub const BLE_GAP_SVCS_SD_BLE_GAP_APPEARANCE_SET: BLE_GAP_SVCS = 120;
#[doc = "< Get Appearance."]
pub const BLE_GAP_SVCS_SD_BLE_GAP_APPEARANCE_GET: BLE_GAP_SVCS = 121;
#[doc = "< Set PPCP."]
pub const BLE_GAP_SVCS_SD_BLE_GAP_PPCP_SET: BLE_GAP_SVCS = 122;
#[doc = "< Get PPCP."]
pub const BLE_GAP_SVCS_SD_BLE_GAP_PPCP_GET: BLE_GAP_SVCS = 123;
#[doc = "< Set Device Name."]
pub const BLE_GAP_SVCS_SD_BLE_GAP_DEVICE_NAME_SET: BLE_GAP_SVCS = 124;
#[doc = "< Get Device Name."]
pub const BLE_GAP_SVCS_SD_BLE_GAP_DEVICE_NAME_GET: BLE_GAP_SVCS = 125;
#[doc = "< Initiate Pairing/Bonding."]
pub const BLE_GAP_SVCS_SD_BLE_GAP_AUTHENTICATE: BLE_GAP_SVCS = 126;
#[doc = "< Reply with Security Parameters."]
pub const BLE_GAP_SVCS_SD_BLE_GAP_SEC_PARAMS_REPLY: BLE_GAP_SVCS = 127;
#[doc = "< Reply with an authentication key."]
pub const BLE_GAP_SVCS_SD_BLE_GAP_AUTH_KEY_REPLY: BLE_GAP_SVCS = 128;
#[doc = "< Reply with an LE Secure Connections DHKey."]
pub const BLE_GAP_SVCS_SD_BLE_GAP_LESC_DHKEY_REPLY: BLE_GAP_SVCS = 129;
#[doc = "< Notify of a keypress during an authentication procedure."]
pub const BLE_GAP_SVCS_SD_BLE_GAP_KEYPRESS_NOTIFY: BLE_GAP_SVCS = 130;
#[doc = "< Get the local LE Secure Connections OOB data."]
pub const BLE_GAP_SVCS_SD_BLE_GAP_LESC_OOB_DATA_GET: BLE_GAP_SVCS = 131;
#[doc = "< Set the remote LE Secure Connections OOB data."]
pub const BLE_GAP_SVCS_SD_BLE_GAP_LESC_OOB_DATA_SET: BLE_GAP_SVCS = 132;
#[doc = "< Initiate encryption procedure."]
pub const BLE_GAP_SVCS_SD_BLE_GAP_ENCRYPT: BLE_GAP_SVCS = 133;
#[doc = "< Reply with Security Information."]
pub const BLE_GAP_SVCS_SD_BLE_GAP_SEC_INFO_REPLY: BLE_GAP_SVCS = 134;
#[doc = "< Obtain connection security level."]
pub const BLE_GAP_SVCS_SD_BLE_GAP_CONN_SEC_GET: BLE_GAP_SVCS = 135;
#[doc = "< Start reporting of changes in RSSI."]
pub const BLE_GAP_SVCS_SD_BLE_GAP_RSSI_START: BLE_GAP_SVCS = 136;
#[doc = "< Stop reporting of changes in RSSI."]
pub const BLE_GAP_SVCS_SD_BLE_GAP_RSSI_STOP: BLE_GAP_SVCS = 137;
#[doc = "< Start Scanning."]
pub const BLE_GAP_SVCS_SD_BLE_GAP_SCAN_START: BLE_GAP_SVCS = 138;
#[doc = "< Stop Scanning."]
pub const BLE_GAP_SVCS_SD_BLE_GAP_SCAN_STOP: BLE_GAP_SVCS = 139;
#[doc = "< Connect."]
pub const BLE_GAP_SVCS_SD_BLE_GAP_CONNECT: BLE_GAP_SVCS = 140;
#[doc = "< Cancel ongoing connection procedure."]
pub const BLE_GAP_SVCS_SD_BLE_GAP_CONNECT_CANCEL: BLE_GAP_SVCS = 141;
#[doc = "< Get the last RSSI sample."]
pub const BLE_GAP_SVCS_SD_BLE_GAP_RSSI_GET: BLE_GAP_SVCS = 142;
#[doc = "< Initiate or respond to a PHY Update Procedure."]
pub const BLE_GAP_SVCS_SD_BLE_GAP_PHY_UPDATE: BLE_GAP_SVCS = 143;
#[doc = "< Initiate or respond to a Data Length Update Procedure."]
pub const BLE_GAP_SVCS_SD_BLE_GAP_DATA_LENGTH_UPDATE: BLE_GAP_SVCS = 144;
#[doc = "< Start Quality of Service (QoS) channel survey module."]
pub const BLE_GAP_SVCS_SD_BLE_GAP_QOS_CHANNEL_SURVEY_START: BLE_GAP_SVCS = 145;
#[doc = "< Stop Quality of Service (QoS) channel survey module."]
pub const BLE_GAP_SVCS_SD_BLE_GAP_QOS_CHANNEL_SURVEY_STOP: BLE_GAP_SVCS = 146;
#[doc = "< Get the Address used on air while Advertising."]
pub const BLE_GAP_SVCS_SD_BLE_GAP_ADV_ADDR_GET: BLE_GAP_SVCS = 147;
#[doc = "< Get the next connection event counter."]
pub const BLE_GAP_SVCS_SD_BLE_GAP_NEXT_CONN_EVT_COUNTER_GET: BLE_GAP_SVCS = 148;
pub const BLE_GAP_SVCS_SD_BLE_GAP_CONN_EVT_TRIGGER_START: BLE_GAP_SVCS = 149;
#[doc = " Start triggering a given task on connection event start."]
pub const BLE_GAP_SVCS_SD_BLE_GAP_CONN_EVT_TRIGGER_STOP: BLE_GAP_SVCS = 150;
#[doc = "@brief GAP API SVC numbers."]
pub type BLE_GAP_SVCS = self::c_uint;
#[doc = "< Connected to peer.                              \\n See @ref ble_gap_evt_connected_t"]
pub const BLE_GAP_EVTS_BLE_GAP_EVT_CONNECTED: BLE_GAP_EVTS = 16;
#[doc = "< Disconnected from peer.                         \\n See @ref ble_gap_evt_disconnected_t."]
pub const BLE_GAP_EVTS_BLE_GAP_EVT_DISCONNECTED: BLE_GAP_EVTS = 17;
#[doc = "< Connection Parameters updated.                  \\n See @ref ble_gap_evt_conn_param_update_t."]
pub const BLE_GAP_EVTS_BLE_GAP_EVT_CONN_PARAM_UPDATE: BLE_GAP_EVTS = 18;
#[doc = "< Request to provide security parameters.         \\n Reply with @ref sd_ble_gap_sec_params_reply.  \\n See @ref ble_gap_evt_sec_params_request_t."]
pub const BLE_GAP_EVTS_BLE_GAP_EVT_SEC_PARAMS_REQUEST: BLE_GAP_EVTS = 19;
#[doc = "< Request to provide security information.        \\n Reply with @ref sd_ble_gap_sec_info_reply.    \\n See @ref ble_gap_evt_sec_info_request_t."]
pub const BLE_GAP_EVTS_BLE_GAP_EVT_SEC_INFO_REQUEST: BLE_GAP_EVTS = 20;
#[doc = "< Request to display a passkey to the user.       \\n In LESC Numeric Comparison, reply with @ref sd_ble_gap_auth_key_reply. \\n See @ref ble_gap_evt_passkey_display_t."]
pub const BLE_GAP_EVTS_BLE_GAP_EVT_PASSKEY_DISPLAY: BLE_GAP_EVTS = 21;
#[doc = "< Notification of a keypress on the remote device.\\n See @ref ble_gap_evt_key_pressed_t"]
pub const BLE_GAP_EVTS_BLE_GAP_EVT_KEY_PRESSED: BLE_GAP_EVTS = 22;
#[doc = "< Request to provide an authentication key.       \\n Reply with @ref sd_ble_gap_auth_key_reply.    \\n See @ref ble_gap_evt_auth_key_request_t."]
pub const BLE_GAP_EVTS_BLE_GAP_EVT_AUTH_KEY_REQUEST: BLE_GAP_EVTS = 23;
#[doc = "< Request to calculate an LE Secure Connections DHKey. \\n Reply with @ref sd_ble_gap_lesc_dhkey_reply.  \\n See @ref ble_gap_evt_lesc_dhkey_request_t"]
pub const BLE_GAP_EVTS_BLE_GAP_EVT_LESC_DHKEY_REQUEST: BLE_GAP_EVTS = 24;
#[doc = "< Authentication procedure completed with status. \\n See @ref ble_gap_evt_auth_status_t."]
pub const BLE_GAP_EVTS_BLE_GAP_EVT_AUTH_STATUS: BLE_GAP_EVTS = 25;
#[doc = "< Connection security updated.                    \\n See @ref ble_gap_evt_conn_sec_update_t."]
pub const BLE_GAP_EVTS_BLE_GAP_EVT_CONN_SEC_UPDATE: BLE_GAP_EVTS = 26;
#[doc = "< Timeout expired.                                \\n See @ref ble_gap_evt_timeout_t."]
pub const BLE_GAP_EVTS_BLE_GAP_EVT_TIMEOUT: BLE_GAP_EVTS = 27;
#[doc = "< RSSI report.                                    \\n See @ref ble_gap_evt_rssi_changed_t."]
pub const BLE_GAP_EVTS_BLE_GAP_EVT_RSSI_CHANGED: BLE_GAP_EVTS = 28;
#[doc = "< Advertising report.                             \\n See @ref ble_gap_evt_adv_report_t."]
pub const BLE_GAP_EVTS_BLE_GAP_EVT_ADV_REPORT: BLE_GAP_EVTS = 29;
#[doc = "< Security Request.                               \\n See @ref ble_gap_evt_sec_request_t."]
pub const BLE_GAP_EVTS_BLE_GAP_EVT_SEC_REQUEST: BLE_GAP_EVTS = 30;
#[doc = "< Connection Parameter Update Request.            \\n Reply with @ref sd_ble_gap_conn_param_update. \\n See @ref ble_gap_evt_conn_param_update_request_t."]
pub const BLE_GAP_EVTS_BLE_GAP_EVT_CONN_PARAM_UPDATE_REQUEST: BLE_GAP_EVTS = 31;
#[doc = "< Scan request report.                            \\n See @ref ble_gap_evt_scan_req_report_t."]
pub const BLE_GAP_EVTS_BLE_GAP_EVT_SCAN_REQ_REPORT: BLE_GAP_EVTS = 32;
#[doc = "< PHY Update Request.                             \\n Reply with @ref sd_ble_gap_phy_update. \\n See @ref ble_gap_evt_phy_update_request_t."]
pub const BLE_GAP_EVTS_BLE_GAP_EVT_PHY_UPDATE_REQUEST: BLE_GAP_EVTS = 33;
#[doc = "< PHY Update Procedure is complete.               \\n See @ref ble_gap_evt_phy_update_t."]
pub const BLE_GAP_EVTS_BLE_GAP_EVT_PHY_UPDATE: BLE_GAP_EVTS = 34;
#[doc = "< Data Length Update Request.                     \\n Reply with @ref sd_ble_gap_data_length_update. \\n See @ref ble_gap_evt_data_length_update_request_t."]
pub const BLE_GAP_EVTS_BLE_GAP_EVT_DATA_LENGTH_UPDATE_REQUEST: BLE_GAP_EVTS = 35;
#[doc = "< LL Data Channel PDU payload length updated.     \\n See @ref ble_gap_evt_data_length_update_t."]
pub const BLE_GAP_EVTS_BLE_GAP_EVT_DATA_LENGTH_UPDATE: BLE_GAP_EVTS = 36;
#[doc = "< Channel survey report.                          \\n See @ref ble_gap_evt_qos_channel_survey_report_t."]
pub const BLE_GAP_EVTS_BLE_GAP_EVT_QOS_CHANNEL_SURVEY_REPORT: BLE_GAP_EVTS = 37;
#[doc = "< Advertising set terminated.                     \\n See @ref ble_gap_evt_adv_set_terminated_t."]
pub const BLE_GAP_EVTS_BLE_GAP_EVT_ADV_SET_TERMINATED: BLE_GAP_EVTS = 38;
#[doc = "@brief GAP Event IDs.\n IDs that uniquely identify an event coming from the stack to the application."]
pub type BLE_GAP_EVTS = self::c_uint;
#[doc = "< Channel Map. @ref ble_gap_opt_ch_map_t"]
pub const BLE_GAP_OPTS_BLE_GAP_OPT_CH_MAP: BLE_GAP_OPTS = 32;
#[doc = "< Local connection latency. @ref ble_gap_opt_local_conn_latency_t"]
pub const BLE_GAP_OPTS_BLE_GAP_OPT_LOCAL_CONN_LATENCY: BLE_GAP_OPTS = 33;
#[doc = "< Set passkey. @ref ble_gap_opt_passkey_t"]
pub const BLE_GAP_OPTS_BLE_GAP_OPT_PASSKEY: BLE_GAP_OPTS = 34;
#[doc = "< Compatibility mode. @ref ble_gap_opt_compat_mode_1_t"]
pub const BLE_GAP_OPTS_BLE_GAP_OPT_COMPAT_MODE_1: BLE_GAP_OPTS = 35;
#[doc = "< Set Authenticated payload timeout. @ref ble_gap_opt_auth_payload_timeout_t"]
pub const BLE_GAP_OPTS_BLE_GAP_OPT_AUTH_PAYLOAD_TIMEOUT: BLE_GAP_OPTS = 36;
#[doc = "< Disable slave latency. @ref ble_gap_opt_slave_latency_disable_t"]
pub const BLE_GAP_OPTS_BLE_GAP_OPT_SLAVE_LATENCY_DISABLE: BLE_GAP_OPTS = 37;
#[doc = "@brief GAP Option IDs.\n IDs that uniquely identify a GAP option."]
pub type BLE_GAP_OPTS = self::c_uint;
#[doc = "< Role count configuration."]
pub const BLE_GAP_CFGS_BLE_GAP_CFG_ROLE_COUNT: BLE_GAP_CFGS = 64;
#[doc = "< Device name configuration."]
pub const BLE_GAP_CFGS_BLE_GAP_CFG_DEVICE_NAME: BLE_GAP_CFGS = 65;
#[doc = "< Peripheral Preferred Connection Parameters characteristic\ninclusion configuration."]
pub const BLE_GAP_CFGS_BLE_GAP_CFG_PPCP_INCL_CONFIG: BLE_GAP_CFGS = 66;
#[doc = "< Central Address Resolution characteristic\ninclusion configuration."]
pub const BLE_GAP_CFGS_BLE_GAP_CFG_CAR_INCL_CONFIG: BLE_GAP_CFGS = 67;
#[doc = "@brief GAP Configuration IDs.\n\n IDs that uniquely identify a GAP configuration."]
pub type BLE_GAP_CFGS = self::c_uint;
#[doc = "< Advertiser role."]
pub const BLE_GAP_TX_POWER_ROLES_BLE_GAP_TX_POWER_ROLE_ADV: BLE_GAP_TX_POWER_ROLES = 1;
#[doc = "< Scanner and initiator role."]
pub const BLE_GAP_TX_POWER_ROLES_BLE_GAP_TX_POWER_ROLE_SCAN_INIT: BLE_GAP_TX_POWER_ROLES = 2;
#[doc = "< Connection role."]
pub const BLE_GAP_TX_POWER_ROLES_BLE_GAP_TX_POWER_ROLE_CONN: BLE_GAP_TX_POWER_ROLES = 3;
#[doc = "@brief GAP TX Power roles."]
pub type BLE_GAP_TX_POWER_ROLES = self::c_uint;
#[doc = "@brief Advertising event properties."]
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct ble_gap_adv_properties_t {
    #[doc = "< Advertising type. See @ref BLE_GAP_ADV_TYPES."]
    pub type_: u8,
    pub _bitfield_align_1: [u8; 0],
    pub _bitfield_1: __BindgenBitfieldUnit<[u8; 1usize]>,
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of ble_gap_adv_properties_t"][::core::mem::size_of::<ble_gap_adv_properties_t>() - 2usize];
    ["Alignment of ble_gap_adv_properties_t"][::core::mem::align_of::<ble_gap_adv_properties_t>() - 1usize];
    ["Offset of field: ble_gap_adv_properties_t::type_"]
        [::core::mem::offset_of!(ble_gap_adv_properties_t, type_) - 0usize];
};
impl ble_gap_adv_properties_t {
    #[inline]
    pub fn anonymous(&self) -> u8 {
        unsafe { ::core::mem::transmute(self._bitfield_1.get(0usize, 1u8) as u8) }
    }
    #[inline]
    pub fn set_anonymous(&mut self, val: u8) {
        unsafe {
            let val: u8 = ::core::mem::transmute(val);
            self._bitfield_1.set(0usize, 1u8, val as u64)
        }
    }
    #[inline]
    pub unsafe fn anonymous_raw(this: *const Self) -> u8 {
        unsafe {
            ::core::mem::transmute(<__BindgenBitfieldUnit<[u8; 1usize]>>::raw_get(
                ::core::ptr::addr_of!((*this)._bitfield_1),
                0usize,
                1u8,
            ) as u8)
        }
    }
    #[inline]
    pub unsafe fn set_anonymous_raw(this: *mut Self, val: u8) {
        unsafe {
            let val: u8 = ::core::mem::transmute(val);
            <__BindgenBitfieldUnit<[u8; 1usize]>>::raw_set(
                ::core::ptr::addr_of_mut!((*this)._bitfield_1),
                0usize,
                1u8,
                val as u64,
            )
        }
    }
    #[inline]
    pub fn include_tx_power(&self) -> u8 {
        unsafe { ::core::mem::transmute(self._bitfield_1.get(1usize, 1u8) as u8) }
    }
    #[inline]
    pub fn set_include_tx_power(&mut self, val: u8) {
        unsafe {
            let val: u8 = ::core::mem::transmute(val);
            self._bitfield_1.set(1usize, 1u8, val as u64)
        }
    }
    #[inline]
    pub unsafe fn include_tx_power_raw(this: *const Self) -> u8 {
        unsafe {
            ::core::mem::transmute(<__BindgenBitfieldUnit<[u8; 1usize]>>::raw_get(
                ::core::ptr::addr_of!((*this)._bitfield_1),
                1usize,
                1u8,
            ) as u8)
        }
    }
    #[inline]
    pub unsafe fn set_include_tx_power_raw(this: *mut Self, val: u8) {
        unsafe {
            let val: u8 = ::core::mem::transmute(val);
            <__BindgenBitfieldUnit<[u8; 1usize]>>::raw_set(
                ::core::ptr::addr_of_mut!((*this)._bitfield_1),
                1usize,
                1u8,
                val as u64,
            )
        }
    }
    #[inline]
    pub fn new_bitfield_1(anonymous: u8, include_tx_power: u8) -> __BindgenBitfieldUnit<[u8; 1usize]> {
        let mut __bindgen_bitfield_unit: __BindgenBitfieldUnit<[u8; 1usize]> = Default::default();
        __bindgen_bitfield_unit.set(0usize, 1u8, {
            let anonymous: u8 = unsafe { ::core::mem::transmute(anonymous) };
            anonymous as u64
        });
        __bindgen_bitfield_unit.set(1usize, 1u8, {
            let include_tx_power: u8 = unsafe { ::core::mem::transmute(include_tx_power) };
            include_tx_power as u64
        });
        __bindgen_bitfield_unit
    }
}
#[doc = "@brief Advertising report type."]
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct ble_gap_adv_report_type_t {
    pub _bitfield_align_1: [u16; 0],
    pub _bitfield_1: __BindgenBitfieldUnit<[u8; 2usize]>,
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of ble_gap_adv_report_type_t"][::core::mem::size_of::<ble_gap_adv_report_type_t>() - 2usize];
    ["Alignment of ble_gap_adv_report_type_t"][::core::mem::align_of::<ble_gap_adv_report_type_t>() - 2usize];
};
impl ble_gap_adv_report_type_t {
    #[inline]
    pub fn connectable(&self) -> u16 {
        unsafe { ::core::mem::transmute(self._bitfield_1.get(0usize, 1u8) as u16) }
    }
    #[inline]
    pub fn set_connectable(&mut self, val: u16) {
        unsafe {
            let val: u16 = ::core::mem::transmute(val);
            self._bitfield_1.set(0usize, 1u8, val as u64)
        }
    }
    #[inline]
    pub unsafe fn connectable_raw(this: *const Self) -> u16 {
        unsafe {
            ::core::mem::transmute(<__BindgenBitfieldUnit<[u8; 2usize]>>::raw_get(
                ::core::ptr::addr_of!((*this)._bitfield_1),
                0usize,
                1u8,
            ) as u16)
        }
    }
    #[inline]
    pub unsafe fn set_connectable_raw(this: *mut Self, val: u16) {
        unsafe {
            let val: u16 = ::core::mem::transmute(val);
            <__BindgenBitfieldUnit<[u8; 2usize]>>::raw_set(
                ::core::ptr::addr_of_mut!((*this)._bitfield_1),
                0usize,
                1u8,
                val as u64,
            )
        }
    }
    #[inline]
    pub fn scannable(&self) -> u16 {
        unsafe { ::core::mem::transmute(self._bitfield_1.get(1usize, 1u8) as u16) }
    }
    #[inline]
    pub fn set_scannable(&mut self, val: u16) {
        unsafe {
            let val: u16 = ::core::mem::transmute(val);
            self._bitfield_1.set(1usize, 1u8, val as u64)
        }
    }
    #[inline]
    pub unsafe fn scannable_raw(this: *const Self) -> u16 {
        unsafe {
            ::core::mem::transmute(<__BindgenBitfieldUnit<[u8; 2usize]>>::raw_get(
                ::core::ptr::addr_of!((*this)._bitfield_1),
                1usize,
                1u8,
            ) as u16)
        }
    }
    #[inline]
    pub unsafe fn set_scannable_raw(this: *mut Self, val: u16) {
        unsafe {
            let val: u16 = ::core::mem::transmute(val);
            <__BindgenBitfieldUnit<[u8; 2usize]>>::raw_set(
                ::core::ptr::addr_of_mut!((*this)._bitfield_1),
                1usize,
                1u8,
                val as u64,
            )
        }
    }
    #[inline]
    pub fn directed(&self) -> u16 {
        unsafe { ::core::mem::transmute(self._bitfield_1.get(2usize, 1u8) as u16) }
    }
    #[inline]
    pub fn set_directed(&mut self, val: u16) {
        unsafe {
            let val: u16 = ::core::mem::transmute(val);
            self._bitfield_1.set(2usize, 1u8, val as u64)
        }
    }
    #[inline]
    pub unsafe fn directed_raw(this: *const Self) -> u16 {
        unsafe {
            ::core::mem::transmute(<__BindgenBitfieldUnit<[u8; 2usize]>>::raw_get(
                ::core::ptr::addr_of!((*this)._bitfield_1),
                2usize,
                1u8,
            ) as u16)
        }
    }
    #[inline]
    pub unsafe fn set_directed_raw(this: *mut Self, val: u16) {
        unsafe {
            let val: u16 = ::core::mem::transmute(val);
            <__BindgenBitfieldUnit<[u8; 2usize]>>::raw_set(
                ::core::ptr::addr_of_mut!((*this)._bitfield_1),
                2usize,
                1u8,
                val as u64,
            )
        }
    }
    #[inline]
    pub fn scan_response(&self) -> u16 {
        unsafe { ::core::mem::transmute(self._bitfield_1.get(3usize, 1u8) as u16) }
    }
    #[inline]
    pub fn set_scan_response(&mut self, val: u16) {
        unsafe {
            let val: u16 = ::core::mem::transmute(val);
            self._bitfield_1.set(3usize, 1u8, val as u64)
        }
    }
    #[inline]
    pub unsafe fn scan_response_raw(this: *const Self) -> u16 {
        unsafe {
            ::core::mem::transmute(<__BindgenBitfieldUnit<[u8; 2usize]>>::raw_get(
                ::core::ptr::addr_of!((*this)._bitfield_1),
                3usize,
                1u8,
            ) as u16)
        }
    }
    #[inline]
    pub unsafe fn set_scan_response_raw(this: *mut Self, val: u16) {
        unsafe {
            let val: u16 = ::core::mem::transmute(val);
            <__BindgenBitfieldUnit<[u8; 2usize]>>::raw_set(
                ::core::ptr::addr_of_mut!((*this)._bitfield_1),
                3usize,
                1u8,
                val as u64,
            )
        }
    }
    #[inline]
    pub fn extended_pdu(&self) -> u16 {
        unsafe { ::core::mem::transmute(self._bitfield_1.get(4usize, 1u8) as u16) }
    }
    #[inline]
    pub fn set_extended_pdu(&mut self, val: u16) {
        unsafe {
            let val: u16 = ::core::mem::transmute(val);
            self._bitfield_1.set(4usize, 1u8, val as u64)
        }
    }
    #[inline]
    pub unsafe fn extended_pdu_raw(this: *const Self) -> u16 {
        unsafe {
            ::core::mem::transmute(<__BindgenBitfieldUnit<[u8; 2usize]>>::raw_get(
                ::core::ptr::addr_of!((*this)._bitfield_1),
                4usize,
                1u8,
            ) as u16)
        }
    }
    #[inline]
    pub unsafe fn set_extended_pdu_raw(this: *mut Self, val: u16) {
        unsafe {
            let val: u16 = ::core::mem::transmute(val);
            <__BindgenBitfieldUnit<[u8; 2usize]>>::raw_set(
                ::core::ptr::addr_of_mut!((*this)._bitfield_1),
                4usize,
                1u8,
                val as u64,
            )
        }
    }
    #[inline]
    pub fn status(&self) -> u16 {
        unsafe { ::core::mem::transmute(self._bitfield_1.get(5usize, 2u8) as u16) }
    }
    #[inline]
    pub fn set_status(&mut self, val: u16) {
        unsafe {
            let val: u16 = ::core::mem::transmute(val);
            self._bitfield_1.set(5usize, 2u8, val as u64)
        }
    }
    #[inline]
    pub unsafe fn status_raw(this: *const Self) -> u16 {
        unsafe {
            ::core::mem::transmute(<__BindgenBitfieldUnit<[u8; 2usize]>>::raw_get(
                ::core::ptr::addr_of!((*this)._bitfield_1),
                5usize,
                2u8,
            ) as u16)
        }
    }
    #[inline]
    pub unsafe fn set_status_raw(this: *mut Self, val: u16) {
        unsafe {
            let val: u16 = ::core::mem::transmute(val);
            <__BindgenBitfieldUnit<[u8; 2usize]>>::raw_set(
                ::core::ptr::addr_of_mut!((*this)._bitfield_1),
                5usize,
                2u8,
                val as u64,
            )
        }
    }
    #[inline]
    pub fn reserved(&self) -> u16 {
        unsafe { ::core::mem::transmute(self._bitfield_1.get(7usize, 9u8) as u16) }
    }
    #[inline]
    pub fn set_reserved(&mut self, val: u16) {
        unsafe {
            let val: u16 = ::core::mem::transmute(val);
            self._bitfield_1.set(7usize, 9u8, val as u64)
        }
    }
    #[inline]
    pub unsafe fn reserved_raw(this: *const Self) -> u16 {
        unsafe {
            ::core::mem::transmute(<__BindgenBitfieldUnit<[u8; 2usize]>>::raw_get(
                ::core::ptr::addr_of!((*this)._bitfield_1),
                7usize,
                9u8,
            ) as u16)
        }
    }
    #[inline]
    pub unsafe fn set_reserved_raw(this: *mut Self, val: u16) {
        unsafe {
            let val: u16 = ::core::mem::transmute(val);
            <__BindgenBitfieldUnit<[u8; 2usize]>>::raw_set(
                ::core::ptr::addr_of_mut!((*this)._bitfield_1),
                7usize,
                9u8,
                val as u64,
            )
        }
    }
    #[inline]
    pub fn new_bitfield_1(
        connectable: u16,
        scannable: u16,
        directed: u16,
        scan_response: u16,
        extended_pdu: u16,
        status: u16,
        reserved: u16,
    ) -> __BindgenBitfieldUnit<[u8; 2usize]> {
        let mut __bindgen_bitfield_unit: __BindgenBitfieldUnit<[u8; 2usize]> = Default::default();
        __bindgen_bitfield_unit.set(0usize, 1u8, {
            let connectable: u16 = unsafe { ::core::mem::transmute(connectable) };
            connectable as u64
        });
        __bindgen_bitfield_unit.set(1usize, 1u8, {
            let scannable: u16 = unsafe { ::core::mem::transmute(scannable) };
            scannable as u64
        });
        __bindgen_bitfield_unit.set(2usize, 1u8, {
            let directed: u16 = unsafe { ::core::mem::transmute(directed) };
            directed as u64
        });
        __bindgen_bitfield_unit.set(3usize, 1u8, {
            let scan_response: u16 = unsafe { ::core::mem::transmute(scan_response) };
            scan_response as u64
        });
        __bindgen_bitfield_unit.set(4usize, 1u8, {
            let extended_pdu: u16 = unsafe { ::core::mem::transmute(extended_pdu) };
            extended_pdu as u64
        });
        __bindgen_bitfield_unit.set(5usize, 2u8, {
            let status: u16 = unsafe { ::core::mem::transmute(status) };
            status as u64
        });
        __bindgen_bitfield_unit.set(7usize, 9u8, {
            let reserved: u16 = unsafe { ::core::mem::transmute(reserved) };
            reserved as u64
        });
        __bindgen_bitfield_unit
    }
}
#[doc = "@brief Advertising Auxiliary Pointer."]
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct ble_gap_aux_pointer_t {
    #[doc = "< Time offset from the beginning of advertising packet to the auxiliary packet in 100 us units."]
    pub aux_offset: u16,
    #[doc = "< Indicates the PHY on which the auxiliary advertising packet is sent. See @ref BLE_GAP_PHYS."]
    pub aux_phy: u8,
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of ble_gap_aux_pointer_t"][::core::mem::size_of::<ble_gap_aux_pointer_t>() - 4usize];
    ["Alignment of ble_gap_aux_pointer_t"][::core::mem::align_of::<ble_gap_aux_pointer_t>() - 2usize];
    ["Offset of field: ble_gap_aux_pointer_t::aux_offset"]
        [::core::mem::offset_of!(ble_gap_aux_pointer_t, aux_offset) - 0usize];
    ["Offset of field: ble_gap_aux_pointer_t::aux_phy"]
        [::core::mem::offset_of!(ble_gap_aux_pointer_t, aux_phy) - 2usize];
};
#[doc = "@brief Bluetooth Low Energy address."]
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct ble_gap_addr_t {
    pub _bitfield_align_1: [u8; 0],
    pub _bitfield_1: __BindgenBitfieldUnit<[u8; 1usize]>,
    #[doc = "< 48-bit address, LSB format.\n@ref addr is not used if @ref addr_type is @ref BLE_GAP_ADDR_TYPE_ANONYMOUS."]
    pub addr: [u8; 6usize],
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of ble_gap_addr_t"][::core::mem::size_of::<ble_gap_addr_t>() - 7usize];
    ["Alignment of ble_gap_addr_t"][::core::mem::align_of::<ble_gap_addr_t>() - 1usize];
    ["Offset of field: ble_gap_addr_t::addr"][::core::mem::offset_of!(ble_gap_addr_t, addr) - 1usize];
};
impl ble_gap_addr_t {
    #[inline]
    pub fn addr_id_peer(&self) -> u8 {
        unsafe { ::core::mem::transmute(self._bitfield_1.get(0usize, 1u8) as u8) }
    }
    #[inline]
    pub fn set_addr_id_peer(&mut self, val: u8) {
        unsafe {
            let val: u8 = ::core::mem::transmute(val);
            self._bitfield_1.set(0usize, 1u8, val as u64)
        }
    }
    #[inline]
    pub unsafe fn addr_id_peer_raw(this: *const Self) -> u8 {
        unsafe {
            ::core::mem::transmute(<__BindgenBitfieldUnit<[u8; 1usize]>>::raw_get(
                ::core::ptr::addr_of!((*this)._bitfield_1),
                0usize,
                1u8,
            ) as u8)
        }
    }
    #[inline]
    pub unsafe fn set_addr_id_peer_raw(this: *mut Self, val: u8) {
        unsafe {
            let val: u8 = ::core::mem::transmute(val);
            <__BindgenBitfieldUnit<[u8; 1usize]>>::raw_set(
                ::core::ptr::addr_of_mut!((*this)._bitfield_1),
                0usize,
                1u8,
                val as u64,
            )
        }
    }
    #[inline]
    pub fn addr_type(&self) -> u8 {
        unsafe { ::core::mem::transmute(self._bitfield_1.get(1usize, 7u8) as u8) }
    }
    #[inline]
    pub fn set_addr_type(&mut self, val: u8) {
        unsafe {
            let val: u8 = ::core::mem::transmute(val);
            self._bitfield_1.set(1usize, 7u8, val as u64)
        }
    }
    #[inline]
    pub unsafe fn addr_type_raw(this: *const Self) -> u8 {
        unsafe {
            ::core::mem::transmute(<__BindgenBitfieldUnit<[u8; 1usize]>>::raw_get(
                ::core::ptr::addr_of!((*this)._bitfield_1),
                1usize,
                7u8,
            ) as u8)
        }
    }
    #[inline]
    pub unsafe fn set_addr_type_raw(this: *mut Self, val: u8) {
        unsafe {
            let val: u8 = ::core::mem::transmute(val);
            <__BindgenBitfieldUnit<[u8; 1usize]>>::raw_set(
                ::core::ptr::addr_of_mut!((*this)._bitfield_1),
                1usize,
                7u8,
                val as u64,
            )
        }
    }
    #[inline]
    pub fn new_bitfield_1(addr_id_peer: u8, addr_type: u8) -> __BindgenBitfieldUnit<[u8; 1usize]> {
        let mut __bindgen_bitfield_unit: __BindgenBitfieldUnit<[u8; 1usize]> = Default::default();
        __bindgen_bitfield_unit.set(0usize, 1u8, {
            let addr_id_peer: u8 = unsafe { ::core::mem::transmute(addr_id_peer) };
            addr_id_peer as u64
        });
        __bindgen_bitfield_unit.set(1usize, 7u8, {
            let addr_type: u8 = unsafe { ::core::mem::transmute(addr_type) };
            addr_type as u64
        });
        __bindgen_bitfield_unit
    }
}
#[doc = "@brief GAP connection parameters.\n\n @note  When ble_conn_params_t is received in an event, both min_conn_interval and\n        max_conn_interval will be equal to the connection interval set by the central.\n\n @note  If both conn_sup_timeout and max_conn_interval are specified, then the following constraint applies:\n        conn_sup_timeout * 4 > (1 + slave_latency) * max_conn_interval\n        that corresponds to the following Bluetooth Spec requirement:\n        The Supervision_Timeout in milliseconds shall be larger than\n        (1 + Conn_Latency) * Conn_Interval_Max * 2, where Conn_Interval_Max is given in milliseconds."]
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct ble_gap_conn_params_t {
    #[doc = "< Minimum Connection Interval in 1.25 ms units, see @ref BLE_GAP_CP_LIMITS."]
    pub min_conn_interval: u16,
    #[doc = "< Maximum Connection Interval in 1.25 ms units, see @ref BLE_GAP_CP_LIMITS."]
    pub max_conn_interval: u16,
    #[doc = "< Slave Latency in number of connection events, see @ref BLE_GAP_CP_LIMITS."]
    pub slave_latency: u16,
    #[doc = "< Connection Supervision Timeout in 10 ms units, see @ref BLE_GAP_CP_LIMITS."]
    pub conn_sup_timeout: u16,
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of ble_gap_conn_params_t"][::core::mem::size_of::<ble_gap_conn_params_t>() - 8usize];
    ["Alignment of ble_gap_conn_params_t"][::core::mem::align_of::<ble_gap_conn_params_t>() - 2usize];
    ["Offset of field: ble_gap_conn_params_t::min_conn_interval"]
        [::core::mem::offset_of!(ble_gap_conn_params_t, min_conn_interval) - 0usize];
    ["Offset of field: ble_gap_conn_params_t::max_conn_interval"]
        [::core::mem::offset_of!(ble_gap_conn_params_t, max_conn_interval) - 2usize];
    ["Offset of field: ble_gap_conn_params_t::slave_latency"]
        [::core::mem::offset_of!(ble_gap_conn_params_t, slave_latency) - 4usize];
    ["Offset of field: ble_gap_conn_params_t::conn_sup_timeout"]
        [::core::mem::offset_of!(ble_gap_conn_params_t, conn_sup_timeout) - 6usize];
};
#[doc = "@brief GAP connection security modes.\n\n Security Mode 0 Level 0: No access permissions at all (this level is not defined by the Bluetooth Core specification).\\n\n Security Mode 1 Level 1: No security is needed (aka open link).\\n\n Security Mode 1 Level 2: Encrypted link required, MITM protection not necessary.\\n\n Security Mode 1 Level 3: MITM protected encrypted link required.\\n\n Security Mode 1 Level 4: LESC MITM protected encrypted link using a 128-bit strength encryption key required.\\n\n Security Mode 2 Level 1: Signing or encryption required, MITM protection not necessary.\\n\n Security Mode 2 Level 2: MITM protected signing required, unless link is MITM protected encrypted.\\n"]
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct ble_gap_conn_sec_mode_t {
    pub _bitfield_align_1: [u8; 0],
    pub _bitfield_1: __BindgenBitfieldUnit<[u8; 1usize]>,
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of ble_gap_conn_sec_mode_t"][::core::mem::size_of::<ble_gap_conn_sec_mode_t>() - 1usize];
    ["Alignment of ble_gap_conn_sec_mode_t"][::core::mem::align_of::<ble_gap_conn_sec_mode_t>() - 1usize];
};
impl ble_gap_conn_sec_mode_t {
    #[inline]
    pub fn sm(&self) -> u8 {
        unsafe { ::core::mem::transmute(self._bitfield_1.get(0usize, 4u8) as u8) }
    }
    #[inline]
    pub fn set_sm(&mut self, val: u8) {
        unsafe {
            let val: u8 = ::core::mem::transmute(val);
            self._bitfield_1.set(0usize, 4u8, val as u64)
        }
    }
    #[inline]
    pub unsafe fn sm_raw(this: *const Self) -> u8 {
        unsafe {
            ::core::mem::transmute(<__BindgenBitfieldUnit<[u8; 1usize]>>::raw_get(
                ::core::ptr::addr_of!((*this)._bitfield_1),
                0usize,
                4u8,
            ) as u8)
        }
    }
    #[inline]
    pub unsafe fn set_sm_raw(this: *mut Self, val: u8) {
        unsafe {
            let val: u8 = ::core::mem::transmute(val);
            <__BindgenBitfieldUnit<[u8; 1usize]>>::raw_set(
                ::core::ptr::addr_of_mut!((*this)._bitfield_1),
                0usize,
                4u8,
                val as u64,
            )
        }
    }
    #[inline]
    pub fn lv(&self) -> u8 {
        unsafe { ::core::mem::transmute(self._bitfield_1.get(4usize, 4u8) as u8) }
    }
    #[inline]
    pub fn set_lv(&mut self, val: u8) {
        unsafe {
            let val: u8 = ::core::mem::transmute(val);
            self._bitfield_1.set(4usize, 4u8, val as u64)
        }
    }
    #[inline]
    pub unsafe fn lv_raw(this: *const Self) -> u8 {
        unsafe {
            ::core::mem::transmute(<__BindgenBitfieldUnit<[u8; 1usize]>>::raw_get(
                ::core::ptr::addr_of!((*this)._bitfield_1),
                4usize,
                4u8,
            ) as u8)
        }
    }
    #[inline]
    pub unsafe fn set_lv_raw(this: *mut Self, val: u8) {
        unsafe {
            let val: u8 = ::core::mem::transmute(val);
            <__BindgenBitfieldUnit<[u8; 1usize]>>::raw_set(
                ::core::ptr::addr_of_mut!((*this)._bitfield_1),
                4usize,
                4u8,
                val as u64,
            )
        }
    }
    #[inline]
    pub fn new_bitfield_1(sm: u8, lv: u8) -> __BindgenBitfieldUnit<[u8; 1usize]> {
        let mut __bindgen_bitfield_unit: __BindgenBitfieldUnit<[u8; 1usize]> = Default::default();
        __bindgen_bitfield_unit.set(0usize, 4u8, {
            let sm: u8 = unsafe { ::core::mem::transmute(sm) };
            sm as u64
        });
        __bindgen_bitfield_unit.set(4usize, 4u8, {
            let lv: u8 = unsafe { ::core::mem::transmute(lv) };
            lv as u64
        });
        __bindgen_bitfield_unit
    }
}
#[doc = "@brief GAP connection security status."]
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct ble_gap_conn_sec_t {
    #[doc = "< Currently active security mode for this connection."]
    pub sec_mode: ble_gap_conn_sec_mode_t,
    #[doc = "< Length of currently active encryption key, 7 to 16 octets (only applicable for bonding procedures)."]
    pub encr_key_size: u8,
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of ble_gap_conn_sec_t"][::core::mem::size_of::<ble_gap_conn_sec_t>() - 2usize];
    ["Alignment of ble_gap_conn_sec_t"][::core::mem::align_of::<ble_gap_conn_sec_t>() - 1usize];
    ["Offset of field: ble_gap_conn_sec_t::sec_mode"][::core::mem::offset_of!(ble_gap_conn_sec_t, sec_mode) - 0usize];
    ["Offset of field: ble_gap_conn_sec_t::encr_key_size"]
        [::core::mem::offset_of!(ble_gap_conn_sec_t, encr_key_size) - 1usize];
};
#[doc = "@brief Identity Resolving Key."]
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct ble_gap_irk_t {
    #[doc = "< Array containing IRK."]
    pub irk: [u8; 16usize],
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of ble_gap_irk_t"][::core::mem::size_of::<ble_gap_irk_t>() - 16usize];
    ["Alignment of ble_gap_irk_t"][::core::mem::align_of::<ble_gap_irk_t>() - 1usize];
    ["Offset of field: ble_gap_irk_t::irk"][::core::mem::offset_of!(ble_gap_irk_t, irk) - 0usize];
};
#[doc = "@brief Channel mask (40 bits).\n Every channel is represented with a bit positioned as per channel index defined in Bluetooth Core Specification v5.0,\n Vol 6, Part B, Section 1.4.1. The LSB contained in array element 0 represents channel index 0, and bit 39 represents\n channel index 39. If a bit is set to 1, the channel is not used."]
pub type ble_gap_ch_mask_t = [u8; 5usize];
#[doc = "@brief GAP advertising parameters."]
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct ble_gap_adv_params_t {
    #[doc = "< The properties of the advertising events."]
    pub properties: ble_gap_adv_properties_t,
    #[doc = "< Address of a known peer.\n@note ble_gap_addr_t::addr_type cannot be\n@ref BLE_GAP_ADDR_TYPE_ANONYMOUS.\n- When privacy is enabled and the local device uses\n@ref BLE_GAP_ADDR_TYPE_RANDOM_PRIVATE_RESOLVABLE addresses,\nthe device identity list is searched for a matching entry. If\nthe local IRK for that device identity is set, the local IRK\nfor that device will be used to generate the advertiser address\nfield in the advertising packet.\n- If @ref ble_gap_adv_properties_t::type is directed, this must be\nset to the targeted scanner or initiator. If the peer address is\nin the device identity list, the peer IRK for that device will be\nused to generate @ref BLE_GAP_ADDR_TYPE_RANDOM_PRIVATE_RESOLVABLE\ntarget addresses used in the advertising event PDUs."]
    pub p_peer_addr: *const ble_gap_addr_t,
    #[doc = "< Advertising interval in 625 us units. @sa BLE_GAP_ADV_INTERVALS.\n@note If @ref ble_gap_adv_properties_t::type is set to\n@ref BLE_GAP_ADV_TYPE_CONNECTABLE_NONSCANNABLE_DIRECTED_HIGH_DUTY_CYCLE\nadvertising, this parameter is ignored."]
    pub interval: u32,
    #[doc = "< Advertising duration in 10 ms units. When timeout is reached,\nan event of type @ref BLE_GAP_EVT_ADV_SET_TERMINATED is raised.\n@sa BLE_GAP_ADV_TIMEOUT_VALUES.\n@note The SoftDevice will always complete at least one advertising\nevent even if the duration is set too low."]
    pub duration: u16,
    #[doc = "< Maximum advertising events that shall be sent prior to disabling\nadvertising. Setting the value to 0 disables the limitation. When\nthe count of advertising events specified by this parameter\n(if not 0) is reached, advertising will be automatically stopped\nand an event of type @ref BLE_GAP_EVT_ADV_SET_TERMINATED is raised\n@note If @ref ble_gap_adv_properties_t::type is set to\n@ref BLE_GAP_ADV_TYPE_CONNECTABLE_NONSCANNABLE_DIRECTED_HIGH_DUTY_CYCLE,\nthis parameter is ignored."]
    pub max_adv_evts: u8,
    #[doc = "< Channel mask for primary and secondary advertising channels.\nAt least one of the primary channels, that is channel index 37-39, must be used.\nMasking away secondary advertising channels is not supported."]
    pub channel_mask: ble_gap_ch_mask_t,
    #[doc = "< Filter Policy. @sa BLE_GAP_ADV_FILTER_POLICIES."]
    pub filter_policy: u8,
    #[doc = "< Indicates the PHY on which the primary advertising channel packets\nare transmitted. If set to @ref BLE_GAP_PHY_AUTO, @ref BLE_GAP_PHY_1MBPS\nwill be used.\nValid values are @ref BLE_GAP_PHY_1MBPS and @ref BLE_GAP_PHY_CODED.\n@note The primary_phy shall indicate @ref BLE_GAP_PHY_1MBPS if\n@ref ble_gap_adv_properties_t::type is not an extended advertising type."]
    pub primary_phy: u8,
    #[doc = "< Indicates the PHY on which the secondary advertising channel packets\nare transmitted.\nIf set to @ref BLE_GAP_PHY_AUTO, @ref BLE_GAP_PHY_1MBPS will be used.\nValid values are\n@ref BLE_GAP_PHY_1MBPS, @ref BLE_GAP_PHY_2MBPS, and @ref BLE_GAP_PHY_CODED.\nIf @ref ble_gap_adv_properties_t::type is an extended advertising type\nand connectable, this is the PHY that will be used to establish a\nconnection and send AUX_ADV_IND packets on.\n@note This parameter will be ignored when\n@ref ble_gap_adv_properties_t::type is not an extended advertising type."]
    pub secondary_phy: u8,
    pub _bitfield_align_1: [u8; 0],
    pub _bitfield_1: __BindgenBitfieldUnit<[u8; 1usize]>,
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of ble_gap_adv_params_t"][::core::mem::size_of::<ble_gap_adv_params_t>() - 24usize];
    ["Alignment of ble_gap_adv_params_t"][::core::mem::align_of::<ble_gap_adv_params_t>() - 4usize];
    ["Offset of field: ble_gap_adv_params_t::properties"]
        [::core::mem::offset_of!(ble_gap_adv_params_t, properties) - 0usize];
    ["Offset of field: ble_gap_adv_params_t::p_peer_addr"]
        [::core::mem::offset_of!(ble_gap_adv_params_t, p_peer_addr) - 4usize];
    ["Offset of field: ble_gap_adv_params_t::interval"]
        [::core::mem::offset_of!(ble_gap_adv_params_t, interval) - 8usize];
    ["Offset of field: ble_gap_adv_params_t::duration"]
        [::core::mem::offset_of!(ble_gap_adv_params_t, duration) - 12usize];
    ["Offset of field: ble_gap_adv_params_t::max_adv_evts"]
        [::core::mem::offset_of!(ble_gap_adv_params_t, max_adv_evts) - 14usize];
    ["Offset of field: ble_gap_adv_params_t::channel_mask"]
        [::core::mem::offset_of!(ble_gap_adv_params_t, channel_mask) - 15usize];
    ["Offset of field: ble_gap_adv_params_t::filter_policy"]
        [::core::mem::offset_of!(ble_gap_adv_params_t, filter_policy) - 20usize];
    ["Offset of field: ble_gap_adv_params_t::primary_phy"]
        [::core::mem::offset_of!(ble_gap_adv_params_t, primary_phy) - 21usize];
    ["Offset of field: ble_gap_adv_params_t::secondary_phy"]
        [::core::mem::offset_of!(ble_gap_adv_params_t, secondary_phy) - 22usize];
};
impl ble_gap_adv_params_t {
    #[inline]
    pub fn set_id(&self) -> u8 {
        unsafe { ::core::mem::transmute(self._bitfield_1.get(0usize, 4u8) as u8) }
    }
    #[inline]
    pub fn set_set_id(&mut self, val: u8) {
        unsafe {
            let val: u8 = ::core::mem::transmute(val);
            self._bitfield_1.set(0usize, 4u8, val as u64)
        }
    }
    #[inline]
    pub unsafe fn set_id_raw(this: *const Self) -> u8 {
        unsafe {
            ::core::mem::transmute(<__BindgenBitfieldUnit<[u8; 1usize]>>::raw_get(
                ::core::ptr::addr_of!((*this)._bitfield_1),
                0usize,
                4u8,
            ) as u8)
        }
    }
    #[inline]
    pub unsafe fn set_set_id_raw(this: *mut Self, val: u8) {
        unsafe {
            let val: u8 = ::core::mem::transmute(val);
            <__BindgenBitfieldUnit<[u8; 1usize]>>::raw_set(
                ::core::ptr::addr_of_mut!((*this)._bitfield_1),
                0usize,
                4u8,
                val as u64,
            )
        }
    }
    #[inline]
    pub fn scan_req_notification(&self) -> u8 {
        unsafe { ::core::mem::transmute(self._bitfield_1.get(4usize, 1u8) as u8) }
    }
    #[inline]
    pub fn set_scan_req_notification(&mut self, val: u8) {
        unsafe {
            let val: u8 = ::core::mem::transmute(val);
            self._bitfield_1.set(4usize, 1u8, val as u64)
        }
    }
    #[inline]
    pub unsafe fn scan_req_notification_raw(this: *const Self) -> u8 {
        unsafe {
            ::core::mem::transmute(<__BindgenBitfieldUnit<[u8; 1usize]>>::raw_get(
                ::core::ptr::addr_of!((*this)._bitfield_1),
                4usize,
                1u8,
            ) as u8)
        }
    }
    #[inline]
    pub unsafe fn set_scan_req_notification_raw(this: *mut Self, val: u8) {
        unsafe {
            let val: u8 = ::core::mem::transmute(val);
            <__BindgenBitfieldUnit<[u8; 1usize]>>::raw_set(
                ::core::ptr::addr_of_mut!((*this)._bitfield_1),
                4usize,
                1u8,
                val as u64,
            )
        }
    }
    #[inline]
    pub fn new_bitfield_1(set_id: u8, scan_req_notification: u8) -> __BindgenBitfieldUnit<[u8; 1usize]> {
        let mut __bindgen_bitfield_unit: __BindgenBitfieldUnit<[u8; 1usize]> = Default::default();
        __bindgen_bitfield_unit.set(0usize, 4u8, {
            let set_id: u8 = unsafe { ::core::mem::transmute(set_id) };
            set_id as u64
        });
        __bindgen_bitfield_unit.set(4usize, 1u8, {
            let scan_req_notification: u8 = unsafe { ::core::mem::transmute(scan_req_notification) };
            scan_req_notification as u64
        });
        __bindgen_bitfield_unit
    }
}
#[doc = "@brief GAP advertising data buffers.\n\n The application must provide the buffers for advertisement. The memory shall reside in application RAM, and\n shall never be modified while advertising. The data shall be kept alive until either:\n  - @ref BLE_GAP_EVT_ADV_SET_TERMINATED is raised.\n  - @ref BLE_GAP_EVT_CONNECTED is raised with @ref ble_gap_evt_connected_t::adv_handle set to the corresponding\n    advertising handle.\n  - Advertising is stopped.\n  - Advertising data is changed.\n To update advertising data while advertising, provide new buffers to @ref sd_ble_gap_adv_set_configure."]
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct ble_gap_adv_data_t {
    #[doc = "< Advertising data.\n@note\nAdvertising data can only be specified for a @ref ble_gap_adv_properties_t::type\nthat is allowed to contain advertising data."]
    pub adv_data: ble_data_t,
    #[doc = "< Scan response data.\n@note\nScan response data can only be specified for a @ref ble_gap_adv_properties_t::type\nthat is scannable."]
    pub scan_rsp_data: ble_data_t,
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of ble_gap_adv_data_t"][::core::mem::size_of::<ble_gap_adv_data_t>() - 16usize];
    ["Alignment of ble_gap_adv_data_t"][::core::mem::align_of::<ble_gap_adv_data_t>() - 4usize];
    ["Offset of field: ble_gap_adv_data_t::adv_data"][::core::mem::offset_of!(ble_gap_adv_data_t, adv_data) - 0usize];
    ["Offset of field: ble_gap_adv_data_t::scan_rsp_data"]
        [::core::mem::offset_of!(ble_gap_adv_data_t, scan_rsp_data) - 8usize];
};
#[doc = "@brief GAP scanning parameters."]
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct ble_gap_scan_params_t {
    pub _bitfield_align_1: [u8; 0],
    pub _bitfield_1: __BindgenBitfieldUnit<[u8; 1usize]>,
    #[doc = "< Bitfield of PHYs to scan on. If set to @ref BLE_GAP_PHY_AUTO,\nscan_phys will default to @ref BLE_GAP_PHY_1MBPS.\n- If @ref ble_gap_scan_params_t::extended is set to 0, the only\nsupported PHY is @ref BLE_GAP_PHY_1MBPS.\n- When used with @ref sd_ble_gap_scan_start,\nthe bitfield indicates the PHYs the scanner will use for scanning\non primary advertising channels. The scanner will accept\n@ref BLE_GAP_PHYS_SUPPORTED as secondary advertising channel PHYs.\n- When used with @ref sd_ble_gap_connect, the bitfield indicates\nthe PHYs the initiator will use for scanning on primary advertising\nchannels. The initiator will accept connections initiated on either\nof the @ref BLE_GAP_PHYS_SUPPORTED PHYs.\nIf scan_phys contains @ref BLE_GAP_PHY_1MBPS and/or @ref BLE_GAP_PHY_2MBPS,\nthe primary scan PHY is @ref BLE_GAP_PHY_1MBPS.\nIf scan_phys also contains @ref BLE_GAP_PHY_CODED, the primary scan\nPHY will also contain @ref BLE_GAP_PHY_CODED. If the only scan PHY is\n@ref BLE_GAP_PHY_CODED, the primary scan PHY is\n@ref BLE_GAP_PHY_CODED only."]
    pub scan_phys: u8,
    #[doc = "< Scan interval in 625 us units. @sa BLE_GAP_SCAN_INTERVALS."]
    pub interval: u16,
    #[doc = "< Scan window in 625 us units. @sa BLE_GAP_SCAN_WINDOW.\nIf scan_phys contains both @ref BLE_GAP_PHY_1MBPS and\n@ref BLE_GAP_PHY_CODED interval shall be larger than or\nequal to twice the scan window."]
    pub window: u16,
    #[doc = "< Scan timeout in 10 ms units. @sa BLE_GAP_SCAN_TIMEOUT."]
    pub timeout: u16,
    #[doc = "< Channel mask for primary and secondary advertising channels.\nAt least one of the primary channels, that is channel index 37-39, must be\nset to 0.\nMasking away secondary channels is not supported."]
    pub channel_mask: ble_gap_ch_mask_t,
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of ble_gap_scan_params_t"][::core::mem::size_of::<ble_gap_scan_params_t>() - 14usize];
    ["Alignment of ble_gap_scan_params_t"][::core::mem::align_of::<ble_gap_scan_params_t>() - 2usize];
    ["Offset of field: ble_gap_scan_params_t::scan_phys"]
        [::core::mem::offset_of!(ble_gap_scan_params_t, scan_phys) - 1usize];
    ["Offset of field: ble_gap_scan_params_t::interval"]
        [::core::mem::offset_of!(ble_gap_scan_params_t, interval) - 2usize];
    ["Offset of field: ble_gap_scan_params_t::window"][::core::mem::offset_of!(ble_gap_scan_params_t, window) - 4usize];
    ["Offset of field: ble_gap_scan_params_t::timeout"]
        [::core::mem::offset_of!(ble_gap_scan_params_t, timeout) - 6usize];
    ["Offset of field: ble_gap_scan_params_t::channel_mask"]
        [::core::mem::offset_of!(ble_gap_scan_params_t, channel_mask) - 8usize];
};
impl ble_gap_scan_params_t {
    #[inline]
    pub fn extended(&self) -> u8 {
        unsafe { ::core::mem::transmute(self._bitfield_1.get(0usize, 1u8) as u8) }
    }
    #[inline]
    pub fn set_extended(&mut self, val: u8) {
        unsafe {
            let val: u8 = ::core::mem::transmute(val);
            self._bitfield_1.set(0usize, 1u8, val as u64)
        }
    }
    #[inline]
    pub unsafe fn extended_raw(this: *const Self) -> u8 {
        unsafe {
            ::core::mem::transmute(<__BindgenBitfieldUnit<[u8; 1usize]>>::raw_get(
                ::core::ptr::addr_of!((*this)._bitfield_1),
                0usize,
                1u8,
            ) as u8)
        }
    }
    #[inline]
    pub unsafe fn set_extended_raw(this: *mut Self, val: u8) {
        unsafe {
            let val: u8 = ::core::mem::transmute(val);
            <__BindgenBitfieldUnit<[u8; 1usize]>>::raw_set(
                ::core::ptr::addr_of_mut!((*this)._bitfield_1),
                0usize,
                1u8,
                val as u64,
            )
        }
    }
    #[inline]
    pub fn report_incomplete_evts(&self) -> u8 {
        unsafe { ::core::mem::transmute(self._bitfield_1.get(1usize, 1u8) as u8) }
    }
    #[inline]
    pub fn set_report_incomplete_evts(&mut self, val: u8) {
        unsafe {
            let val: u8 = ::core::mem::transmute(val);
            self._bitfield_1.set(1usize, 1u8, val as u64)
        }
    }
    #[inline]
    pub unsafe fn report_incomplete_evts_raw(this: *const Self) -> u8 {
        unsafe {
            ::core::mem::transmute(<__BindgenBitfieldUnit<[u8; 1usize]>>::raw_get(
                ::core::ptr::addr_of!((*this)._bitfield_1),
                1usize,
                1u8,
            ) as u8)
        }
    }
    #[inline]
    pub unsafe fn set_report_incomplete_evts_raw(this: *mut Self, val: u8) {
        unsafe {
            let val: u8 = ::core::mem::transmute(val);
            <__BindgenBitfieldUnit<[u8; 1usize]>>::raw_set(
                ::core::ptr::addr_of_mut!((*this)._bitfield_1),
                1usize,
                1u8,
                val as u64,
            )
        }
    }
    #[inline]
    pub fn active(&self) -> u8 {
        unsafe { ::core::mem::transmute(self._bitfield_1.get(2usize, 1u8) as u8) }
    }
    #[inline]
    pub fn set_active(&mut self, val: u8) {
        unsafe {
            let val: u8 = ::core::mem::transmute(val);
            self._bitfield_1.set(2usize, 1u8, val as u64)
        }
    }
    #[inline]
    pub unsafe fn active_raw(this: *const Self) -> u8 {
        unsafe {
            ::core::mem::transmute(<__BindgenBitfieldUnit<[u8; 1usize]>>::raw_get(
                ::core::ptr::addr_of!((*this)._bitfield_1),
                2usize,
                1u8,
            ) as u8)
        }
    }
    #[inline]
    pub unsafe fn set_active_raw(this: *mut Self, val: u8) {
        unsafe {
            let val: u8 = ::core::mem::transmute(val);
            <__BindgenBitfieldUnit<[u8; 1usize]>>::raw_set(
                ::core::ptr::addr_of_mut!((*this)._bitfield_1),
                2usize,
                1u8,
                val as u64,
            )
        }
    }
    #[inline]
    pub fn filter_policy(&self) -> u8 {
        unsafe { ::core::mem::transmute(self._bitfield_1.get(3usize, 2u8) as u8) }
    }
    #[inline]
    pub fn set_filter_policy(&mut self, val: u8) {
        unsafe {
            let val: u8 = ::core::mem::transmute(val);
            self._bitfield_1.set(3usize, 2u8, val as u64)
        }
    }
    #[inline]
    pub unsafe fn filter_policy_raw(this: *const Self) -> u8 {
        unsafe {
            ::core::mem::transmute(<__BindgenBitfieldUnit<[u8; 1usize]>>::raw_get(
                ::core::ptr::addr_of!((*this)._bitfield_1),
                3usize,
                2u8,
            ) as u8)
        }
    }
    #[inline]
    pub unsafe fn set_filter_policy_raw(this: *mut Self, val: u8) {
        unsafe {
            let val: u8 = ::core::mem::transmute(val);
            <__BindgenBitfieldUnit<[u8; 1usize]>>::raw_set(
                ::core::ptr::addr_of_mut!((*this)._bitfield_1),
                3usize,
                2u8,
                val as u64,
            )
        }
    }
    #[inline]
    pub fn new_bitfield_1(
        extended: u8,
        report_incomplete_evts: u8,
        active: u8,
        filter_policy: u8,
    ) -> __BindgenBitfieldUnit<[u8; 1usize]> {
        let mut __bindgen_bitfield_unit: __BindgenBitfieldUnit<[u8; 1usize]> = Default::default();
        __bindgen_bitfield_unit.set(0usize, 1u8, {
            let extended: u8 = unsafe { ::core::mem::transmute(extended) };
            extended as u64
        });
        __bindgen_bitfield_unit.set(1usize, 1u8, {
            let report_incomplete_evts: u8 = unsafe { ::core::mem::transmute(report_incomplete_evts) };
            report_incomplete_evts as u64
        });
        __bindgen_bitfield_unit.set(2usize, 1u8, {
            let active: u8 = unsafe { ::core::mem::transmute(active) };
            active as u64
        });
        __bindgen_bitfield_unit.set(3usize, 2u8, {
            let filter_policy: u8 = unsafe { ::core::mem::transmute(filter_policy) };
            filter_policy as u64
        });
        __bindgen_bitfield_unit
    }
}
#[doc = "@brief Privacy.\n\n        The privacy feature provides a way for the device to avoid being tracked over a period of time.\n        The privacy feature, when enabled, hides the local device identity and replaces it with a private address\n        that is automatically refreshed at a specified interval.\n\n        If a device still wants to be recognized by other peers, it needs to share it's Identity Resolving Key (IRK).\n        With this key, a device can generate a random private address that can only be recognized by peers in possession of that key,\n        and devices can establish connections without revealing their real identities.\n\n        Both network privacy (@ref BLE_GAP_PRIVACY_MODE_NETWORK_PRIVACY) and device privacy (@ref BLE_GAP_PRIVACY_MODE_DEVICE_PRIVACY)\n        are supported.\n\n @note  If the device IRK is updated, the new IRK becomes the one to be distributed in all\n        bonding procedures performed after @ref sd_ble_gap_privacy_set returns.\n        The IRK distributed during bonding procedure is the device IRK that is active when @ref sd_ble_gap_sec_params_reply is called."]
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct ble_gap_privacy_params_t {
    #[doc = "< Privacy mode, see @ref BLE_GAP_PRIVACY_MODES. Default is @ref BLE_GAP_PRIVACY_MODE_OFF."]
    pub privacy_mode: u8,
    #[doc = "< The private address type must be either @ref BLE_GAP_ADDR_TYPE_RANDOM_PRIVATE_RESOLVABLE or @ref BLE_GAP_ADDR_TYPE_RANDOM_PRIVATE_NON_RESOLVABLE."]
    pub private_addr_type: u8,
    #[doc = "< Private address cycle interval in seconds. Providing an address cycle value of 0 will use the default value defined by @ref BLE_GAP_DEFAULT_PRIVATE_ADDR_CYCLE_INTERVAL_S."]
    pub private_addr_cycle_s: u16,
    #[doc = "< When used as input, pointer to IRK structure that will be used as the default IRK. If NULL, the device default IRK will be used.\nWhen used as output, pointer to IRK structure where the current default IRK will be written to. If NULL, this argument is ignored.\nBy default, the default IRK is used to generate random private resolvable addresses for the local device unless instructed otherwise."]
    pub p_device_irk: *mut ble_gap_irk_t,
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of ble_gap_privacy_params_t"][::core::mem::size_of::<ble_gap_privacy_params_t>() - 8usize];
    ["Alignment of ble_gap_privacy_params_t"][::core::mem::align_of::<ble_gap_privacy_params_t>() - 4usize];
    ["Offset of field: ble_gap_privacy_params_t::privacy_mode"]
        [::core::mem::offset_of!(ble_gap_privacy_params_t, privacy_mode) - 0usize];
    ["Offset of field: ble_gap_privacy_params_t::private_addr_type"]
        [::core::mem::offset_of!(ble_gap_privacy_params_t, private_addr_type) - 1usize];
    ["Offset of field: ble_gap_privacy_params_t::private_addr_cycle_s"]
        [::core::mem::offset_of!(ble_gap_privacy_params_t, private_addr_cycle_s) - 2usize];
    ["Offset of field: ble_gap_privacy_params_t::p_device_irk"]
        [::core::mem::offset_of!(ble_gap_privacy_params_t, p_device_irk) - 4usize];
};
#[doc = "@brief PHY preferences for TX and RX\n @note  tx_phys and rx_phys are bit fields. Multiple bits can be set in them to indicate multiple preferred PHYs for each direction.\n @code\n p_gap_phys->tx_phys = BLE_GAP_PHY_1MBPS | BLE_GAP_PHY_2MBPS;\n p_gap_phys->rx_phys = BLE_GAP_PHY_1MBPS | BLE_GAP_PHY_2MBPS;\n @endcode\n"]
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct ble_gap_phys_t {
    #[doc = "< Preferred transmit PHYs, see @ref BLE_GAP_PHYS."]
    pub tx_phys: u8,
    #[doc = "< Preferred receive PHYs, see @ref BLE_GAP_PHYS."]
    pub rx_phys: u8,
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of ble_gap_phys_t"][::core::mem::size_of::<ble_gap_phys_t>() - 2usize];
    ["Alignment of ble_gap_phys_t"][::core::mem::align_of::<ble_gap_phys_t>() - 1usize];
    ["Offset of field: ble_gap_phys_t::tx_phys"][::core::mem::offset_of!(ble_gap_phys_t, tx_phys) - 0usize];
    ["Offset of field: ble_gap_phys_t::rx_phys"][::core::mem::offset_of!(ble_gap_phys_t, rx_phys) - 1usize];
};
#[doc = " @brief Keys that can be exchanged during a bonding procedure."]
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct ble_gap_sec_kdist_t {
    pub _bitfield_align_1: [u8; 0],
    pub _bitfield_1: __BindgenBitfieldUnit<[u8; 1usize]>,
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of ble_gap_sec_kdist_t"][::core::mem::size_of::<ble_gap_sec_kdist_t>() - 1usize];
    ["Alignment of ble_gap_sec_kdist_t"][::core::mem::align_of::<ble_gap_sec_kdist_t>() - 1usize];
};
impl ble_gap_sec_kdist_t {
    #[inline]
    pub fn enc(&self) -> u8 {
        unsafe { ::core::mem::transmute(self._bitfield_1.get(0usize, 1u8) as u8) }
    }
    #[inline]
    pub fn set_enc(&mut self, val: u8) {
        unsafe {
            let val: u8 = ::core::mem::transmute(val);
            self._bitfield_1.set(0usize, 1u8, val as u64)
        }
    }
    #[inline]
    pub unsafe fn enc_raw(this: *const Self) -> u8 {
        unsafe {
            ::core::mem::transmute(<__BindgenBitfieldUnit<[u8; 1usize]>>::raw_get(
                ::core::ptr::addr_of!((*this)._bitfield_1),
                0usize,
                1u8,
            ) as u8)
        }
    }
    #[inline]
    pub unsafe fn set_enc_raw(this: *mut Self, val: u8) {
        unsafe {
            let val: u8 = ::core::mem::transmute(val);
            <__BindgenBitfieldUnit<[u8; 1usize]>>::raw_set(
                ::core::ptr::addr_of_mut!((*this)._bitfield_1),
                0usize,
                1u8,
                val as u64,
            )
        }
    }
    #[inline]
    pub fn id(&self) -> u8 {
        unsafe { ::core::mem::transmute(self._bitfield_1.get(1usize, 1u8) as u8) }
    }
    #[inline]
    pub fn set_id(&mut self, val: u8) {
        unsafe {
            let val: u8 = ::core::mem::transmute(val);
            self._bitfield_1.set(1usize, 1u8, val as u64)
        }
    }
    #[inline]
    pub unsafe fn id_raw(this: *const Self) -> u8 {
        unsafe {
            ::core::mem::transmute(<__BindgenBitfieldUnit<[u8; 1usize]>>::raw_get(
                ::core::ptr::addr_of!((*this)._bitfield_1),
                1usize,
                1u8,
            ) as u8)
        }
    }
    #[inline]
    pub unsafe fn set_id_raw(this: *mut Self, val: u8) {
        unsafe {
            let val: u8 = ::core::mem::transmute(val);
            <__BindgenBitfieldUnit<[u8; 1usize]>>::raw_set(
                ::core::ptr::addr_of_mut!((*this)._bitfield_1),
                1usize,
                1u8,
                val as u64,
            )
        }
    }
    #[inline]
    pub fn sign(&self) -> u8 {
        unsafe { ::core::mem::transmute(self._bitfield_1.get(2usize, 1u8) as u8) }
    }
    #[inline]
    pub fn set_sign(&mut self, val: u8) {
        unsafe {
            let val: u8 = ::core::mem::transmute(val);
            self._bitfield_1.set(2usize, 1u8, val as u64)
        }
    }
    #[inline]
    pub unsafe fn sign_raw(this: *const Self) -> u8 {
        unsafe {
            ::core::mem::transmute(<__BindgenBitfieldUnit<[u8; 1usize]>>::raw_get(
                ::core::ptr::addr_of!((*this)._bitfield_1),
                2usize,
                1u8,
            ) as u8)
        }
    }
    #[inline]
    pub unsafe fn set_sign_raw(this: *mut Self, val: u8) {
        unsafe {
            let val: u8 = ::core::mem::transmute(val);
            <__BindgenBitfieldUnit<[u8; 1usize]>>::raw_set(
                ::core::ptr::addr_of_mut!((*this)._bitfield_1),
                2usize,
                1u8,
                val as u64,
            )
        }
    }
    #[inline]
    pub fn link(&self) -> u8 {
        unsafe { ::core::mem::transmute(self._bitfield_1.get(3usize, 1u8) as u8) }
    }
    #[inline]
    pub fn set_link(&mut self, val: u8) {
        unsafe {
            let val: u8 = ::core::mem::transmute(val);
            self._bitfield_1.set(3usize, 1u8, val as u64)
        }
    }
    #[inline]
    pub unsafe fn link_raw(this: *const Self) -> u8 {
        unsafe {
            ::core::mem::transmute(<__BindgenBitfieldUnit<[u8; 1usize]>>::raw_get(
                ::core::ptr::addr_of!((*this)._bitfield_1),
                3usize,
                1u8,
            ) as u8)
        }
    }
    #[inline]
    pub unsafe fn set_link_raw(this: *mut Self, val: u8) {
        unsafe {
            let val: u8 = ::core::mem::transmute(val);
            <__BindgenBitfieldUnit<[u8; 1usize]>>::raw_set(
                ::core::ptr::addr_of_mut!((*this)._bitfield_1),
                3usize,
                1u8,
                val as u64,
            )
        }
    }
    #[inline]
    pub fn new_bitfield_1(enc: u8, id: u8, sign: u8, link: u8) -> __BindgenBitfieldUnit<[u8; 1usize]> {
        let mut __bindgen_bitfield_unit: __BindgenBitfieldUnit<[u8; 1usize]> = Default::default();
        __bindgen_bitfield_unit.set(0usize, 1u8, {
            let enc: u8 = unsafe { ::core::mem::transmute(enc) };
            enc as u64
        });
        __bindgen_bitfield_unit.set(1usize, 1u8, {
            let id: u8 = unsafe { ::core::mem::transmute(id) };
            id as u64
        });
        __bindgen_bitfield_unit.set(2usize, 1u8, {
            let sign: u8 = unsafe { ::core::mem::transmute(sign) };
            sign as u64
        });
        __bindgen_bitfield_unit.set(3usize, 1u8, {
            let link: u8 = unsafe { ::core::mem::transmute(link) };
            link as u64
        });
        __bindgen_bitfield_unit
    }
}
#[doc = "@brief GAP security parameters."]
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct ble_gap_sec_params_t {
    pub _bitfield_align_1: [u8; 0],
    pub _bitfield_1: __BindgenBitfieldUnit<[u8; 1usize]>,
    #[doc = "< Minimum encryption key size in octets between 7 and 16. If 0 then not applicable in this instance."]
    pub min_key_size: u8,
    #[doc = "< Maximum encryption key size in octets between min_key_size and 16."]
    pub max_key_size: u8,
    #[doc = "< Key distribution bitmap: keys that the local device will distribute."]
    pub kdist_own: ble_gap_sec_kdist_t,
    #[doc = "< Key distribution bitmap: keys that the remote device will distribute."]
    pub kdist_peer: ble_gap_sec_kdist_t,
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of ble_gap_sec_params_t"][::core::mem::size_of::<ble_gap_sec_params_t>() - 5usize];
    ["Alignment of ble_gap_sec_params_t"][::core::mem::align_of::<ble_gap_sec_params_t>() - 1usize];
    ["Offset of field: ble_gap_sec_params_t::min_key_size"]
        [::core::mem::offset_of!(ble_gap_sec_params_t, min_key_size) - 1usize];
    ["Offset of field: ble_gap_sec_params_t::max_key_size"]
        [::core::mem::offset_of!(ble_gap_sec_params_t, max_key_size) - 2usize];
    ["Offset of field: ble_gap_sec_params_t::kdist_own"]
        [::core::mem::offset_of!(ble_gap_sec_params_t, kdist_own) - 3usize];
    ["Offset of field: ble_gap_sec_params_t::kdist_peer"]
        [::core::mem::offset_of!(ble_gap_sec_params_t, kdist_peer) - 4usize];
};
impl ble_gap_sec_params_t {
    #[inline]
    pub fn bond(&self) -> u8 {
        unsafe { ::core::mem::transmute(self._bitfield_1.get(0usize, 1u8) as u8) }
    }
    #[inline]
    pub fn set_bond(&mut self, val: u8) {
        unsafe {
            let val: u8 = ::core::mem::transmute(val);
            self._bitfield_1.set(0usize, 1u8, val as u64)
        }
    }
    #[inline]
    pub unsafe fn bond_raw(this: *const Self) -> u8 {
        unsafe {
            ::core::mem::transmute(<__BindgenBitfieldUnit<[u8; 1usize]>>::raw_get(
                ::core::ptr::addr_of!((*this)._bitfield_1),
                0usize,
                1u8,
            ) as u8)
        }
    }
    #[inline]
    pub unsafe fn set_bond_raw(this: *mut Self, val: u8) {
        unsafe {
            let val: u8 = ::core::mem::transmute(val);
            <__BindgenBitfieldUnit<[u8; 1usize]>>::raw_set(
                ::core::ptr::addr_of_mut!((*this)._bitfield_1),
                0usize,
                1u8,
                val as u64,
            )
        }
    }
    #[inline]
    pub fn mitm(&self) -> u8 {
        unsafe { ::core::mem::transmute(self._bitfield_1.get(1usize, 1u8) as u8) }
    }
    #[inline]
    pub fn set_mitm(&mut self, val: u8) {
        unsafe {
            let val: u8 = ::core::mem::transmute(val);
            self._bitfield_1.set(1usize, 1u8, val as u64)
        }
    }
    #[inline]
    pub unsafe fn mitm_raw(this: *const Self) -> u8 {
        unsafe {
            ::core::mem::transmute(<__BindgenBitfieldUnit<[u8; 1usize]>>::raw_get(
                ::core::ptr::addr_of!((*this)._bitfield_1),
                1usize,
                1u8,
            ) as u8)
        }
    }
    #[inline]
    pub unsafe fn set_mitm_raw(this: *mut Self, val: u8) {
        unsafe {
            let val: u8 = ::core::mem::transmute(val);
            <__BindgenBitfieldUnit<[u8; 1usize]>>::raw_set(
                ::core::ptr::addr_of_mut!((*this)._bitfield_1),
                1usize,
                1u8,
                val as u64,
            )
        }
    }
    #[inline]
    pub fn lesc(&self) -> u8 {
        unsafe { ::core::mem::transmute(self._bitfield_1.get(2usize, 1u8) as u8) }
    }
    #[inline]
    pub fn set_lesc(&mut self, val: u8) {
        unsafe {
            let val: u8 = ::core::mem::transmute(val);
            self._bitfield_1.set(2usize, 1u8, val as u64)
        }
    }
    #[inline]
    pub unsafe fn lesc_raw(this: *const Self) -> u8 {
        unsafe {
            ::core::mem::transmute(<__BindgenBitfieldUnit<[u8; 1usize]>>::raw_get(
                ::core::ptr::addr_of!((*this)._bitfield_1),
                2usize,
                1u8,
            ) as u8)
        }
    }
    #[inline]
    pub unsafe fn set_lesc_raw(this: *mut Self, val: u8) {
        unsafe {
            let val: u8 = ::core::mem::transmute(val);
            <__BindgenBitfieldUnit<[u8; 1usize]>>::raw_set(
                ::core::ptr::addr_of_mut!((*this)._bitfield_1),
                2usize,
                1u8,
                val as u64,
            )
        }
    }
    #[inline]
    pub fn keypress(&self) -> u8 {
        unsafe { ::core::mem::transmute(self._bitfield_1.get(3usize, 1u8) as u8) }
    }
    #[inline]
    pub fn set_keypress(&mut self, val: u8) {
        unsafe {
            let val: u8 = ::core::mem::transmute(val);
            self._bitfield_1.set(3usize, 1u8, val as u64)
        }
    }
    #[inline]
    pub unsafe fn keypress_raw(this: *const Self) -> u8 {
        unsafe {
            ::core::mem::transmute(<__BindgenBitfieldUnit<[u8; 1usize]>>::raw_get(
                ::core::ptr::addr_of!((*this)._bitfield_1),
                3usize,
                1u8,
            ) as u8)
        }
    }
    #[inline]
    pub unsafe fn set_keypress_raw(this: *mut Self, val: u8) {
        unsafe {
            let val: u8 = ::core::mem::transmute(val);
            <__BindgenBitfieldUnit<[u8; 1usize]>>::raw_set(
                ::core::ptr::addr_of_mut!((*this)._bitfield_1),
                3usize,
                1u8,
                val as u64,
            )
        }
    }
    #[inline]
    pub fn io_caps(&self) -> u8 {
        unsafe { ::core::mem::transmute(self._bitfield_1.get(4usize, 3u8) as u8) }
    }
    #[inline]
    pub fn set_io_caps(&mut self, val: u8) {
        unsafe {
            let val: u8 = ::core::mem::transmute(val);
            self._bitfield_1.set(4usize, 3u8, val as u64)
        }
    }
    #[inline]
    pub unsafe fn io_caps_raw(this: *const Self) -> u8 {
        unsafe {
            ::core::mem::transmute(<__BindgenBitfieldUnit<[u8; 1usize]>>::raw_get(
                ::core::ptr::addr_of!((*this)._bitfield_1),
                4usize,
                3u8,
            ) as u8)
        }
    }
    #[inline]
    pub unsafe fn set_io_caps_raw(this: *mut Self, val: u8) {
        unsafe {
            let val: u8 = ::core::mem::transmute(val);
            <__BindgenBitfieldUnit<[u8; 1usize]>>::raw_set(
                ::core::ptr::addr_of_mut!((*this)._bitfield_1),
                4usize,
                3u8,
                val as u64,
            )
        }
    }
    #[inline]
    pub fn oob(&self) -> u8 {
        unsafe { ::core::mem::transmute(self._bitfield_1.get(7usize, 1u8) as u8) }
    }
    #[inline]
    pub fn set_oob(&mut self, val: u8) {
        unsafe {
            let val: u8 = ::core::mem::transmute(val);
            self._bitfield_1.set(7usize, 1u8, val as u64)
        }
    }
    #[inline]
    pub unsafe fn oob_raw(this: *const Self) -> u8 {
        unsafe {
            ::core::mem::transmute(<__BindgenBitfieldUnit<[u8; 1usize]>>::raw_get(
                ::core::ptr::addr_of!((*this)._bitfield_1),
                7usize,
                1u8,
            ) as u8)
        }
    }
    #[inline]
    pub unsafe fn set_oob_raw(this: *mut Self, val: u8) {
        unsafe {
            let val: u8 = ::core::mem::transmute(val);
            <__BindgenBitfieldUnit<[u8; 1usize]>>::raw_set(
                ::core::ptr::addr_of_mut!((*this)._bitfield_1),
                7usize,
                1u8,
                val as u64,
            )
        }
    }
    #[inline]
    pub fn new_bitfield_1(
        bond: u8,
        mitm: u8,
        lesc: u8,
        keypress: u8,
        io_caps: u8,
        oob: u8,
    ) -> __BindgenBitfieldUnit<[u8; 1usize]> {
        let mut __bindgen_bitfield_unit: __BindgenBitfieldUnit<[u8; 1usize]> = Default::default();
        __bindgen_bitfield_unit.set(0usize, 1u8, {
            let bond: u8 = unsafe { ::core::mem::transmute(bond) };
            bond as u64
        });
        __bindgen_bitfield_unit.set(1usize, 1u8, {
            let mitm: u8 = unsafe { ::core::mem::transmute(mitm) };
            mitm as u64
        });
        __bindgen_bitfield_unit.set(2usize, 1u8, {
            let lesc: u8 = unsafe { ::core::mem::transmute(lesc) };
            lesc as u64
        });
        __bindgen_bitfield_unit.set(3usize, 1u8, {
            let keypress: u8 = unsafe { ::core::mem::transmute(keypress) };
            keypress as u64
        });
        __bindgen_bitfield_unit.set(4usize, 3u8, {
            let io_caps: u8 = unsafe { ::core::mem::transmute(io_caps) };
            io_caps as u64
        });
        __bindgen_bitfield_unit.set(7usize, 1u8, {
            let oob: u8 = unsafe { ::core::mem::transmute(oob) };
            oob as u64
        });
        __bindgen_bitfield_unit
    }
}
#[doc = "@brief GAP Encryption Information."]
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct ble_gap_enc_info_t {
    #[doc = "< Long Term Key."]
    pub ltk: [u8; 16usize],
    pub _bitfield_align_1: [u8; 0],
    pub _bitfield_1: __BindgenBitfieldUnit<[u8; 1usize]>,
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of ble_gap_enc_info_t"][::core::mem::size_of::<ble_gap_enc_info_t>() - 17usize];
    ["Alignment of ble_gap_enc_info_t"][::core::mem::align_of::<ble_gap_enc_info_t>() - 1usize];
    ["Offset of field: ble_gap_enc_info_t::ltk"][::core::mem::offset_of!(ble_gap_enc_info_t, ltk) - 0usize];
};
impl ble_gap_enc_info_t {
    #[inline]
    pub fn lesc(&self) -> u8 {
        unsafe { ::core::mem::transmute(self._bitfield_1.get(0usize, 1u8) as u8) }
    }
    #[inline]
    pub fn set_lesc(&mut self, val: u8) {
        unsafe {
            let val: u8 = ::core::mem::transmute(val);
            self._bitfield_1.set(0usize, 1u8, val as u64)
        }
    }
    #[inline]
    pub unsafe fn lesc_raw(this: *const Self) -> u8 {
        unsafe {
            ::core::mem::transmute(<__BindgenBitfieldUnit<[u8; 1usize]>>::raw_get(
                ::core::ptr::addr_of!((*this)._bitfield_1),
                0usize,
                1u8,
            ) as u8)
        }
    }
    #[inline]
    pub unsafe fn set_lesc_raw(this: *mut Self, val: u8) {
        unsafe {
            let val: u8 = ::core::mem::transmute(val);
            <__BindgenBitfieldUnit<[u8; 1usize]>>::raw_set(
                ::core::ptr::addr_of_mut!((*this)._bitfield_1),
                0usize,
                1u8,
                val as u64,
            )
        }
    }
    #[inline]
    pub fn auth(&self) -> u8 {
        unsafe { ::core::mem::transmute(self._bitfield_1.get(1usize, 1u8) as u8) }
    }
    #[inline]
    pub fn set_auth(&mut self, val: u8) {
        unsafe {
            let val: u8 = ::core::mem::transmute(val);
            self._bitfield_1.set(1usize, 1u8, val as u64)
        }
    }
    #[inline]
    pub unsafe fn auth_raw(this: *const Self) -> u8 {
        unsafe {
            ::core::mem::transmute(<__BindgenBitfieldUnit<[u8; 1usize]>>::raw_get(
                ::core::ptr::addr_of!((*this)._bitfield_1),
                1usize,
                1u8,
            ) as u8)
        }
    }
    #[inline]
    pub unsafe fn set_auth_raw(this: *mut Self, val: u8) {
        unsafe {
            let val: u8 = ::core::mem::transmute(val);
            <__BindgenBitfieldUnit<[u8; 1usize]>>::raw_set(
                ::core::ptr::addr_of_mut!((*this)._bitfield_1),
                1usize,
                1u8,
                val as u64,
            )
        }
    }
    #[inline]
    pub fn ltk_len(&self) -> u8 {
        unsafe { ::core::mem::transmute(self._bitfield_1.get(2usize, 6u8) as u8) }
    }
    #[inline]
    pub fn set_ltk_len(&mut self, val: u8) {
        unsafe {
            let val: u8 = ::core::mem::transmute(val);
            self._bitfield_1.set(2usize, 6u8, val as u64)
        }
    }
    #[inline]
    pub unsafe fn ltk_len_raw(this: *const Self) -> u8 {
        unsafe {
            ::core::mem::transmute(<__BindgenBitfieldUnit<[u8; 1usize]>>::raw_get(
                ::core::ptr::addr_of!((*this)._bitfield_1),
                2usize,
                6u8,
            ) as u8)
        }
    }
    #[inline]
    pub unsafe fn set_ltk_len_raw(this: *mut Self, val: u8) {
        unsafe {
            let val: u8 = ::core::mem::transmute(val);
            <__BindgenBitfieldUnit<[u8; 1usize]>>::raw_set(
                ::core::ptr::addr_of_mut!((*this)._bitfield_1),
                2usize,
                6u8,
                val as u64,
            )
        }
    }
    #[inline]
    pub fn new_bitfield_1(lesc: u8, auth: u8, ltk_len: u8) -> __BindgenBitfieldUnit<[u8; 1usize]> {
        let mut __bindgen_bitfield_unit: __BindgenBitfieldUnit<[u8; 1usize]> = Default::default();
        __bindgen_bitfield_unit.set(0usize, 1u8, {
            let lesc: u8 = unsafe { ::core::mem::transmute(lesc) };
            lesc as u64
        });
        __bindgen_bitfield_unit.set(1usize, 1u8, {
            let auth: u8 = unsafe { ::core::mem::transmute(auth) };
            auth as u64
        });
        __bindgen_bitfield_unit.set(2usize, 6u8, {
            let ltk_len: u8 = unsafe { ::core::mem::transmute(ltk_len) };
            ltk_len as u64
        });
        __bindgen_bitfield_unit
    }
}
#[doc = "@brief GAP Master Identification."]
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct ble_gap_master_id_t {
    #[doc = "< Encrypted Diversifier."]
    pub ediv: u16,
    #[doc = "< Random Number."]
    pub rand: [u8; 8usize],
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of ble_gap_master_id_t"][::core::mem::size_of::<ble_gap_master_id_t>() - 10usize];
    ["Alignment of ble_gap_master_id_t"][::core::mem::align_of::<ble_gap_master_id_t>() - 2usize];
    ["Offset of field: ble_gap_master_id_t::ediv"][::core::mem::offset_of!(ble_gap_master_id_t, ediv) - 0usize];
    ["Offset of field: ble_gap_master_id_t::rand"][::core::mem::offset_of!(ble_gap_master_id_t, rand) - 2usize];
};
#[doc = "@brief GAP Signing Information."]
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct ble_gap_sign_info_t {
    #[doc = "< Connection Signature Resolving Key."]
    pub csrk: [u8; 16usize],
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of ble_gap_sign_info_t"][::core::mem::size_of::<ble_gap_sign_info_t>() - 16usize];
    ["Alignment of ble_gap_sign_info_t"][::core::mem::align_of::<ble_gap_sign_info_t>() - 1usize];
    ["Offset of field: ble_gap_sign_info_t::csrk"][::core::mem::offset_of!(ble_gap_sign_info_t, csrk) - 0usize];
};
#[doc = "@brief GAP LE Secure Connections P-256 Public Key."]
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct ble_gap_lesc_p256_pk_t {
    #[doc = "< LE Secure Connections Elliptic Curve Diffie-Hellman P-256 Public Key. Stored in the standard SMP protocol format: {X,Y} both in little-endian."]
    pub pk: [u8; 64usize],
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of ble_gap_lesc_p256_pk_t"][::core::mem::size_of::<ble_gap_lesc_p256_pk_t>() - 64usize];
    ["Alignment of ble_gap_lesc_p256_pk_t"][::core::mem::align_of::<ble_gap_lesc_p256_pk_t>() - 1usize];
    ["Offset of field: ble_gap_lesc_p256_pk_t::pk"][::core::mem::offset_of!(ble_gap_lesc_p256_pk_t, pk) - 0usize];
};
#[doc = "@brief GAP LE Secure Connections DHKey."]
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct ble_gap_lesc_dhkey_t {
    #[doc = "< LE Secure Connections Elliptic Curve Diffie-Hellman Key. Stored in little-endian."]
    pub key: [u8; 32usize],
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of ble_gap_lesc_dhkey_t"][::core::mem::size_of::<ble_gap_lesc_dhkey_t>() - 32usize];
    ["Alignment of ble_gap_lesc_dhkey_t"][::core::mem::align_of::<ble_gap_lesc_dhkey_t>() - 1usize];
    ["Offset of field: ble_gap_lesc_dhkey_t::key"][::core::mem::offset_of!(ble_gap_lesc_dhkey_t, key) - 0usize];
};
#[doc = "@brief GAP LE Secure Connections OOB data."]
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct ble_gap_lesc_oob_data_t {
    #[doc = "< Bluetooth address of the device."]
    pub addr: ble_gap_addr_t,
    #[doc = "< Random Number."]
    pub r: [u8; 16usize],
    #[doc = "< Confirm Value."]
    pub c: [u8; 16usize],
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of ble_gap_lesc_oob_data_t"][::core::mem::size_of::<ble_gap_lesc_oob_data_t>() - 39usize];
    ["Alignment of ble_gap_lesc_oob_data_t"][::core::mem::align_of::<ble_gap_lesc_oob_data_t>() - 1usize];
    ["Offset of field: ble_gap_lesc_oob_data_t::addr"][::core::mem::offset_of!(ble_gap_lesc_oob_data_t, addr) - 0usize];
    ["Offset of field: ble_gap_lesc_oob_data_t::r"][::core::mem::offset_of!(ble_gap_lesc_oob_data_t, r) - 7usize];
    ["Offset of field: ble_gap_lesc_oob_data_t::c"][::core::mem::offset_of!(ble_gap_lesc_oob_data_t, c) - 23usize];
};
#[doc = "@brief Event structure for @ref BLE_GAP_EVT_CONNECTED."]
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct ble_gap_evt_connected_t {
    #[doc = "< Bluetooth address of the peer device. If the peer_addr resolved: @ref ble_gap_addr_t::addr_id_peer is set to 1\nand the address is the device's identity address."]
    pub peer_addr: ble_gap_addr_t,
    #[doc = "< BLE role for this connection, see @ref BLE_GAP_ROLES"]
    pub role: u8,
    #[doc = "< GAP Connection Parameters."]
    pub conn_params: ble_gap_conn_params_t,
    #[doc = "< Advertising handle in which advertising has ended.\nThis variable is only set if role is set to @ref BLE_GAP_ROLE_PERIPH."]
    pub adv_handle: u8,
    #[doc = "< Advertising buffers corresponding to the terminated\nadvertising set. The advertising buffers provided in\n@ref sd_ble_gap_adv_set_configure are now released.\nThis variable is only set if role is set to @ref BLE_GAP_ROLE_PERIPH."]
    pub adv_data: ble_gap_adv_data_t,
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of ble_gap_evt_connected_t"][::core::mem::size_of::<ble_gap_evt_connected_t>() - 36usize];
    ["Alignment of ble_gap_evt_connected_t"][::core::mem::align_of::<ble_gap_evt_connected_t>() - 4usize];
    ["Offset of field: ble_gap_evt_connected_t::peer_addr"]
        [::core::mem::offset_of!(ble_gap_evt_connected_t, peer_addr) - 0usize];
    ["Offset of field: ble_gap_evt_connected_t::role"][::core::mem::offset_of!(ble_gap_evt_connected_t, role) - 7usize];
    ["Offset of field: ble_gap_evt_connected_t::conn_params"]
        [::core::mem::offset_of!(ble_gap_evt_connected_t, conn_params) - 8usize];
    ["Offset of field: ble_gap_evt_connected_t::adv_handle"]
        [::core::mem::offset_of!(ble_gap_evt_connected_t, adv_handle) - 16usize];
    ["Offset of field: ble_gap_evt_connected_t::adv_data"]
        [::core::mem::offset_of!(ble_gap_evt_connected_t, adv_data) - 20usize];
};
#[doc = "@brief Event structure for @ref BLE_GAP_EVT_DISCONNECTED."]
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct ble_gap_evt_disconnected_t {
    #[doc = "< HCI error code, see @ref BLE_HCI_STATUS_CODES."]
    pub reason: u8,
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of ble_gap_evt_disconnected_t"][::core::mem::size_of::<ble_gap_evt_disconnected_t>() - 1usize];
    ["Alignment of ble_gap_evt_disconnected_t"][::core::mem::align_of::<ble_gap_evt_disconnected_t>() - 1usize];
    ["Offset of field: ble_gap_evt_disconnected_t::reason"]
        [::core::mem::offset_of!(ble_gap_evt_disconnected_t, reason) - 0usize];
};
#[doc = "@brief Event structure for @ref BLE_GAP_EVT_CONN_PARAM_UPDATE."]
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct ble_gap_evt_conn_param_update_t {
    #[doc = "<  GAP Connection Parameters."]
    pub conn_params: ble_gap_conn_params_t,
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of ble_gap_evt_conn_param_update_t"][::core::mem::size_of::<ble_gap_evt_conn_param_update_t>() - 8usize];
    ["Alignment of ble_gap_evt_conn_param_update_t"]
        [::core::mem::align_of::<ble_gap_evt_conn_param_update_t>() - 2usize];
    ["Offset of field: ble_gap_evt_conn_param_update_t::conn_params"]
        [::core::mem::offset_of!(ble_gap_evt_conn_param_update_t, conn_params) - 0usize];
};
#[doc = "@brief Event structure for @ref BLE_GAP_EVT_PHY_UPDATE_REQUEST."]
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct ble_gap_evt_phy_update_request_t {
    #[doc = "< The PHYs the peer prefers to use."]
    pub peer_preferred_phys: ble_gap_phys_t,
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of ble_gap_evt_phy_update_request_t"][::core::mem::size_of::<ble_gap_evt_phy_update_request_t>() - 2usize];
    ["Alignment of ble_gap_evt_phy_update_request_t"]
        [::core::mem::align_of::<ble_gap_evt_phy_update_request_t>() - 1usize];
    ["Offset of field: ble_gap_evt_phy_update_request_t::peer_preferred_phys"]
        [::core::mem::offset_of!(ble_gap_evt_phy_update_request_t, peer_preferred_phys) - 0usize];
};
#[doc = "@brief Event Structure for @ref BLE_GAP_EVT_PHY_UPDATE."]
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct ble_gap_evt_phy_update_t {
    #[doc = "< Status of the procedure, see @ref BLE_HCI_STATUS_CODES."]
    pub status: u8,
    #[doc = "< TX PHY for this connection, see @ref BLE_GAP_PHYS."]
    pub tx_phy: u8,
    #[doc = "< RX PHY for this connection, see @ref BLE_GAP_PHYS."]
    pub rx_phy: u8,
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of ble_gap_evt_phy_update_t"][::core::mem::size_of::<ble_gap_evt_phy_update_t>() - 3usize];
    ["Alignment of ble_gap_evt_phy_update_t"][::core::mem::align_of::<ble_gap_evt_phy_update_t>() - 1usize];
    ["Offset of field: ble_gap_evt_phy_update_t::status"]
        [::core::mem::offset_of!(ble_gap_evt_phy_update_t, status) - 0usize];
    ["Offset of field: ble_gap_evt_phy_update_t::tx_phy"]
        [::core::mem::offset_of!(ble_gap_evt_phy_update_t, tx_phy) - 1usize];
    ["Offset of field: ble_gap_evt_phy_update_t::rx_phy"]
        [::core::mem::offset_of!(ble_gap_evt_phy_update_t, rx_phy) - 2usize];
};
#[doc = "@brief Event structure for @ref BLE_GAP_EVT_SEC_PARAMS_REQUEST."]
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct ble_gap_evt_sec_params_request_t {
    #[doc = "< Initiator Security Parameters."]
    pub peer_params: ble_gap_sec_params_t,
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of ble_gap_evt_sec_params_request_t"][::core::mem::size_of::<ble_gap_evt_sec_params_request_t>() - 5usize];
    ["Alignment of ble_gap_evt_sec_params_request_t"]
        [::core::mem::align_of::<ble_gap_evt_sec_params_request_t>() - 1usize];
    ["Offset of field: ble_gap_evt_sec_params_request_t::peer_params"]
        [::core::mem::offset_of!(ble_gap_evt_sec_params_request_t, peer_params) - 0usize];
};
#[doc = "@brief Event structure for @ref BLE_GAP_EVT_SEC_INFO_REQUEST."]
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct ble_gap_evt_sec_info_request_t {
    #[doc = "< Bluetooth address of the peer device."]
    pub peer_addr: ble_gap_addr_t,
    #[doc = "< Master Identification for LTK lookup."]
    pub master_id: ble_gap_master_id_t,
    pub _bitfield_align_1: [u8; 0],
    pub _bitfield_1: __BindgenBitfieldUnit<[u8; 1usize]>,
    pub __bindgen_padding_0: u8,
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of ble_gap_evt_sec_info_request_t"][::core::mem::size_of::<ble_gap_evt_sec_info_request_t>() - 20usize];
    ["Alignment of ble_gap_evt_sec_info_request_t"][::core::mem::align_of::<ble_gap_evt_sec_info_request_t>() - 2usize];
    ["Offset of field: ble_gap_evt_sec_info_request_t::peer_addr"]
        [::core::mem::offset_of!(ble_gap_evt_sec_info_request_t, peer_addr) - 0usize];
    ["Offset of field: ble_gap_evt_sec_info_request_t::master_id"]
        [::core::mem::offset_of!(ble_gap_evt_sec_info_request_t, master_id) - 8usize];
};
impl ble_gap_evt_sec_info_request_t {
    #[inline]
    pub fn enc_info(&self) -> u8 {
        unsafe { ::core::mem::transmute(self._bitfield_1.get(0usize, 1u8) as u8) }
    }
    #[inline]
    pub fn set_enc_info(&mut self, val: u8) {
        unsafe {
            let val: u8 = ::core::mem::transmute(val);
            self._bitfield_1.set(0usize, 1u8, val as u64)
        }
    }
    #[inline]
    pub unsafe fn enc_info_raw(this: *const Self) -> u8 {
        unsafe {
            ::core::mem::transmute(<__BindgenBitfieldUnit<[u8; 1usize]>>::raw_get(
                ::core::ptr::addr_of!((*this)._bitfield_1),
                0usize,
                1u8,
            ) as u8)
        }
    }
    #[inline]
    pub unsafe fn set_enc_info_raw(this: *mut Self, val: u8) {
        unsafe {
            let val: u8 = ::core::mem::transmute(val);
            <__BindgenBitfieldUnit<[u8; 1usize]>>::raw_set(
                ::core::ptr::addr_of_mut!((*this)._bitfield_1),
                0usize,
                1u8,
                val as u64,
            )
        }
    }
    #[inline]
    pub fn id_info(&self) -> u8 {
        unsafe { ::core::mem::transmute(self._bitfield_1.get(1usize, 1u8) as u8) }
    }
    #[inline]
    pub fn set_id_info(&mut self, val: u8) {
        unsafe {
            let val: u8 = ::core::mem::transmute(val);
            self._bitfield_1.set(1usize, 1u8, val as u64)
        }
    }
    #[inline]
    pub unsafe fn id_info_raw(this: *const Self) -> u8 {
        unsafe {
            ::core::mem::transmute(<__BindgenBitfieldUnit<[u8; 1usize]>>::raw_get(
                ::core::ptr::addr_of!((*this)._bitfield_1),
                1usize,
                1u8,
            ) as u8)
        }
    }
    #[inline]
    pub unsafe fn set_id_info_raw(this: *mut Self, val: u8) {
        unsafe {
            let val: u8 = ::core::mem::transmute(val);
            <__BindgenBitfieldUnit<[u8; 1usize]>>::raw_set(
                ::core::ptr::addr_of_mut!((*this)._bitfield_1),
                1usize,
                1u8,
                val as u64,
            )
        }
    }
    #[inline]
    pub fn sign_info(&self) -> u8 {
        unsafe { ::core::mem::transmute(self._bitfield_1.get(2usize, 1u8) as u8) }
    }
    #[inline]
    pub fn set_sign_info(&mut self, val: u8) {
        unsafe {
            let val: u8 = ::core::mem::transmute(val);
            self._bitfield_1.set(2usize, 1u8, val as u64)
        }
    }
    #[inline]
    pub unsafe fn sign_info_raw(this: *const Self) -> u8 {
        unsafe {
            ::core::mem::transmute(<__BindgenBitfieldUnit<[u8; 1usize]>>::raw_get(
                ::core::ptr::addr_of!((*this)._bitfield_1),
                2usize,
                1u8,
            ) as u8)
        }
    }
    #[inline]
    pub unsafe fn set_sign_info_raw(this: *mut Self, val: u8) {
        unsafe {
            let val: u8 = ::core::mem::transmute(val);
            <__BindgenBitfieldUnit<[u8; 1usize]>>::raw_set(
                ::core::ptr::addr_of_mut!((*this)._bitfield_1),
                2usize,
                1u8,
                val as u64,
            )
        }
    }
    #[inline]
    pub fn new_bitfield_1(enc_info: u8, id_info: u8, sign_info: u8) -> __BindgenBitfieldUnit<[u8; 1usize]> {
        let mut __bindgen_bitfield_unit: __BindgenBitfieldUnit<[u8; 1usize]> = Default::default();
        __bindgen_bitfield_unit.set(0usize, 1u8, {
            let enc_info: u8 = unsafe { ::core::mem::transmute(enc_info) };
            enc_info as u64
        });
        __bindgen_bitfield_unit.set(1usize, 1u8, {
            let id_info: u8 = unsafe { ::core::mem::transmute(id_info) };
            id_info as u64
        });
        __bindgen_bitfield_unit.set(2usize, 1u8, {
            let sign_info: u8 = unsafe { ::core::mem::transmute(sign_info) };
            sign_info as u64
        });
        __bindgen_bitfield_unit
    }
}
#[doc = "@brief Event structure for @ref BLE_GAP_EVT_PASSKEY_DISPLAY."]
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct ble_gap_evt_passkey_display_t {
    #[doc = "< 6-digit passkey in ASCII ('0'-'9' digits only)."]
    pub passkey: [u8; 6usize],
    pub _bitfield_align_1: [u8; 0],
    pub _bitfield_1: __BindgenBitfieldUnit<[u8; 1usize]>,
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of ble_gap_evt_passkey_display_t"][::core::mem::size_of::<ble_gap_evt_passkey_display_t>() - 7usize];
    ["Alignment of ble_gap_evt_passkey_display_t"][::core::mem::align_of::<ble_gap_evt_passkey_display_t>() - 1usize];
    ["Offset of field: ble_gap_evt_passkey_display_t::passkey"]
        [::core::mem::offset_of!(ble_gap_evt_passkey_display_t, passkey) - 0usize];
};
impl ble_gap_evt_passkey_display_t {
    #[inline]
    pub fn match_request(&self) -> u8 {
        unsafe { ::core::mem::transmute(self._bitfield_1.get(0usize, 1u8) as u8) }
    }
    #[inline]
    pub fn set_match_request(&mut self, val: u8) {
        unsafe {
            let val: u8 = ::core::mem::transmute(val);
            self._bitfield_1.set(0usize, 1u8, val as u64)
        }
    }
    #[inline]
    pub unsafe fn match_request_raw(this: *const Self) -> u8 {
        unsafe {
            ::core::mem::transmute(<__BindgenBitfieldUnit<[u8; 1usize]>>::raw_get(
                ::core::ptr::addr_of!((*this)._bitfield_1),
                0usize,
                1u8,
            ) as u8)
        }
    }
    #[inline]
    pub unsafe fn set_match_request_raw(this: *mut Self, val: u8) {
        unsafe {
            let val: u8 = ::core::mem::transmute(val);
            <__BindgenBitfieldUnit<[u8; 1usize]>>::raw_set(
                ::core::ptr::addr_of_mut!((*this)._bitfield_1),
                0usize,
                1u8,
                val as u64,
            )
        }
    }
    #[inline]
    pub fn new_bitfield_1(match_request: u8) -> __BindgenBitfieldUnit<[u8; 1usize]> {
        let mut __bindgen_bitfield_unit: __BindgenBitfieldUnit<[u8; 1usize]> = Default::default();
        __bindgen_bitfield_unit.set(0usize, 1u8, {
            let match_request: u8 = unsafe { ::core::mem::transmute(match_request) };
            match_request as u64
        });
        __bindgen_bitfield_unit
    }
}
#[doc = "@brief Event structure for @ref BLE_GAP_EVT_KEY_PRESSED."]
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct ble_gap_evt_key_pressed_t {
    #[doc = "< Keypress notification type, see @ref BLE_GAP_KP_NOT_TYPES."]
    pub kp_not: u8,
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of ble_gap_evt_key_pressed_t"][::core::mem::size_of::<ble_gap_evt_key_pressed_t>() - 1usize];
    ["Alignment of ble_gap_evt_key_pressed_t"][::core::mem::align_of::<ble_gap_evt_key_pressed_t>() - 1usize];
    ["Offset of field: ble_gap_evt_key_pressed_t::kp_not"]
        [::core::mem::offset_of!(ble_gap_evt_key_pressed_t, kp_not) - 0usize];
};
#[doc = "@brief Event structure for @ref BLE_GAP_EVT_AUTH_KEY_REQUEST."]
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct ble_gap_evt_auth_key_request_t {
    #[doc = "< See @ref BLE_GAP_AUTH_KEY_TYPES."]
    pub key_type: u8,
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of ble_gap_evt_auth_key_request_t"][::core::mem::size_of::<ble_gap_evt_auth_key_request_t>() - 1usize];
    ["Alignment of ble_gap_evt_auth_key_request_t"][::core::mem::align_of::<ble_gap_evt_auth_key_request_t>() - 1usize];
    ["Offset of field: ble_gap_evt_auth_key_request_t::key_type"]
        [::core::mem::offset_of!(ble_gap_evt_auth_key_request_t, key_type) - 0usize];
};
#[doc = "@brief Event structure for @ref BLE_GAP_EVT_LESC_DHKEY_REQUEST."]
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct ble_gap_evt_lesc_dhkey_request_t {
    #[doc = "< LE Secure Connections remote P-256 Public Key. This will point to the application-supplied memory\ninside the keyset during the call to @ref sd_ble_gap_sec_params_reply."]
    pub p_pk_peer: *mut ble_gap_lesc_p256_pk_t,
    pub _bitfield_align_1: [u8; 0],
    pub _bitfield_1: __BindgenBitfieldUnit<[u8; 1usize]>,
    pub __bindgen_padding_0: [u8; 3usize],
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of ble_gap_evt_lesc_dhkey_request_t"][::core::mem::size_of::<ble_gap_evt_lesc_dhkey_request_t>() - 8usize];
    ["Alignment of ble_gap_evt_lesc_dhkey_request_t"]
        [::core::mem::align_of::<ble_gap_evt_lesc_dhkey_request_t>() - 4usize];
    ["Offset of field: ble_gap_evt_lesc_dhkey_request_t::p_pk_peer"]
        [::core::mem::offset_of!(ble_gap_evt_lesc_dhkey_request_t, p_pk_peer) - 0usize];
};
impl ble_gap_evt_lesc_dhkey_request_t {
    #[inline]
    pub fn oobd_req(&self) -> u8 {
        unsafe { ::core::mem::transmute(self._bitfield_1.get(0usize, 1u8) as u8) }
    }
    #[inline]
    pub fn set_oobd_req(&mut self, val: u8) {
        unsafe {
            let val: u8 = ::core::mem::transmute(val);
            self._bitfield_1.set(0usize, 1u8, val as u64)
        }
    }
    #[inline]
    pub unsafe fn oobd_req_raw(this: *const Self) -> u8 {
        unsafe {
            ::core::mem::transmute(<__BindgenBitfieldUnit<[u8; 1usize]>>::raw_get(
                ::core::ptr::addr_of!((*this)._bitfield_1),
                0usize,
                1u8,
            ) as u8)
        }
    }
    #[inline]
    pub unsafe fn set_oobd_req_raw(this: *mut Self, val: u8) {
        unsafe {
            let val: u8 = ::core::mem::transmute(val);
            <__BindgenBitfieldUnit<[u8; 1usize]>>::raw_set(
                ::core::ptr::addr_of_mut!((*this)._bitfield_1),
                0usize,
                1u8,
                val as u64,
            )
        }
    }
    #[inline]
    pub fn new_bitfield_1(oobd_req: u8) -> __BindgenBitfieldUnit<[u8; 1usize]> {
        let mut __bindgen_bitfield_unit: __BindgenBitfieldUnit<[u8; 1usize]> = Default::default();
        __bindgen_bitfield_unit.set(0usize, 1u8, {
            let oobd_req: u8 = unsafe { ::core::mem::transmute(oobd_req) };
            oobd_req as u64
        });
        __bindgen_bitfield_unit
    }
}
#[doc = "@brief Security levels supported.\n @note  See Bluetooth Specification Version 4.2 Volume 3, Part C, Chapter 10, Section 10.2.1."]
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct ble_gap_sec_levels_t {
    pub _bitfield_align_1: [u8; 0],
    pub _bitfield_1: __BindgenBitfieldUnit<[u8; 1usize]>,
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of ble_gap_sec_levels_t"][::core::mem::size_of::<ble_gap_sec_levels_t>() - 1usize];
    ["Alignment of ble_gap_sec_levels_t"][::core::mem::align_of::<ble_gap_sec_levels_t>() - 1usize];
};
impl ble_gap_sec_levels_t {
    #[inline]
    pub fn lv1(&self) -> u8 {
        unsafe { ::core::mem::transmute(self._bitfield_1.get(0usize, 1u8) as u8) }
    }
    #[inline]
    pub fn set_lv1(&mut self, val: u8) {
        unsafe {
            let val: u8 = ::core::mem::transmute(val);
            self._bitfield_1.set(0usize, 1u8, val as u64)
        }
    }
    #[inline]
    pub unsafe fn lv1_raw(this: *const Self) -> u8 {
        unsafe {
            ::core::mem::transmute(<__BindgenBitfieldUnit<[u8; 1usize]>>::raw_get(
                ::core::ptr::addr_of!((*this)._bitfield_1),
                0usize,
                1u8,
            ) as u8)
        }
    }
    #[inline]
    pub unsafe fn set_lv1_raw(this: *mut Self, val: u8) {
        unsafe {
            let val: u8 = ::core::mem::transmute(val);
            <__BindgenBitfieldUnit<[u8; 1usize]>>::raw_set(
                ::core::ptr::addr_of_mut!((*this)._bitfield_1),
                0usize,
                1u8,
                val as u64,
            )
        }
    }
    #[inline]
    pub fn lv2(&self) -> u8 {
        unsafe { ::core::mem::transmute(self._bitfield_1.get(1usize, 1u8) as u8) }
    }
    #[inline]
    pub fn set_lv2(&mut self, val: u8) {
        unsafe {
            let val: u8 = ::core::mem::transmute(val);
            self._bitfield_1.set(1usize, 1u8, val as u64)
        }
    }
    #[inline]
    pub unsafe fn lv2_raw(this: *const Self) -> u8 {
        unsafe {
            ::core::mem::transmute(<__BindgenBitfieldUnit<[u8; 1usize]>>::raw_get(
                ::core::ptr::addr_of!((*this)._bitfield_1),
                1usize,
                1u8,
            ) as u8)
        }
    }
    #[inline]
    pub unsafe fn set_lv2_raw(this: *mut Self, val: u8) {
        unsafe {
            let val: u8 = ::core::mem::transmute(val);
            <__BindgenBitfieldUnit<[u8; 1usize]>>::raw_set(
                ::core::ptr::addr_of_mut!((*this)._bitfield_1),
                1usize,
                1u8,
                val as u64,
            )
        }
    }
    #[inline]
    pub fn lv3(&self) -> u8 {
        unsafe { ::core::mem::transmute(self._bitfield_1.get(2usize, 1u8) as u8) }
    }
    #[inline]
    pub fn set_lv3(&mut self, val: u8) {
        unsafe {
            let val: u8 = ::core::mem::transmute(val);
            self._bitfield_1.set(2usize, 1u8, val as u64)
        }
    }
    #[inline]
    pub unsafe fn lv3_raw(this: *const Self) -> u8 {
        unsafe {
            ::core::mem::transmute(<__BindgenBitfieldUnit<[u8; 1usize]>>::raw_get(
                ::core::ptr::addr_of!((*this)._bitfield_1),
                2usize,
                1u8,
            ) as u8)
        }
    }
    #[inline]
    pub unsafe fn set_lv3_raw(this: *mut Self, val: u8) {
        unsafe {
            let val: u8 = ::core::mem::transmute(val);
            <__BindgenBitfieldUnit<[u8; 1usize]>>::raw_set(
                ::core::ptr::addr_of_mut!((*this)._bitfield_1),
                2usize,
                1u8,
                val as u64,
            )
        }
    }
    #[inline]
    pub fn lv4(&self) -> u8 {
        unsafe { ::core::mem::transmute(self._bitfield_1.get(3usize, 1u8) as u8) }
    }
    #[inline]
    pub fn set_lv4(&mut self, val: u8) {
        unsafe {
            let val: u8 = ::core::mem::transmute(val);
            self._bitfield_1.set(3usize, 1u8, val as u64)
        }
    }
    #[inline]
    pub unsafe fn lv4_raw(this: *const Self) -> u8 {
        unsafe {
            ::core::mem::transmute(<__BindgenBitfieldUnit<[u8; 1usize]>>::raw_get(
                ::core::ptr::addr_of!((*this)._bitfield_1),
                3usize,
                1u8,
            ) as u8)
